Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 62, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061062u)

/** \brief 64, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061064u)

/** \brief 66, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061066u)

/** \brief 68, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061068u)

/** \brief 6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006106Au)

/** \brief 6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006106Cu)

/** \brief 6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006106Eu)

/** \brief 70, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061070u)

/** \brief 72, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061072u)

/** \brief 74, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061074u)

/** \brief 76, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061076u)

/** \brief 78, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061078u)

/** \brief 7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006107Au)

/** \brief 7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006107Cu)

/** \brief 7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006107Eu)

/** \brief 80, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061080u)

/** \brief 82, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061082u)

/** \brief 84, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061084u)

/** \brief 86, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061086u)

/** \brief 88, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061088u)

/** \brief 8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006108Au)

/** \brief 8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006108Cu)

/** \brief 8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006108Eu)

/** \brief 90, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061090u)

/** \brief 92, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061092u)

/** \brief 94, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061094u)

/** \brief 96, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061096u)

/** \brief 98, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061098u)

/** \brief 9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006109Au)

/** \brief 9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006109Cu)

/** \brief 9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006109Eu)

/** \brief A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A0u)

/** \brief A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A2u)

/** \brief A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A4u)

/** \brief A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A6u)

/** \brief A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A8u)

/** \brief AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610AAu)

/** \brief AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610ACu)

/** \brief AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610AEu)

/** \brief B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B0u)

/** \brief B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B2u)

/** \brief B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B4u)

/** \brief B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B6u)

/** \brief B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B8u)

