Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610BAu)

/** \brief BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610BCu)

/** \brief BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610BEu)

/** \brief C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C0u)

/** \brief C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C2u)

/** \brief C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C4u)

/** \brief C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C6u)

/** \brief C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C8u)

/** \brief CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610CAu)

/** \brief CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610CCu)

/** \brief CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610CEu)

/** \brief D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D0u)

/** \brief D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D2u)

/** \brief D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D4u)

/** \brief D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D6u)

/** \brief D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D8u)

/** \brief DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610DAu)

/** \brief DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610DCu)

/** \brief DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610DEu)

/** \brief E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610E0u)

/** \brief E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610E2u)

/** \brief E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC0_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610E4u)

/** \brief F2, Error Information Register ${x} */
#define MTU_MC0_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F2u)

/** \brief F4, Error Information Register ${x} */
#define MTU_MC0_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F4u)

/** \brief F6, Error Information Register ${x} */
#define MTU_MC0_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F6u)

/** \brief F8, Error Information Register ${x} */
#define MTU_MC0_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F8u)

/** \brief FA, Error Information Register ${x} */
#define MTU_MC0_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610FAu)

/** \brief 100, Configuration Register 0 */
#define MTU_MC1_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061100u)

/** \brief 102, Configuration Register 1 */
#define MTU_MC1_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061102u)

/** \brief 104, MBIST Control Register */
#define MTU_MC1_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061104u)

/** \brief 106, Status Register */
#define MTU_MC1_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061106u)

/** \brief 108, Range Register, single address mode */
#define MTU_MC1_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061108u)

/** \brief 10C, Revision ID Register */
#define MTU_MC1_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006110Cu)

/** \brief 10E, ECC Safety Register */
#define MTU_MC1_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006110Eu)

/** \brief 110, Memory ECC Detection Register */
#define MTU_MC1_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061110u)

/** \brief 112, Error Tracking Register ${x} */
#define MTU_MC1_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061112u)

/** \brief 114, Error Tracking Register ${x} */
#define MTU_MC1_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061114u)

/** \brief 116, Error Tracking Register ${x} */
#define MTU_MC1_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061116u)

/** \brief 118, Error Tracking Register ${x} */
#define MTU_MC1_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061118u)

/** \brief 11A, Error Tracking Register ${x} */
#define MTU_MC1_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006111Au)

/** \brief 160, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061160u)

/** \brief 162, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061162u)

/** \brief 164, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061164u)

/** \brief 166, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061166u)

/** \brief 168, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061168u)

