Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 16A, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006116Au)

/** \brief 16C, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006116Cu)

/** \brief 16E, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006116Eu)

/** \brief 170, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061170u)

/** \brief 172, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061172u)

/** \brief 174, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061174u)

/** \brief 176, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061176u)

/** \brief 178, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061178u)

/** \brief 17A, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006117Au)

/** \brief 17C, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006117Cu)

/** \brief 17E, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006117Eu)

/** \brief 180, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061180u)

/** \brief 182, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061182u)

/** \brief 184, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061184u)

/** \brief 186, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061186u)

/** \brief 188, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061188u)

/** \brief 18A, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006118Au)

/** \brief 18C, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006118Cu)

/** \brief 18E, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006118Eu)

/** \brief 190, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061190u)

/** \brief 192, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061192u)

/** \brief 194, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061194u)

/** \brief 196, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061196u)

/** \brief 198, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061198u)

/** \brief 19A, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006119Au)

/** \brief 19C, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006119Cu)

/** \brief 19E, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006119Eu)

/** \brief 1A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611A0u)

/** \brief 1A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611A2u)

/** \brief 1A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611A4u)

/** \brief 1A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611A6u)

/** \brief 1A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611A8u)

/** \brief 1AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611AAu)

/** \brief 1AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611ACu)

/** \brief 1AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611AEu)

/** \brief 1B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611B0u)

/** \brief 1B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611B2u)

/** \brief 1B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611B4u)

/** \brief 1B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611B6u)

/** \brief 1B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611B8u)

/** \brief 1BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611BAu)

/** \brief 1BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611BCu)

/** \brief 1BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611BEu)

/** \brief 1C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611C0u)

/** \brief 1C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611C2u)

/** \brief 1C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611C4u)

