Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611C6u)

/** \brief 1C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611C8u)

/** \brief 1CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611CAu)

/** \brief 1CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611CCu)

/** \brief 1CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611CEu)

/** \brief 1D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611D0u)

/** \brief 1D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611D2u)

/** \brief 1D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611D4u)

/** \brief 1D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611D6u)

/** \brief 1D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611D8u)

/** \brief 1DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611DAu)

/** \brief 1DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611DCu)

/** \brief 1DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611DEu)

/** \brief 1E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611E0u)

/** \brief 1E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611E2u)

/** \brief 1E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC1_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00611E4u)

/** \brief 1F2, Error Information Register ${x} */
#define MTU_MC1_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00611F2u)

/** \brief 1F4, Error Information Register ${x} */
#define MTU_MC1_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00611F4u)

/** \brief 1F6, Error Information Register ${x} */
#define MTU_MC1_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00611F6u)

/** \brief 1F8, Error Information Register ${x} */
#define MTU_MC1_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00611F8u)

/** \brief 1FA, Error Information Register ${x} */
#define MTU_MC1_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00611FAu)

/** \brief 200, Configuration Register 0 */
#define MTU_MC2_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061200u)

/** \brief 202, Configuration Register 1 */
#define MTU_MC2_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061202u)

/** \brief 204, MBIST Control Register */
#define MTU_MC2_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061204u)

/** \brief 206, Status Register */
#define MTU_MC2_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061206u)

/** \brief 208, Range Register, single address mode */
#define MTU_MC2_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061208u)

/** \brief 20C, Revision ID Register */
#define MTU_MC2_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006120Cu)

/** \brief 20E, ECC Safety Register */
#define MTU_MC2_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006120Eu)

/** \brief 210, Memory ECC Detection Register */
#define MTU_MC2_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061210u)

/** \brief 212, Error Tracking Register ${x} */
#define MTU_MC2_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061212u)

/** \brief 214, Error Tracking Register ${x} */
#define MTU_MC2_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061214u)

/** \brief 216, Error Tracking Register ${x} */
#define MTU_MC2_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061216u)

/** \brief 218, Error Tracking Register ${x} */
#define MTU_MC2_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061218u)

/** \brief 21A, Error Tracking Register ${x} */
#define MTU_MC2_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006121Au)


/** \brief 260, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061260u)

/** \brief 262, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061262u)

/** \brief 264, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061264u)

/** \brief 266, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061266u)

/** \brief 268, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061268u)

/** \brief 26A, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006126Au)

/** \brief 26C, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006126Cu)

/** \brief 26E, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006126Eu)

/** \brief 270, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061270u)

/** \brief 272, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061272u)

/** \brief 274, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061274u)

/** \brief 276, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061276u)

/** \brief 278, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061278u)

/** \brief 27A, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006127Au)

