Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 27C, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006127Cu)

/** \brief 27E, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006127Eu)

/** \brief 280, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061280u)

/** \brief 282, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061282u)

/** \brief 284, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061284u)

/** \brief 286, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061286u)

/** \brief 288, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061288u)

/** \brief 28A, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006128Au)

/** \brief 28C, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006128Cu)

/** \brief 28E, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006128Eu)

/** \brief 290, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061290u)

/** \brief 292, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061292u)

/** \brief 294, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061294u)

/** \brief 296, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061296u)

/** \brief 298, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061298u)

/** \brief 29A, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006129Au)

/** \brief 29C, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006129Cu)

/** \brief 29E, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006129Eu)

/** \brief 2A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A0u)

/** \brief 2A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A2u)

/** \brief 2A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A4u)

/** \brief 2A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A6u)

/** \brief 2A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A8u)

/** \brief 2AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612AAu)

/** \brief 2AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612ACu)

/** \brief 2AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612AEu)

/** \brief 2B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B0u)

/** \brief 2B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B2u)

/** \brief 2B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B4u)

/** \brief 2B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B6u)

/** \brief 2B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B8u)

/** \brief 2BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612BAu)

/** \brief 2BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612BCu)

/** \brief 2BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612BEu)

/** \brief 2C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C0u)

/** \brief 2C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C2u)

/** \brief 2C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C4u)

/** \brief 2C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C6u)

/** \brief 2C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612C8u)

/** \brief 2CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612CAu)

/** \brief 2CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612CCu)

/** \brief 2CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612CEu)

/** \brief 2D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D0u)

/** \brief 2D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D2u)

/** \brief 2D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D4u)

/** \brief 2D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D6u)

/** \brief 2D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612D8u)

