Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612DAu)

/** \brief 2DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612DCu)

/** \brief 2DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612DEu)

/** \brief 2E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612E0u)

/** \brief 2E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612E2u)

/** \brief 2E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC2_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612E4u)

/** \brief 2F2, Error Information Register ${x} */
#define MTU_MC2_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F2u)

/** \brief 2F4, Error Information Register ${x} */
#define MTU_MC2_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F4u)

/** \brief 2F6, Error Information Register ${x} */
#define MTU_MC2_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F6u)

/** \brief 2F8, Error Information Register ${x} */
#define MTU_MC2_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612F8u)

/** \brief 2FA, Error Information Register ${x} */
#define MTU_MC2_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00612FAu)

/** \brief 300, Configuration Register 0 */
#define MTU_MC3_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061300u)

/** \brief 302, Configuration Register 1 */
#define MTU_MC3_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061302u)

/** \brief 304, MBIST Control Register */
#define MTU_MC3_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061304u)

/** \brief 306, Status Register */
#define MTU_MC3_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061306u)

/** \brief 308, Range Register, single address mode */
#define MTU_MC3_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061308u)

/** \brief 30C, Revision ID Register */
#define MTU_MC3_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006130Cu)

/** \brief 30E, ECC Safety Register */
#define MTU_MC3_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006130Eu)

/** \brief 310, Memory ECC Detection Register */
#define MTU_MC3_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061310u)

/** \brief 312, Error Tracking Register ${x} */
#define MTU_MC3_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061312u)

/** \brief 314, Error Tracking Register ${x} */
#define MTU_MC3_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061314u)

/** \brief 316, Error Tracking Register ${x} */
#define MTU_MC3_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061316u)

/** \brief 318, Error Tracking Register ${x} */
#define MTU_MC3_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061318u)

/** \brief 31A, Error Tracking Register ${x} */
#define MTU_MC3_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006131Au)


/** \brief 360, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061360u)

/** \brief 362, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061362u)

/** \brief 364, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061364u)

/** \brief 366, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061366u)

/** \brief 368, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061368u)

/** \brief 36A, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006136Au)

/** \brief 36C, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006136Cu)

/** \brief 36E, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006136Eu)

/** \brief 370, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061370u)

/** \brief 372, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061372u)

/** \brief 374, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061374u)

/** \brief 376, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061376u)

/** \brief 378, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061378u)

/** \brief 37A, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006137Au)

/** \brief 37C, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006137Cu)

/** \brief 37E, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006137Eu)

/** \brief 380, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061380u)

/** \brief 382, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061382u)

/** \brief 384, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061384u)

/** \brief 386, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061386u)

/** \brief 388, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061388u)

