Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 38A, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006138Au)

/** \brief 38C, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006138Cu)

/** \brief 38E, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006138Eu)

/** \brief 390, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061390u)

/** \brief 392, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061392u)

/** \brief 394, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061394u)

/** \brief 396, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061396u)

/** \brief 398, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061398u)

/** \brief 39A, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006139Au)

/** \brief 39C, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006139Cu)

/** \brief 39E, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006139Eu)

/** \brief 3A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A0u)

/** \brief 3A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A2u)

/** \brief 3A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A4u)

/** \brief 3A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A6u)

/** \brief 3A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A8u)

/** \brief 3AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613AAu)

/** \brief 3AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613ACu)

/** \brief 3AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613AEu)

/** \brief 3B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B0u)

/** \brief 3B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B2u)

/** \brief 3B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B4u)

/** \brief 3B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B6u)

/** \brief 3B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B8u)

/** \brief 3BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613BAu)

/** \brief 3BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613BCu)

/** \brief 3BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613BEu)

/** \brief 3C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C0u)

/** \brief 3C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C2u)

/** \brief 3C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C4u)

/** \brief 3C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C6u)

/** \brief 3C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C8u)

/** \brief 3CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613CAu)

/** \brief 3CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613CCu)

/** \brief 3CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613CEu)

/** \brief 3D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D0u)

/** \brief 3D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D2u)

/** \brief 3D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D4u)

/** \brief 3D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D6u)

/** \brief 3D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D8u)

/** \brief 3DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613DAu)

/** \brief 3DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613DCu)

/** \brief 3DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613DEu)

/** \brief 3E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613E0u)

