Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613E2u)

/** \brief 3E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC3_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613E4u)

/** \brief 3F2, Error Information Register ${x} */
#define MTU_MC3_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F2u)

/** \brief 3F4, Error Information Register ${x} */
#define MTU_MC3_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F4u)

/** \brief 3F6, Error Information Register ${x} */
#define MTU_MC3_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F6u)

/** \brief 3F8, Error Information Register ${x} */
#define MTU_MC3_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F8u)

/** \brief 3FA, Error Information Register ${x} */
#define MTU_MC3_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613FAu)

/** \brief 400, Configuration Register 0 */
#define MTU_MC4_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061400u)

/** \brief 402, Configuration Register 1 */
#define MTU_MC4_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061402u)

/** \brief 404, MBIST Control Register */
#define MTU_MC4_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061404u)

/** \brief 406, Status Register */
#define MTU_MC4_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061406u)

/** \brief 408, Range Register, single address mode */
#define MTU_MC4_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061408u)

/** \brief 40C, Revision ID Register */
#define MTU_MC4_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006140Cu)

/** \brief 40E, ECC Safety Register */
#define MTU_MC4_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006140Eu)

/** \brief 410, Memory ECC Detection Register */
#define MTU_MC4_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061410u)

/** \brief 412, Error Tracking Register ${x} */
#define MTU_MC4_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061412u)

/** \brief 414, Error Tracking Register ${x} */
#define MTU_MC4_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061414u)

/** \brief 416, Error Tracking Register ${x} */
#define MTU_MC4_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061416u)

/** \brief 418, Error Tracking Register ${x} */
#define MTU_MC4_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061418u)

/** \brief 41A, Error Tracking Register ${x} */
#define MTU_MC4_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006141Au)

/** \brief 460, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061460u)

/** \brief 462, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061462u)

/** \brief 464, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061464u)

/** \brief 466, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061466u)

/** \brief 468, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061468u)

/** \brief 46A, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006146Au)

/** \brief 46C, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006146Cu)

/** \brief 46E, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006146Eu)

/** \brief 470, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061470u)

/** \brief 472, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061472u)

/** \brief 474, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061474u)

/** \brief 476, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061476u)

/** \brief 478, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061478u)

/** \brief 47A, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006147Au)

/** \brief 47C, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006147Cu)

/** \brief 47E, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006147Eu)

/** \brief 480, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061480u)

/** \brief 482, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061482u)

/** \brief 484, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061484u)

/** \brief 486, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061486u)

/** \brief 488, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061488u)

/** \brief 48A, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006148Au)

/** \brief 48C, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006148Cu)

/** \brief 48E, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006148Eu)

/** \brief 490, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061490u)

