Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 492, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061492u)

/** \brief 494, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061494u)

/** \brief 496, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061496u)

/** \brief 498, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061498u)

/** \brief 49A, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006149Au)

/** \brief 49C, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006149Cu)

/** \brief 49E, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006149Eu)

/** \brief 4A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A0u)

/** \brief 4A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A2u)

/** \brief 4A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A4u)

/** \brief 4A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A6u)

/** \brief 4A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614A8u)

/** \brief 4AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614AAu)

/** \brief 4AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614ACu)

/** \brief 4AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614AEu)

/** \brief 4B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B0u)

/** \brief 4B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B2u)

/** \brief 4B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B4u)

/** \brief 4B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B6u)

/** \brief 4B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B8u)

/** \brief 4BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614BAu)

/** \brief 4BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614BCu)

/** \brief 4BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614BEu)

/** \brief 4C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C0u)

/** \brief 4C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C2u)

/** \brief 4C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C4u)

/** \brief 4C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C6u)

/** \brief 4C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C8u)

/** \brief 4CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614CAu)

/** \brief 4CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614CCu)

/** \brief 4CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614CEu)

/** \brief 4D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D0u)

/** \brief 4D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D2u)

/** \brief 4D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D4u)

/** \brief 4D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D6u)

/** \brief 4D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D8u)

/** \brief 4DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614DAu)

/** \brief 4DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614DCu)

/** \brief 4DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614DEu)

/** \brief 4E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614E0u)

/** \brief 4E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614E2u)

/** \brief 4E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC4_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614E4u)

/** \brief 4F2, Error Information Register ${x} */
#define MTU_MC4_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F2u)

/** \brief 4F4, Error Information Register ${x} */
#define MTU_MC4_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F4u)

