Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4F6, Error Information Register ${x} */
#define MTU_MC4_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F6u)

/** \brief 4F8, Error Information Register ${x} */
#define MTU_MC4_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F8u)

/** \brief 4FA, Error Information Register ${x} */
#define MTU_MC4_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614FAu)

/** \brief 500, Configuration Register 0 */
#define MTU_MC5_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061500u)

/** \brief 502, Configuration Register 1 */
#define MTU_MC5_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061502u)

/** \brief 504, MBIST Control Register */
#define MTU_MC5_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061504u)

/** \brief 506, Status Register */
#define MTU_MC5_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061506u)

/** \brief 508, Range Register, single address mode */
#define MTU_MC5_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061508u)

/** \brief 50C, Revision ID Register */
#define MTU_MC5_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006150Cu)

/** \brief 50E, ECC Safety Register */
#define MTU_MC5_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006150Eu)

/** \brief 510, Memory ECC Detection Register */
#define MTU_MC5_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061510u)

/** \brief 512, Error Tracking Register ${x} */
#define MTU_MC5_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061512u)

/** \brief 514, Error Tracking Register ${x} */
#define MTU_MC5_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061514u)

/** \brief 516, Error Tracking Register ${x} */
#define MTU_MC5_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061516u)

/** \brief 518, Error Tracking Register ${x} */
#define MTU_MC5_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061518u)

/** \brief 51A, Error Tracking Register ${x} */
#define MTU_MC5_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006151Au)

/** \brief 560, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061560u)

/** \brief 562, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061562u)

/** \brief 564, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061564u)

/** \brief 566, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061566u)

/** \brief 568, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061568u)

/** \brief 56A, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006156Au)

/** \brief 56C, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006156Cu)

/** \brief 56E, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006156Eu)

/** \brief 570, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061570u)

/** \brief 572, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061572u)

/** \brief 574, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061574u)

/** \brief 576, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061576u)

/** \brief 578, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061578u)

/** \brief 57A, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006157Au)

/** \brief 57C, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006157Cu)

/** \brief 57E, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006157Eu)

/** \brief 580, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061580u)

/** \brief 582, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061582u)

/** \brief 584, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061584u)

/** \brief 586, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061586u)

/** \brief 588, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061588u)

/** \brief 58A, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006158Au)

/** \brief 58C, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006158Cu)

/** \brief 58E, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006158Eu)

/** \brief 590, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061590u)

/** \brief 592, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061592u)

/** \brief 594, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061594u)

/** \brief 596, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061596u)

