Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 598, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061598u)

/** \brief 59A, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006159Au)

/** \brief 59C, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006159Cu)

/** \brief 59E, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006159Eu)

/** \brief 5A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A0u)

/** \brief 5A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A2u)

/** \brief 5A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A4u)

/** \brief 5A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A6u)

/** \brief 5A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A8u)

/** \brief 5AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615AAu)

/** \brief 5AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615ACu)

/** \brief 5AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615AEu)

/** \brief 5B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B0u)

/** \brief 5B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B2u)

/** \brief 5B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B4u)

/** \brief 5B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B6u)

/** \brief 5B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B8u)

/** \brief 5BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615BAu)

/** \brief 5BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615BCu)

/** \brief 5BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615BEu)

/** \brief 5C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C0u)

/** \brief 5C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C2u)

/** \brief 5C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C4u)

/** \brief 5C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C6u)

/** \brief 5C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C8u)

/** \brief 5CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615CAu)

/** \brief 5CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615CCu)

/** \brief 5CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615CEu)

/** \brief 5D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D0u)

/** \brief 5D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D2u)

/** \brief 5D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D4u)

/** \brief 5D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D6u)

/** \brief 5D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D8u)

/** \brief 5DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DAu)

/** \brief 5DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DCu)

/** \brief 5DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DEu)

/** \brief 5E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E0u)

/** \brief 5E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E2u)

/** \brief 5E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC5_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E4u)

/** \brief 5F2, Error Information Register ${x} */
#define MTU_MC5_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F2u)

/** \brief 5F4, Error Information Register ${x} */
#define MTU_MC5_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F4u)

/** \brief 5F6, Error Information Register ${x} */
#define MTU_MC5_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F6u)

/** \brief 5F8, Error Information Register ${x} */
#define MTU_MC5_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F8u)

