Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5FA, Error Information Register ${x} */
#define MTU_MC5_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615FAu)

/** \brief 600, Configuration Register 0 */
#define MTU_MC6_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061600u)

/** \brief 602, Configuration Register 1 */
#define MTU_MC6_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061602u)

/** \brief 604, MBIST Control Register */
#define MTU_MC6_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061604u)

/** \brief 606, Status Register */
#define MTU_MC6_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061606u)

/** \brief 608, Range Register, single address mode */
#define MTU_MC6_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061608u)

/** \brief 60C, Revision ID Register */
#define MTU_MC6_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006160Cu)

/** \brief 60E, ECC Safety Register */
#define MTU_MC6_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006160Eu)

/** \brief 610, Memory ECC Detection Register */
#define MTU_MC6_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061610u)

/** \brief 612, Error Tracking Register ${x} */
#define MTU_MC6_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061612u)

/** \brief 614, Error Tracking Register ${x} */
#define MTU_MC6_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061614u)

/** \brief 616, Error Tracking Register ${x} */
#define MTU_MC6_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061616u)

/** \brief 618, Error Tracking Register ${x} */
#define MTU_MC6_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061618u)

/** \brief 61A, Error Tracking Register ${x} */
#define MTU_MC6_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006161Au)


/** \brief 660, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061660u)

/** \brief 662, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061662u)

/** \brief 664, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061664u)

/** \brief 666, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061666u)

/** \brief 668, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061668u)

/** \brief 66A, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006166Au)

/** \brief 66C, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006166Cu)

/** \brief 66E, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006166Eu)

/** \brief 670, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061670u)

/** \brief 672, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061672u)

/** \brief 674, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061674u)

/** \brief 676, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061676u)

/** \brief 678, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061678u)

/** \brief 67A, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006167Au)

/** \brief 67C, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006167Cu)

/** \brief 67E, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006167Eu)

/** \brief 680, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061680u)

/** \brief 682, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061682u)

/** \brief 684, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061684u)

/** \brief 686, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061686u)

/** \brief 688, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061688u)

/** \brief 68A, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006168Au)

/** \brief 68C, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006168Cu)

/** \brief 68E, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006168Eu)

/** \brief 690, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061690u)

/** \brief 692, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061692u)

/** \brief 694, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061694u)

/** \brief 696, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061696u)

/** \brief 698, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061698u)

/** \brief 69A, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006169Au)

