Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 69C, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006169Cu)

/** \brief 69E, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006169Eu)

/** \brief 6A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A0u)

/** \brief 6A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A2u)

/** \brief 6A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A4u)

/** \brief 6A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A6u)

/** \brief 6A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A8u)

/** \brief 6AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616AAu)

/** \brief 6AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616ACu)

/** \brief 6AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616AEu)

/** \brief 6B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B0u)

/** \brief 6B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B2u)

/** \brief 6B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B4u)

/** \brief 6B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B6u)

/** \brief 6B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B8u)

/** \brief 6BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BAu)

/** \brief 6BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BCu)

/** \brief 6BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BEu)

/** \brief 6C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C0u)

/** \brief 6C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C2u)

/** \brief 6C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C4u)

/** \brief 6C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C6u)

/** \brief 6C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C8u)

/** \brief 6CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CAu)

/** \brief 6CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CCu)

/** \brief 6CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CEu)

/** \brief 6D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D0u)

/** \brief 6D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D2u)

/** \brief 6D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D4u)

/** \brief 6D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D6u)

/** \brief 6D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D8u)

/** \brief 6DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DAu)

/** \brief 6DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DCu)

/** \brief 6DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DEu)

/** \brief 6E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E0u)

/** \brief 6E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E2u)

/** \brief 6E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC6_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E4u)

/** \brief 6F2, Error Information Register ${x} */
#define MTU_MC6_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F2u)

/** \brief 6F4, Error Information Register ${x} */
#define MTU_MC6_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F4u)

/** \brief 6F6, Error Information Register ${x} */
#define MTU_MC6_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F6u)

/** \brief 6F8, Error Information Register ${x} */
#define MTU_MC6_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F8u)

/** \brief 6FA, Error Information Register ${x} */
#define MTU_MC6_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616FAu)

/** \brief 700, Configuration Register 0 */
#define MTU_MC7_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061700u)

/** \brief 702, Configuration Register 1 */
#define MTU_MC7_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061702u)

/** \brief 704, MBIST Control Register */
#define MTU_MC7_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061704u)

