Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 706, Status Register */
#define MTU_MC7_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061706u)

/** \brief 708, Range Register, single address mode */
#define MTU_MC7_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061708u)

/** \brief 70C, Revision ID Register */
#define MTU_MC7_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006170Cu)

/** \brief 70E, ECC Safety Register */
#define MTU_MC7_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006170Eu)

/** \brief 710, Memory ECC Detection Register */
#define MTU_MC7_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061710u)

/** \brief 712, Error Tracking Register ${x} */
#define MTU_MC7_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061712u)

/** \brief 714, Error Tracking Register ${x} */
#define MTU_MC7_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061714u)

/** \brief 716, Error Tracking Register ${x} */
#define MTU_MC7_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061716u)

/** \brief 718, Error Tracking Register ${x} */
#define MTU_MC7_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061718u)

/** \brief 71A, Error Tracking Register ${x} */
#define MTU_MC7_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006171Au)


/** \brief 760, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061760u)

/** \brief 762, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061762u)

/** \brief 764, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061764u)

/** \brief 766, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061766u)

/** \brief 768, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061768u)

/** \brief 76A, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Au)

/** \brief 76C, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Cu)

/** \brief 76E, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Eu)

/** \brief 770, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061770u)

/** \brief 772, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061772u)

/** \brief 774, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061774u)

/** \brief 776, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061776u)

/** \brief 778, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061778u)

/** \brief 77A, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Au)

/** \brief 77C, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Cu)

/** \brief 77E, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Eu)

/** \brief 780, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061780u)

/** \brief 782, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061782u)

/** \brief 784, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061784u)

/** \brief 786, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061786u)

/** \brief 788, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061788u)

/** \brief 78A, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Au)

/** \brief 78C, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Cu)

/** \brief 78E, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Eu)

/** \brief 790, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061790u)

/** \brief 792, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061792u)

/** \brief 794, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061794u)

/** \brief 796, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061796u)

/** \brief 798, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061798u)

/** \brief 79A, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Au)

/** \brief 79C, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Cu)

/** \brief 79E, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Eu)

/** \brief 7A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A0u)

/** \brief 7A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A2u)

/** \brief 7A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A4u)

/** \brief 7A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A6u)

/** \brief 7A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A8u)

