Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 7AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617AAu)

/** \brief 7AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617ACu)

/** \brief 7AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617AEu)

/** \brief 7B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B0u)

/** \brief 7B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B2u)

/** \brief 7B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B4u)

/** \brief 7B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B6u)

/** \brief 7B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B8u)

/** \brief 7BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BAu)

/** \brief 7BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BCu)

/** \brief 7BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BEu)

/** \brief 7C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C0u)

/** \brief 7C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C2u)

/** \brief 7C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C4u)

/** \brief 7C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C6u)

/** \brief 7C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C8u)

/** \brief 7CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CAu)

/** \brief 7CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CCu)

/** \brief 7CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CEu)

/** \brief 7D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D0u)

/** \brief 7D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D2u)

/** \brief 7D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D4u)

/** \brief 7D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D6u)

/** \brief 7D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D8u)

/** \brief 7DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DAu)

/** \brief 7DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DCu)

/** \brief 7DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DEu)

/** \brief 7E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E0u)

/** \brief 7E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E2u)

/** \brief 7E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC7_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E4u)

/** \brief 7F2, Error Information Register ${x} */
#define MTU_MC7_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F2u)

/** \brief 7F4, Error Information Register ${x} */
#define MTU_MC7_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F4u)

/** \brief 7F6, Error Information Register ${x} */
#define MTU_MC7_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F6u)

/** \brief 7F8, Error Information Register ${x} */
#define MTU_MC7_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F8u)

/** \brief 7FA, Error Information Register ${x} */
#define MTU_MC7_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617FAu)

/** \brief 800, Configuration Register 0 */
#define MTU_MC8_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061800u)

/** \brief 802, Configuration Register 1 */
#define MTU_MC8_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061802u)

/** \brief 804, MBIST Control Register */
#define MTU_MC8_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061804u)

/** \brief 806, Status Register */
#define MTU_MC8_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061806u)

/** \brief 808, Range Register, single address mode */
#define MTU_MC8_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061808u)

/** \brief 80C, Revision ID Register */
#define MTU_MC8_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006180Cu)

/** \brief 80E, ECC Safety Register */
#define MTU_MC8_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006180Eu)

/** \brief 810, Memory ECC Detection Register */
#define MTU_MC8_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061810u)

/** \brief 812, Error Tracking Register ${x} */
#define MTU_MC8_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061812u)

/** \brief 814, Error Tracking Register ${x} */
#define MTU_MC8_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061814u)

/** \brief 816, Error Tracking Register ${x} */
#define MTU_MC8_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061816u)

