Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 818, Error Tracking Register ${x} */
#define MTU_MC8_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061818u)

/** \brief 81A, Error Tracking Register ${x} */
#define MTU_MC8_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006181Au)


/** \brief 860, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061860u)

/** \brief 862, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061862u)

/** \brief 864, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061864u)

/** \brief 866, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061866u)

/** \brief 868, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061868u)

/** \brief 86A, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Au)

/** \brief 86C, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Cu)

/** \brief 86E, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Eu)

/** \brief 870, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061870u)

/** \brief 872, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061872u)

/** \brief 874, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061874u)

/** \brief 876, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061876u)

/** \brief 878, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061878u)

/** \brief 87A, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006187Au)

/** \brief 87C, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006187Cu)

/** \brief 87E, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006187Eu)

/** \brief 880, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061880u)

/** \brief 882, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061882u)

/** \brief 884, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061884u)

/** \brief 886, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061886u)

/** \brief 888, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061888u)

/** \brief 88A, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006188Au)

/** \brief 88C, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006188Cu)

/** \brief 88E, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006188Eu)

/** \brief 890, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061890u)

/** \brief 892, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061892u)

/** \brief 894, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061894u)

/** \brief 896, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061896u)

/** \brief 898, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061898u)

/** \brief 89A, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006189Au)

/** \brief 89C, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006189Cu)

/** \brief 89E, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006189Eu)

/** \brief 8A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A0u)

/** \brief 8A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A2u)

/** \brief 8A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A4u)

/** \brief 8A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A6u)

/** \brief 8A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A8u)

/** \brief 8AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618AAu)

/** \brief 8AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618ACu)

/** \brief 8AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618AEu)

/** \brief 8B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B0u)

/** \brief 8B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B2u)

/** \brief 8B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B4u)

