Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 8B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B6u)

/** \brief 8B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B8u)

/** \brief 8BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618BAu)

/** \brief 8BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618BCu)

/** \brief 8BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618BEu)

/** \brief 8C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C0u)

/** \brief 8C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C2u)

/** \brief 8C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C4u)

/** \brief 8C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C6u)

/** \brief 8C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C8u)

/** \brief 8CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618CAu)

/** \brief 8CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618CCu)

/** \brief 8CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618CEu)

/** \brief 8D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D0u)

/** \brief 8D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D2u)

/** \brief 8D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D4u)

/** \brief 8D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D6u)

/** \brief 8D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D8u)

/** \brief 8DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618DAu)

/** \brief 8DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618DCu)

/** \brief 8DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618DEu)

/** \brief 8E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618E0u)

/** \brief 8E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618E2u)

/** \brief 8E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC8_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618E4u)

/** \brief 8F2, Error Information Register ${x} */
#define MTU_MC8_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F2u)

/** \brief 8F4, Error Information Register ${x} */
#define MTU_MC8_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F4u)

/** \brief 8F6, Error Information Register ${x} */
#define MTU_MC8_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F6u)

/** \brief 8F8, Error Information Register ${x} */
#define MTU_MC8_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F8u)

/** \brief 8FA, Error Information Register ${x} */
#define MTU_MC8_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618FAu)

/** \brief 900, Configuration Register 0 */
#define MTU_MC9_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061900u)

/** \brief 902, Configuration Register 1 */
#define MTU_MC9_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061902u)

/** \brief 904, MBIST Control Register */
#define MTU_MC9_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061904u)

/** \brief 906, Status Register */
#define MTU_MC9_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061906u)

/** \brief 908, Range Register, single address mode */
#define MTU_MC9_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061908u)

/** \brief 90C, Revision ID Register */
#define MTU_MC9_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006190Cu)

/** \brief 90E, ECC Safety Register */
#define MTU_MC9_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006190Eu)

/** \brief 910, Memory ECC Detection Register */
#define MTU_MC9_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061910u)

/** \brief 912, Error Tracking Register ${x} */
#define MTU_MC9_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061912u)

/** \brief 914, Error Tracking Register ${x} */
#define MTU_MC9_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061914u)

/** \brief 916, Error Tracking Register ${x} */
#define MTU_MC9_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061916u)

/** \brief 918, Error Tracking Register ${x} */
#define MTU_MC9_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061918u)

/** \brief 91A, Error Tracking Register ${x} */
#define MTU_MC9_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006191Au)


/** \brief 960, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061960u)

/** \brief 962, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061962u)

/** \brief 964, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061964u)

/** \brief 966, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061966u)

/** \brief 968, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061968u)

/** \brief 96A, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006196Au)

