Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 96C, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006196Cu)

/** \brief 96E, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006196Eu)

/** \brief 970, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061970u)

/** \brief 972, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061972u)

/** \brief 974, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061974u)

/** \brief 976, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061976u)

/** \brief 978, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061978u)

/** \brief 97A, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006197Au)

/** \brief 97C, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006197Cu)

/** \brief 97E, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006197Eu)

/** \brief 980, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061980u)

/** \brief 982, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061982u)

/** \brief 984, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061984u)

/** \brief 986, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061986u)

/** \brief 988, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061988u)

/** \brief 98A, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006198Au)

/** \brief 98C, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006198Cu)

/** \brief 98E, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006198Eu)

/** \brief 990, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061990u)

/** \brief 992, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061992u)

/** \brief 994, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061994u)

/** \brief 996, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061996u)

/** \brief 998, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061998u)

/** \brief 99A, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006199Au)

/** \brief 99C, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006199Cu)

/** \brief 99E, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006199Eu)

/** \brief 9A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A0u)

/** \brief 9A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A2u)

/** \brief 9A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A4u)

/** \brief 9A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A6u)

/** \brief 9A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A8u)

/** \brief 9AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619AAu)

/** \brief 9AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619ACu)

/** \brief 9AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619AEu)

/** \brief 9B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B0u)

/** \brief 9B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B2u)

/** \brief 9B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B4u)

/** \brief 9B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B6u)

/** \brief 9B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B8u)

/** \brief 9BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619BAu)

/** \brief 9BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619BCu)

/** \brief 9BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619BEu)

/** \brief 9C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C0u)

/** \brief 9C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C2u)

