Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 9C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C4u)

/** \brief 9C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C6u)

/** \brief 9C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C8u)

/** \brief 9CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619CAu)

/** \brief 9CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619CCu)

/** \brief 9CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619CEu)

/** \brief 9D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D0u)

/** \brief 9D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D2u)

/** \brief 9D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D4u)

/** \brief 9D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D6u)

/** \brief 9D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D8u)

/** \brief 9DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619DAu)

/** \brief 9DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619DCu)

/** \brief 9DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619DEu)

/** \brief 9E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619E0u)

/** \brief 9E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619E2u)

/** \brief 9E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC9_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619E4u)

/** \brief 9F2, Error Information Register ${x} */
#define MTU_MC9_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F2u)

/** \brief 9F4, Error Information Register ${x} */
#define MTU_MC9_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F4u)

/** \brief 9F6, Error Information Register ${x} */
#define MTU_MC9_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F6u)

/** \brief 9F8, Error Information Register ${x} */
#define MTU_MC9_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619F8u)

/** \brief 9FA, Error Information Register ${x} */
#define MTU_MC9_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00619FAu)

/** \brief A00, Configuration Register 0 */
#define MTU_MC10_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061A00u)

/** \brief A02, Configuration Register 1 */
#define MTU_MC10_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061A02u)

/** \brief A04, MBIST Control Register */
#define MTU_MC10_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061A04u)

/** \brief A06, Status Register */
#define MTU_MC10_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061A06u)

/** \brief A08, Range Register, single address mode */
#define MTU_MC10_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061A08u)

/** \brief A0C, Revision ID Register */
#define MTU_MC10_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061A0Cu)

/** \brief A0E, ECC Safety Register */
#define MTU_MC10_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061A0Eu)

/** \brief A10, Memory ECC Detection Register */
#define MTU_MC10_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061A10u)

/** \brief A12, Error Tracking Register ${x} */
#define MTU_MC10_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A12u)

/** \brief A14, Error Tracking Register ${x} */
#define MTU_MC10_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A14u)

/** \brief A16, Error Tracking Register ${x} */
#define MTU_MC10_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A16u)

/** \brief A18, Error Tracking Register ${x} */
#define MTU_MC10_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A18u)

/** \brief A1A, Error Tracking Register ${x} */
#define MTU_MC10_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061A1Au)


/** \brief A60, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A60u)

/** \brief A62, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A62u)

/** \brief A64, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A64u)

/** \brief A66, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A66u)

/** \brief A68, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A68u)

/** \brief A6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Au)

/** \brief A6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Cu)

/** \brief A6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Eu)

/** \brief A70, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A70u)

