Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief A72, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A72u)

/** \brief A74, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A74u)

/** \brief A76, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A76u)

/** \brief A78, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A78u)

/** \brief A7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Au)

/** \brief A7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Cu)

/** \brief A7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Eu)

/** \brief A80, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A80u)

/** \brief A82, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A82u)

/** \brief A84, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A84u)

/** \brief A86, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A86u)

/** \brief A88, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A88u)

/** \brief A8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Au)

/** \brief A8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Cu)

/** \brief A8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Eu)

/** \brief A90, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A90u)

/** \brief A92, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A92u)

/** \brief A94, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A94u)

/** \brief A96, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A96u)

/** \brief A98, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A98u)

/** \brief A9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Au)

/** \brief A9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Cu)

/** \brief A9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Eu)

/** \brief AA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA0u)

/** \brief AA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA2u)

/** \brief AA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA4u)

/** \brief AA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA6u)

/** \brief AA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA8u)

/** \brief AAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AAAu)

/** \brief AAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AACu)

/** \brief AAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AAEu)

/** \brief AB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB0u)

/** \brief AB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB2u)

/** \brief AB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB4u)

/** \brief AB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB6u)

/** \brief AB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB8u)

/** \brief ABA, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABAu)

/** \brief ABC, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABCu)

/** \brief ABE, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABEu)

/** \brief AC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC0u)

/** \brief AC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC2u)

/** \brief AC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC4u)

/** \brief AC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC6u)

/** \brief AC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC8u)

