Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief ACA, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ACAu)

/** \brief ACC, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ACCu)

/** \brief ACE, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ACEu)

/** \brief AD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD0u)

/** \brief AD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD2u)

/** \brief AD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD4u)

/** \brief AD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD6u)

/** \brief AD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD8u)

/** \brief ADA, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ADAu)

/** \brief ADC, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ADCu)

/** \brief ADE, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ADEu)

/** \brief AE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AE0u)

/** \brief AE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AE2u)

/** \brief AE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC10_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AE4u)

/** \brief AF2, Error Information Register ${x} */
#define MTU_MC10_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF2u)

/** \brief AF4, Error Information Register ${x} */
#define MTU_MC10_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF4u)

/** \brief AF6, Error Information Register ${x} */
#define MTU_MC10_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF6u)

/** \brief AF8, Error Information Register ${x} */
#define MTU_MC10_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF8u)

/** \brief AFA, Error Information Register ${x} */
#define MTU_MC10_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AFAu)

/** \brief B00, Configuration Register 0 */
#define MTU_MC11_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061B00u)

/** \brief B02, Configuration Register 1 */
#define MTU_MC11_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061B02u)

/** \brief B04, MBIST Control Register */
#define MTU_MC11_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061B04u)

/** \brief B06, Status Register */
#define MTU_MC11_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061B06u)

/** \brief B08, Range Register, single address mode */
#define MTU_MC11_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061B08u)

/** \brief B0C, Revision ID Register */
#define MTU_MC11_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061B0Cu)

/** \brief B0E, ECC Safety Register */
#define MTU_MC11_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061B0Eu)

/** \brief B10, Memory ECC Detection Register */
#define MTU_MC11_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061B10u)

/** \brief B12, Error Tracking Register ${x} */
#define MTU_MC11_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B12u)

/** \brief B14, Error Tracking Register ${x} */
#define MTU_MC11_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B14u)

/** \brief B16, Error Tracking Register ${x} */
#define MTU_MC11_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B16u)

/** \brief B18, Error Tracking Register ${x} */
#define MTU_MC11_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B18u)

/** \brief B1A, Error Tracking Register ${x} */
#define MTU_MC11_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B1Au)

/** \brief B60, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B60u)

/** \brief B62, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B62u)

/** \brief B64, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B64u)

/** \brief B66, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B66u)

/** \brief B68, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B68u)

/** \brief B6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B6Au)

/** \brief B6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B6Cu)

/** \brief B6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B6Eu)

/** \brief B70, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B70u)

/** \brief B72, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B72u)

/** \brief B74, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B74u)

/** \brief B76, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B76u)

