Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief BD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD6u)

/** \brief BD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD8u)

/** \brief BDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDAu)

/** \brief BDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDCu)

/** \brief BDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDEu)

/** \brief BE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE0u)

/** \brief BE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE2u)

/** \brief BE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC11_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE4u)

/** \brief BF2, Error Information Register ${x} */
#define MTU_MC11_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF2u)

/** \brief BF4, Error Information Register ${x} */
#define MTU_MC11_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF4u)

/** \brief BF6, Error Information Register ${x} */
#define MTU_MC11_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF6u)

/** \brief BF8, Error Information Register ${x} */
#define MTU_MC11_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF8u)

/** \brief BFA, Error Information Register ${x} */
#define MTU_MC11_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BFAu)

/** \brief C00, Configuration Register 0 */
#define MTU_MC12_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061C00u)

/** \brief C02, Configuration Register 1 */
#define MTU_MC12_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061C02u)

/** \brief C04, MBIST Control Register */
#define MTU_MC12_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061C04u)

/** \brief C06, Status Register */
#define MTU_MC12_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061C06u)

/** \brief C08, Range Register, single address mode */
#define MTU_MC12_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061C08u)

/** \brief C0C, Revision ID Register */
#define MTU_MC12_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061C0Cu)

/** \brief C0E, ECC Safety Register */
#define MTU_MC12_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061C0Eu)

/** \brief C10, Memory ECC Detection Register */
#define MTU_MC12_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061C10u)

/** \brief C12, Error Tracking Register ${x} */
#define MTU_MC12_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C12u)

/** \brief C14, Error Tracking Register ${x} */
#define MTU_MC12_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C14u)

/** \brief C16, Error Tracking Register ${x} */
#define MTU_MC12_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C16u)

/** \brief C18, Error Tracking Register ${x} */
#define MTU_MC12_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C18u)

/** \brief C1A, Error Tracking Register ${x} */
#define MTU_MC12_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C1Au)

/** \brief C60, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C60u)

/** \brief C62, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C62u)

/** \brief C64, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C64u)

/** \brief C66, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C66u)

/** \brief C68, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C68u)

/** \brief C6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C6Au)

/** \brief C6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C6Cu)

/** \brief C6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C6Eu)

/** \brief C70, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C70u)

/** \brief C72, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C72u)

/** \brief C74, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C74u)

/** \brief C76, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C76u)

/** \brief C78, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C78u)

/** \brief C7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C7Au)

/** \brief C7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C7Cu)

/** \brief C7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C7Eu)

/** \brief C80, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C80u)

/** \brief C82, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C82u)

/** \brief C84, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C84u)

