Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief C86, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C86u)

/** \brief C88, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C88u)

/** \brief C8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C8Au)

/** \brief C8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C8Cu)

/** \brief C8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C8Eu)

/** \brief C90, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C90u)

/** \brief C92, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C92u)

/** \brief C94, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C94u)

/** \brief C96, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C96u)

/** \brief C98, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C98u)

/** \brief C9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C9Au)

/** \brief C9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C9Cu)

/** \brief C9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C9Eu)

/** \brief CA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA0u)

/** \brief CA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA2u)

/** \brief CA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA4u)

/** \brief CA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA6u)

/** \brief CA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA8u)

/** \brief CAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CAAu)

/** \brief CAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CACu)

/** \brief CAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CAEu)

/** \brief CB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB0u)

/** \brief CB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB2u)

/** \brief CB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB4u)

/** \brief CB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB6u)

/** \brief CB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB8u)

/** \brief CBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CBAu)

/** \brief CBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CBCu)

/** \brief CBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CBEu)

/** \brief CC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC0u)

/** \brief CC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC2u)

/** \brief CC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC4u)

/** \brief CC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC6u)

/** \brief CC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC8u)

/** \brief CCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CCAu)

/** \brief CCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CCCu)

/** \brief CCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CCEu)

/** \brief CD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD0u)

/** \brief CD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD2u)

/** \brief CD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD4u)

/** \brief CD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD6u)

/** \brief CD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC12_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CD8u)

