Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief D8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Au)

/** \brief D8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Cu)

/** \brief D8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Eu)

/** \brief D90, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D90u)

/** \brief D92, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D92u)

/** \brief D94, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D94u)

/** \brief D96, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D96u)

/** \brief D98, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D98u)

/** \brief D9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D9Au)

/** \brief D9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D9Cu)

/** \brief D9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D9Eu)

/** \brief DA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA0u)

/** \brief DA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA2u)

/** \brief DA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA4u)

/** \brief DA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA6u)

/** \brief DA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DA8u)

/** \brief DAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DAAu)

/** \brief DAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DACu)

/** \brief DAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DAEu)

/** \brief DB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB0u)

/** \brief DB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB2u)

/** \brief DB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB4u)

/** \brief DB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB6u)

/** \brief DB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DB8u)

/** \brief DBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DBAu)

/** \brief DBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DBCu)

/** \brief DBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DBEu)

/** \brief DC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC0u)

/** \brief DC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC2u)

/** \brief DC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC4u)

/** \brief DC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC6u)

/** \brief DC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DC8u)

/** \brief DCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DCAu)

/** \brief DCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DCCu)

/** \brief DCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DCEu)

/** \brief DD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD0u)

/** \brief DD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD2u)

/** \brief DD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD4u)

/** \brief DD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD6u)

/** \brief DD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DD8u)

/** \brief DDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DDAu)

/** \brief DDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DDCu)

/** \brief DDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DDEu)

/** \brief DE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DE0u)

