Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief DE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DE2u)

/** \brief DE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC13_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061DE4u)

/** \brief DF2, Error Information Register ${x} */
#define MTU_MC13_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF2u)

/** \brief DF4, Error Information Register ${x} */
#define MTU_MC13_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF4u)

/** \brief DF6, Error Information Register ${x} */
#define MTU_MC13_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF6u)

/** \brief DF8, Error Information Register ${x} */
#define MTU_MC13_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DF8u)

/** \brief DFA, Error Information Register ${x} */
#define MTU_MC13_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061DFAu)

/** \brief E00, Configuration Register 0 */
#define MTU_MC14_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061E00u)

/** \brief E02, Configuration Register 1 */
#define MTU_MC14_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061E02u)

/** \brief E04, MBIST Control Register */
#define MTU_MC14_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061E04u)

/** \brief E06, Status Register */
#define MTU_MC14_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061E06u)

/** \brief E08, Range Register, single address mode */
#define MTU_MC14_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061E08u)

/** \brief E0C, Revision ID Register */
#define MTU_MC14_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061E0Cu)

/** \brief E0E, ECC Safety Register */
#define MTU_MC14_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061E0Eu)

/** \brief E10, Memory ECC Detection Register */
#define MTU_MC14_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061E10u)

/** \brief E12, Error Tracking Register ${x} */
#define MTU_MC14_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E12u)

/** \brief E14, Error Tracking Register ${x} */
#define MTU_MC14_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E14u)

/** \brief E16, Error Tracking Register ${x} */
#define MTU_MC14_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E16u)

/** \brief E18, Error Tracking Register ${x} */
#define MTU_MC14_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E18u)

/** \brief E1A, Error Tracking Register ${x} */
#define MTU_MC14_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061E1Au)

/** \brief E60, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E60u)

/** \brief E62, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E62u)

/** \brief E64, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E64u)

/** \brief E66, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E66u)

/** \brief E68, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E68u)

/** \brief E6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E6Au)

/** \brief E6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E6Cu)

/** \brief E6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E6Eu)

/** \brief E70, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E70u)

/** \brief E72, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E72u)

/** \brief E74, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E74u)

/** \brief E76, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E76u)

/** \brief E78, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E78u)

/** \brief E7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E7Au)

/** \brief E7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E7Cu)

/** \brief E7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E7Eu)

/** \brief E80, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E80u)

/** \brief E82, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E82u)

/** \brief E84, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E84u)

/** \brief E86, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E86u)

/** \brief E88, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E88u)

/** \brief E8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E8Au)

/** \brief E8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E8Cu)

/** \brief E8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E8Eu)

/** \brief E90, Read Data and Bit Flip Register ${y} */
#define MTU_MC14_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E90u)

