Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief F94, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F94u)

/** \brief F96, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F96u)

/** \brief F98, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F98u)

/** \brief F9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F9Au)

/** \brief F9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F9Cu)

/** \brief F9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F9Eu)

/** \brief FA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA0u)

/** \brief FA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA2u)

/** \brief FA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA4u)

/** \brief FA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA6u)

/** \brief FA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA8u)

/** \brief FAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FAAu)

/** \brief FAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FACu)

/** \brief FAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FAEu)

/** \brief FB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB0u)

/** \brief FB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB2u)

/** \brief FB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB4u)

/** \brief FB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB6u)

/** \brief FB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB8u)

/** \brief FBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FBAu)

/** \brief FBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FBCu)

/** \brief FBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FBEu)

/** \brief FC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC0u)

/** \brief FC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC2u)

/** \brief FC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC4u)

/** \brief FC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC6u)

/** \brief FC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC8u)

/** \brief FCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FCAu)

/** \brief FCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FCCu)

/** \brief FCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FCEu)

/** \brief FD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD0u)

/** \brief FD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD2u)

/** \brief FD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD4u)

/** \brief FD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD6u)

/** \brief FD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD8u)

/** \brief FDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FDAu)

/** \brief FDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FDCu)

/** \brief FDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FDEu)

/** \brief FE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FE0u)

/** \brief FE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FE2u)

/** \brief FE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC15_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FE4u)

/** \brief FF2, Error Information Register ${x} */
#define MTU_MC15_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF2u)

/** \brief FF4, Error Information Register ${x} */
#define MTU_MC15_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF4u)

