Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief FF6, Error Information Register ${x} */
#define MTU_MC15_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF6u)

/** \brief FF8, Error Information Register ${x} */
#define MTU_MC15_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF8u)

/** \brief FFA, Error Information Register ${x} */
#define MTU_MC15_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FFAu)

/** \brief 1000, Configuration Register 0 */
#define MTU_MC16_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062000u)

/** \brief 1002, Configuration Register 1 */
#define MTU_MC16_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062002u)

/** \brief 1004, MBIST Control Register */
#define MTU_MC16_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062004u)

/** \brief 1006, Status Register */
#define MTU_MC16_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062006u)

/** \brief 1008, Range Register, single address mode */
#define MTU_MC16_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062008u)

/** \brief 100C, Revision ID Register */
#define MTU_MC16_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006200Cu)

/** \brief 100E, ECC Safety Register */
#define MTU_MC16_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006200Eu)

/** \brief 1010, Memory ECC Detection Register */
#define MTU_MC16_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062010u)

/** \brief 1012, Error Tracking Register ${x} */
#define MTU_MC16_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062012u)

/** \brief 1014, Error Tracking Register ${x} */
#define MTU_MC16_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062014u)

/** \brief 1016, Error Tracking Register ${x} */
#define MTU_MC16_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062016u)

/** \brief 1018, Error Tracking Register ${x} */
#define MTU_MC16_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062018u)

/** \brief 101A, Error Tracking Register ${x} */
#define MTU_MC16_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006201Au)

/** \brief 1060, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062060u)

/** \brief 1062, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062062u)

/** \brief 1064, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062064u)

/** \brief 1066, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062066u)

/** \brief 1068, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062068u)

/** \brief 106A, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006206Au)

/** \brief 106C, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006206Cu)

/** \brief 106E, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006206Eu)

/** \brief 1070, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062070u)

/** \brief 1072, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062072u)

/** \brief 1074, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062074u)

/** \brief 1076, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062076u)

/** \brief 1078, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062078u)

/** \brief 107A, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006207Au)

/** \brief 107C, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006207Cu)

/** \brief 107E, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006207Eu)

/** \brief 1080, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062080u)

/** \brief 1082, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062082u)

/** \brief 1084, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062084u)

/** \brief 1086, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062086u)

/** \brief 1088, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062088u)

/** \brief 108A, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006208Au)

/** \brief 108C, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006208Cu)

/** \brief 108E, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006208Eu)

/** \brief 1090, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062090u)

/** \brief 1092, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062092u)

/** \brief 1094, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062094u)

/** \brief 1096, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062096u)

/** \brief 1098, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062098u)

/** \brief 109A, Read Data and Bit Flip Register ${y} */
#define MTU_MC16_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006209Au)

