Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1106, Status Register */
#define MTU_MC17_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062106u)

/** \brief 1108, Range Register, single address mode */
#define MTU_MC17_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062108u)

/** \brief 110C, Revision ID Register */
#define MTU_MC17_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006210Cu)

/** \brief 110E, ECC Safety Register */
#define MTU_MC17_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006210Eu)

/** \brief 1110, Memory ECC Detection Register */
#define MTU_MC17_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062110u)

/** \brief 1112, Error Tracking Register ${x} */
#define MTU_MC17_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062112u)

/** \brief 1114, Error Tracking Register ${x} */
#define MTU_MC17_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062114u)

/** \brief 1116, Error Tracking Register ${x} */
#define MTU_MC17_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062116u)

/** \brief 1118, Error Tracking Register ${x} */
#define MTU_MC17_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062118u)

/** \brief 111A, Error Tracking Register ${x} */
#define MTU_MC17_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006211Au)

/** \brief 1160, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062160u)

/** \brief 1162, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062162u)

/** \brief 1164, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062164u)

/** \brief 1166, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062166u)

/** \brief 1168, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062168u)

/** \brief 116A, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006216Au)

/** \brief 116C, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006216Cu)

/** \brief 116E, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006216Eu)

/** \brief 1170, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062170u)

/** \brief 1172, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062172u)

/** \brief 1174, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062174u)

/** \brief 1176, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062176u)

/** \brief 1178, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062178u)

/** \brief 117A, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006217Au)

/** \brief 117C, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006217Cu)

/** \brief 117E, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006217Eu)

/** \brief 1180, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062180u)

/** \brief 1182, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062182u)

/** \brief 1184, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062184u)

/** \brief 1186, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062186u)

/** \brief 1188, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062188u)

/** \brief 118A, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006218Au)

/** \brief 118C, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006218Cu)

/** \brief 118E, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006218Eu)

/** \brief 1190, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062190u)

/** \brief 1192, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062192u)

/** \brief 1194, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062194u)

/** \brief 1196, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062196u)

/** \brief 1198, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062198u)

/** \brief 119A, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006219Au)

/** \brief 119C, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006219Cu)

/** \brief 119E, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006219Eu)

/** \brief 11A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A0u)

/** \brief 11A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A2u)

/** \brief 11A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A4u)

/** \brief 11A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A6u)

/** \brief 11A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A8u)

