Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 11AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621AAu)

/** \brief 11AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621ACu)

/** \brief 11AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621AEu)

/** \brief 11B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B0u)

/** \brief 11B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B2u)

/** \brief 11B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B4u)

/** \brief 11B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B6u)

/** \brief 11B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B8u)

/** \brief 11BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621BAu)

/** \brief 11BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621BCu)

/** \brief 11BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621BEu)

/** \brief 11C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C0u)

/** \brief 11C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C2u)

/** \brief 11C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C4u)

/** \brief 11C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C6u)

/** \brief 11C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C8u)

/** \brief 11CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621CAu)

/** \brief 11CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621CCu)

/** \brief 11CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621CEu)

/** \brief 11D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D0u)

/** \brief 11D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D2u)

/** \brief 11D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D4u)

/** \brief 11D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D6u)

/** \brief 11D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D8u)

/** \brief 11DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621DAu)

/** \brief 11DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621DCu)

/** \brief 11DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621DEu)

/** \brief 11E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621E0u)

/** \brief 11E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621E2u)

/** \brief 11E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC17_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621E4u)

/** \brief 11F2, Error Information Register ${x} */
#define MTU_MC17_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F2u)

/** \brief 11F4, Error Information Register ${x} */
#define MTU_MC17_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F4u)

/** \brief 11F6, Error Information Register ${x} */
#define MTU_MC17_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F6u)

/** \brief 11F8, Error Information Register ${x} */
#define MTU_MC17_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F8u)

/** \brief 11FA, Error Information Register ${x} */
#define MTU_MC17_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621FAu)

/** \brief 1200, Configuration Register 0 */
#define MTU_MC18_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062200u)

/** \brief 1202, Configuration Register 1 */
#define MTU_MC18_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062202u)

/** \brief 1204, MBIST Control Register */
#define MTU_MC18_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062204u)

/** \brief 1206, Status Register */
#define MTU_MC18_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062206u)

/** \brief 1208, Range Register, single address mode */
#define MTU_MC18_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062208u)

/** \brief 120C, Revision ID Register */
#define MTU_MC18_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006220Cu)

/** \brief 120E, ECC Safety Register */
#define MTU_MC18_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006220Eu)

/** \brief 1210, Memory ECC Detection Register */
#define MTU_MC18_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062210u)

/** \brief 1212, Error Tracking Register ${x} */
#define MTU_MC18_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062212u)

/** \brief 1214, Error Tracking Register ${x} */
#define MTU_MC18_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062214u)

/** \brief 1216, Error Tracking Register ${x} */
#define MTU_MC18_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062216u)

/** \brief 1218, Error Tracking Register ${x} */
#define MTU_MC18_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062218u)

