Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 121A, Error Tracking Register ${x} */
#define MTU_MC18_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006221Au)

/** \brief 1260, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062260u)

/** \brief 1262, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062262u)

/** \brief 1264, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062264u)

/** \brief 1266, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062266u)

/** \brief 1268, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062268u)

/** \brief 126A, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006226Au)

/** \brief 126C, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006226Cu)

/** \brief 126E, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006226Eu)

/** \brief 1270, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062270u)

/** \brief 1272, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062272u)

/** \brief 1274, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062274u)

/** \brief 1276, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062276u)

/** \brief 1278, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062278u)

/** \brief 127A, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006227Au)

/** \brief 127C, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006227Cu)

/** \brief 127E, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006227Eu)

/** \brief 1280, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062280u)

/** \brief 1282, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062282u)

/** \brief 1284, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062284u)

/** \brief 1286, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062286u)

/** \brief 1288, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062288u)

/** \brief 128A, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006228Au)

/** \brief 128C, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006228Cu)

/** \brief 128E, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006228Eu)

/** \brief 1290, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062290u)

/** \brief 1292, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062292u)

/** \brief 1294, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062294u)

/** \brief 1296, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062296u)

/** \brief 1298, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062298u)

/** \brief 129A, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006229Au)

/** \brief 129C, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006229Cu)

/** \brief 129E, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006229Eu)

/** \brief 12A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A0u)

/** \brief 12A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A2u)

/** \brief 12A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A4u)

/** \brief 12A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A6u)

/** \brief 12A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A8u)

/** \brief 12AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622AAu)

/** \brief 12AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622ACu)

/** \brief 12AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622AEu)

/** \brief 12B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B0u)

/** \brief 12B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B2u)

