Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 12B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B4u)

/** \brief 12B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B6u)

/** \brief 12B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B8u)

/** \brief 12BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622BAu)

/** \brief 12BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622BCu)

/** \brief 12BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622BEu)

/** \brief 12C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C0u)

/** \brief 12C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C2u)

/** \brief 12C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C4u)

/** \brief 12C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C6u)

/** \brief 12C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C8u)

/** \brief 12CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622CAu)

/** \brief 12CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622CCu)

/** \brief 12CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622CEu)

/** \brief 12D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D0u)

/** \brief 12D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D2u)

/** \brief 12D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D4u)

/** \brief 12D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D6u)

/** \brief 12D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D8u)

/** \brief 12DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622DAu)

/** \brief 12DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622DCu)

/** \brief 12DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622DEu)

/** \brief 12E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622E0u)

/** \brief 12E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622E2u)

/** \brief 12E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC18_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622E4u)

/** \brief 12F2, Error Information Register ${x} */
#define MTU_MC18_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F2u)

/** \brief 12F4, Error Information Register ${x} */
#define MTU_MC18_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F4u)

/** \brief 12F6, Error Information Register ${x} */
#define MTU_MC18_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F6u)

/** \brief 12F8, Error Information Register ${x} */
#define MTU_MC18_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F8u)

/** \brief 12FA, Error Information Register ${x} */
#define MTU_MC18_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622FAu)

/** \brief 1300, Configuration Register 0 */
#define MTU_MC19_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062300u)

/** \brief 1302, Configuration Register 1 */
#define MTU_MC19_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062302u)

/** \brief 1304, MBIST Control Register */
#define MTU_MC19_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062304u)

/** \brief 1306, Status Register */
#define MTU_MC19_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062306u)

/** \brief 1308, Range Register, single address mode */
#define MTU_MC19_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062308u)

/** \brief 130C, Revision ID Register */
#define MTU_MC19_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006230Cu)

/** \brief 130E, ECC Safety Register */
#define MTU_MC19_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006230Eu)

/** \brief 1310, Memory ECC Detection Register */
#define MTU_MC19_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062310u)

/** \brief 1312, Error Tracking Register ${x} */
#define MTU_MC19_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062312u)

/** \brief 1314, Error Tracking Register ${x} */
#define MTU_MC19_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062314u)

/** \brief 1316, Error Tracking Register ${x} */
#define MTU_MC19_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062316u)

/** \brief 1318, Error Tracking Register ${x} */
#define MTU_MC19_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062318u)

/** \brief 131A, Error Tracking Register ${x} */
#define MTU_MC19_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006231Au)

