Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1360, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062360u)

/** \brief 1362, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062362u)

/** \brief 1364, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062364u)

/** \brief 1366, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062366u)

/** \brief 1368, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062368u)

/** \brief 136A, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006236Au)

/** \brief 136C, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006236Cu)

/** \brief 136E, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006236Eu)

/** \brief 1370, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062370u)

/** \brief 1372, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062372u)

/** \brief 1374, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062374u)

/** \brief 1376, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062376u)

/** \brief 1378, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062378u)

/** \brief 137A, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006237Au)

/** \brief 137C, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006237Cu)

/** \brief 137E, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006237Eu)

/** \brief 1380, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062380u)

/** \brief 1382, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062382u)

/** \brief 1384, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062384u)

/** \brief 1386, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062386u)

/** \brief 1388, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062388u)

/** \brief 138A, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006238Au)

/** \brief 138C, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006238Cu)

/** \brief 138E, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006238Eu)

/** \brief 1390, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062390u)

/** \brief 1392, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062392u)

/** \brief 1394, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062394u)

/** \brief 1396, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062396u)

/** \brief 1398, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062398u)

/** \brief 139A, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006239Au)

/** \brief 139C, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006239Cu)

/** \brief 139E, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006239Eu)

/** \brief 13A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A0u)

/** \brief 13A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A2u)

/** \brief 13A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A4u)

/** \brief 13A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A6u)

/** \brief 13A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A8u)

/** \brief 13AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623AAu)

/** \brief 13AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623ACu)

/** \brief 13AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623AEu)

/** \brief 13B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B0u)

/** \brief 13B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B2u)

/** \brief 13B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B4u)

/** \brief 13B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B6u)

/** \brief 13B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B8u)

/** \brief 13BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623BAu)

