Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 13BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623BCu)

/** \brief 13BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623BEu)

/** \brief 13C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C0u)

/** \brief 13C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C2u)

/** \brief 13C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C4u)

/** \brief 13C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C6u)

/** \brief 13C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C8u)

/** \brief 13CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623CAu)

/** \brief 13CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623CCu)

/** \brief 13CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623CEu)

/** \brief 13D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D0u)

/** \brief 13D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D2u)

/** \brief 13D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D4u)

/** \brief 13D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D6u)

/** \brief 13D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D8u)

/** \brief 13DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623DAu)

/** \brief 13DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623DCu)

/** \brief 13DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623DEu)

/** \brief 13E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623E0u)

/** \brief 13E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623E2u)

/** \brief 13E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC19_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623E4u)

/** \brief 13F2, Error Information Register ${x} */
#define MTU_MC19_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F2u)

/** \brief 13F4, Error Information Register ${x} */
#define MTU_MC19_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F4u)

/** \brief 13F6, Error Information Register ${x} */
#define MTU_MC19_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F6u)

/** \brief 13F8, Error Information Register ${x} */
#define MTU_MC19_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F8u)

/** \brief 13FA, Error Information Register ${x} */
#define MTU_MC19_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623FAu)

/** \brief 1400, Configuration Register 0 */
#define MTU_MC20_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062400u)

/** \brief 1402, Configuration Register 1 */
#define MTU_MC20_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062402u)

/** \brief 1404, MBIST Control Register */
#define MTU_MC20_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062404u)

/** \brief 1406, Status Register */
#define MTU_MC20_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062406u)

/** \brief 1408, Range Register, single address mode */
#define MTU_MC20_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062408u)

/** \brief 140C, Revision ID Register */
#define MTU_MC20_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006240Cu)

/** \brief 140E, ECC Safety Register */
#define MTU_MC20_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006240Eu)

/** \brief 1410, Memory ECC Detection Register */
#define MTU_MC20_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062410u)

/** \brief 1412, Error Tracking Register ${x} */
#define MTU_MC20_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062412u)

/** \brief 1414, Error Tracking Register ${x} */
#define MTU_MC20_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062414u)

/** \brief 1416, Error Tracking Register ${x} */
#define MTU_MC20_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062416u)

/** \brief 1418, Error Tracking Register ${x} */
#define MTU_MC20_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062418u)

/** \brief 141A, Error Tracking Register ${x} */
#define MTU_MC20_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006241Au)

/** \brief 1460, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062460u)

/** \brief 1462, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062462u)

/** \brief 1464, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062464u)

/** \brief 1466, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062466u)

/** \brief 1468, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062468u)

/** \brief 146A, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006246Au)

/** \brief 146C, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006246Cu)

/** \brief 146E, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006246Eu)

/** \brief 1470, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062470u)

