Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1472, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062472u)

/** \brief 1474, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062474u)

/** \brief 1476, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062476u)

/** \brief 1478, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062478u)

/** \brief 147A, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006247Au)

/** \brief 147C, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006247Cu)

/** \brief 147E, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006247Eu)

/** \brief 1480, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062480u)

/** \brief 1482, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062482u)

/** \brief 1484, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062484u)

/** \brief 1486, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062486u)

/** \brief 1488, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062488u)

/** \brief 148A, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006248Au)

/** \brief 148C, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006248Cu)

/** \brief 148E, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006248Eu)

/** \brief 1490, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062490u)

/** \brief 1492, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062492u)

/** \brief 1494, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062494u)

/** \brief 1496, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062496u)

/** \brief 1498, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062498u)

/** \brief 149A, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006249Au)

/** \brief 149C, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006249Cu)

/** \brief 149E, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006249Eu)

/** \brief 14A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A0u)

/** \brief 14A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A2u)

/** \brief 14A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A4u)

/** \brief 14A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A6u)

/** \brief 14A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A8u)

/** \brief 14AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624AAu)

/** \brief 14AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624ACu)

/** \brief 14AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624AEu)

/** \brief 14B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B0u)

/** \brief 14B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B2u)

/** \brief 14B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B4u)

/** \brief 14B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B6u)

/** \brief 14B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B8u)

/** \brief 14BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624BAu)

/** \brief 14BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624BCu)

/** \brief 14BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624BEu)

/** \brief 14C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C0u)

/** \brief 14C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C2u)

/** \brief 14C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C4u)

/** \brief 14C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C6u)

/** \brief 14C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C8u)

