Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 14CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624CAu)

/** \brief 14CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624CCu)

/** \brief 14CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624CEu)

/** \brief 14D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D0u)

/** \brief 14D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D2u)

/** \brief 14D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D4u)

/** \brief 14D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D6u)

/** \brief 14D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D8u)

/** \brief 14DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624DAu)

/** \brief 14DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624DCu)

/** \brief 14DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624DEu)

/** \brief 14E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624E0u)

/** \brief 14E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624E2u)

/** \brief 14E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC20_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624E4u)

/** \brief 14F2, Error Information Register ${x} */
#define MTU_MC20_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F2u)

/** \brief 14F4, Error Information Register ${x} */
#define MTU_MC20_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F4u)

/** \brief 14F6, Error Information Register ${x} */
#define MTU_MC20_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F6u)

/** \brief 14F8, Error Information Register ${x} */
#define MTU_MC20_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F8u)

/** \brief 14FA, Error Information Register ${x} */
#define MTU_MC20_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624FAu)

/** \brief 1500, Configuration Register 0 */
#define MTU_MC21_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062500u)

/** \brief 1502, Configuration Register 1 */
#define MTU_MC21_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062502u)

/** \brief 1504, MBIST Control Register */
#define MTU_MC21_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062504u)

/** \brief 1506, Status Register */
#define MTU_MC21_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062506u)

/** \brief 1508, Range Register, single address mode */
#define MTU_MC21_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062508u)

/** \brief 150C, Revision ID Register */
#define MTU_MC21_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006250Cu)

/** \brief 150E, ECC Safety Register */
#define MTU_MC21_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006250Eu)

/** \brief 1510, Memory ECC Detection Register */
#define MTU_MC21_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062510u)

/** \brief 1512, Error Tracking Register ${x} */
#define MTU_MC21_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062512u)

/** \brief 1514, Error Tracking Register ${x} */
#define MTU_MC21_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062514u)

/** \brief 1516, Error Tracking Register ${x} */
#define MTU_MC21_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062516u)

/** \brief 1518, Error Tracking Register ${x} */
#define MTU_MC21_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062518u)

/** \brief 151A, Error Tracking Register ${x} */
#define MTU_MC21_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006251Au)

/** \brief 1560, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062560u)

/** \brief 1562, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062562u)

/** \brief 1564, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062564u)

/** \brief 1566, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062566u)

/** \brief 1568, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062568u)

/** \brief 156A, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006256Au)

/** \brief 156C, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006256Cu)

/** \brief 156E, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006256Eu)

/** \brief 1570, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062570u)

/** \brief 1572, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062572u)

/** \brief 1574, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062574u)

/** \brief 1576, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062576u)

