Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1578, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062578u)

/** \brief 157A, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006257Au)

/** \brief 157C, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006257Cu)

/** \brief 157E, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006257Eu)

/** \brief 1580, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062580u)

/** \brief 1582, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062582u)

/** \brief 1584, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062584u)

/** \brief 1586, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062586u)

/** \brief 1588, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062588u)

/** \brief 158A, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006258Au)

/** \brief 158C, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006258Cu)

/** \brief 158E, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006258Eu)

/** \brief 1590, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062590u)

/** \brief 1592, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062592u)

/** \brief 1594, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062594u)

/** \brief 1596, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062596u)

/** \brief 1598, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062598u)

/** \brief 159A, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006259Au)

/** \brief 159C, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006259Cu)

/** \brief 159E, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006259Eu)

/** \brief 15A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A0u)

/** \brief 15A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A2u)

/** \brief 15A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A4u)

/** \brief 15A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A6u)

/** \brief 15A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A8u)

/** \brief 15AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625AAu)

/** \brief 15AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625ACu)

/** \brief 15AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625AEu)

/** \brief 15B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B0u)

/** \brief 15B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B2u)

/** \brief 15B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B4u)

/** \brief 15B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B6u)

/** \brief 15B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B8u)

/** \brief 15BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625BAu)

/** \brief 15BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625BCu)

/** \brief 15BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625BEu)

/** \brief 15C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C0u)

/** \brief 15C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C2u)

/** \brief 15C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C4u)

/** \brief 15C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C6u)

/** \brief 15C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C8u)

/** \brief 15CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625CAu)

/** \brief 15CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625CCu)

/** \brief 15CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625CEu)

/** \brief 15D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D0u)

/** \brief 15D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D2u)

/** \brief 15D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D4u)

