Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 15D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D6u)

/** \brief 15D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D8u)

/** \brief 15DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625DAu)

/** \brief 15DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625DCu)

/** \brief 15DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625DEu)

/** \brief 15E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625E0u)

/** \brief 15E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625E2u)

/** \brief 15E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC21_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625E4u)

/** \brief 15F2, Error Information Register ${x} */
#define MTU_MC21_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F2u)

/** \brief 15F4, Error Information Register ${x} */
#define MTU_MC21_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F4u)

/** \brief 15F6, Error Information Register ${x} */
#define MTU_MC21_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F6u)

/** \brief 15F8, Error Information Register ${x} */
#define MTU_MC21_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F8u)

/** \brief 15FA, Error Information Register ${x} */
#define MTU_MC21_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625FAu)

/** \brief 1600, Configuration Register 0 */
#define MTU_MC22_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062600u)

/** \brief 1602, Configuration Register 1 */
#define MTU_MC22_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062602u)

/** \brief 1604, MBIST Control Register */
#define MTU_MC22_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062604u)

/** \brief 1606, Status Register */
#define MTU_MC22_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062606u)

/** \brief 1608, Range Register, single address mode */
#define MTU_MC22_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062608u)

/** \brief 160C, Revision ID Register */
#define MTU_MC22_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006260Cu)

/** \brief 160E, ECC Safety Register */
#define MTU_MC22_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006260Eu)

/** \brief 1610, Memory ECC Detection Register */
#define MTU_MC22_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062610u)

/** \brief 1612, Error Tracking Register ${x} */
#define MTU_MC22_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062612u)

/** \brief 1614, Error Tracking Register ${x} */
#define MTU_MC22_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062614u)

/** \brief 1616, Error Tracking Register ${x} */
#define MTU_MC22_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062616u)

/** \brief 1618, Error Tracking Register ${x} */
#define MTU_MC22_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062618u)

/** \brief 161A, Error Tracking Register ${x} */
#define MTU_MC22_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006261Au)

/** \brief 1660, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062660u)

/** \brief 1662, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062662u)

/** \brief 1664, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062664u)

/** \brief 1666, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062666u)

/** \brief 1668, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062668u)

/** \brief 166A, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006266Au)

/** \brief 166C, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006266Cu)

/** \brief 166E, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006266Eu)

/** \brief 1670, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062670u)

/** \brief 1672, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062672u)

/** \brief 1674, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062674u)

/** \brief 1676, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062676u)

/** \brief 1678, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062678u)

/** \brief 167A, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006267Au)

/** \brief 167C, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006267Cu)

/** \brief 167E, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006267Eu)

/** \brief 1680, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062680u)

/** \brief 1682, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062682u)

/** \brief 1684, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062684u)

