Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1686, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062686u)

/** \brief 1688, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062688u)

/** \brief 168A, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006268Au)

/** \brief 168C, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006268Cu)

/** \brief 168E, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006268Eu)

/** \brief 1690, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062690u)

/** \brief 1692, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062692u)

/** \brief 1694, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062694u)

/** \brief 1696, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062696u)

/** \brief 1698, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062698u)

/** \brief 169A, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006269Au)

/** \brief 169C, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006269Cu)

/** \brief 169E, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006269Eu)

/** \brief 16A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A0u)

/** \brief 16A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A2u)

/** \brief 16A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A4u)

/** \brief 16A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A6u)

/** \brief 16A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626A8u)

/** \brief 16AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626AAu)

/** \brief 16AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626ACu)

/** \brief 16AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626AEu)

/** \brief 16B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B0u)

/** \brief 16B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B2u)

/** \brief 16B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B4u)

/** \brief 16B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B6u)

/** \brief 16B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626B8u)

/** \brief 16BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626BAu)

/** \brief 16BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626BCu)

/** \brief 16BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626BEu)

/** \brief 16C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C0u)

/** \brief 16C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C2u)

/** \brief 16C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C4u)

/** \brief 16C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C6u)

/** \brief 16C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626C8u)

/** \brief 16CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626CAu)

/** \brief 16CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626CCu)

/** \brief 16CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626CEu)

/** \brief 16D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D0u)

/** \brief 16D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D2u)

/** \brief 16D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D4u)

/** \brief 16D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D6u)

/** \brief 16D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626D8u)

