Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 16DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626DAu)

/** \brief 16DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626DCu)

/** \brief 16DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626DEu)

/** \brief 16E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626E0u)

/** \brief 16E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626E2u)

/** \brief 16E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC22_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00626E4u)

/** \brief 16F2, Error Information Register ${x} */
#define MTU_MC22_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F2u)

/** \brief 16F4, Error Information Register ${x} */
#define MTU_MC22_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F4u)

/** \brief 16F6, Error Information Register ${x} */
#define MTU_MC22_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F6u)

/** \brief 16F8, Error Information Register ${x} */
#define MTU_MC22_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F8u)

/** \brief 16FA, Error Information Register ${x} */
#define MTU_MC22_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626FAu)

/** \brief 1700, Configuration Register 0 */
#define MTU_MC23_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062700u)

/** \brief 1702, Configuration Register 1 */
#define MTU_MC23_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062702u)

/** \brief 1704, MBIST Control Register */
#define MTU_MC23_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062704u)

/** \brief 1706, Status Register */
#define MTU_MC23_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062706u)

/** \brief 1708, Range Register, single address mode */
#define MTU_MC23_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062708u)

/** \brief 170C, Revision ID Register */
#define MTU_MC23_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006270Cu)

/** \brief 170E, ECC Safety Register */
#define MTU_MC23_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006270Eu)

/** \brief 1710, Memory ECC Detection Register */
#define MTU_MC23_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062710u)

/** \brief 1712, Error Tracking Register ${x} */
#define MTU_MC23_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062712u)

/** \brief 1714, Error Tracking Register ${x} */
#define MTU_MC23_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062714u)

/** \brief 1716, Error Tracking Register ${x} */
#define MTU_MC23_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062716u)

/** \brief 1718, Error Tracking Register ${x} */
#define MTU_MC23_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062718u)

/** \brief 171A, Error Tracking Register ${x} */
#define MTU_MC23_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006271Au)

/** \brief 1760, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062760u)

/** \brief 1762, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062762u)

/** \brief 1764, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062764u)

/** \brief 1766, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062766u)

/** \brief 1768, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062768u)

/** \brief 176A, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006276Au)

/** \brief 176C, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006276Cu)

/** \brief 176E, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006276Eu)

/** \brief 1770, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062770u)

/** \brief 1772, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062772u)

/** \brief 1774, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062774u)

/** \brief 1776, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062776u)

/** \brief 1778, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062778u)

/** \brief 177A, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006277Au)

/** \brief 177C, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006277Cu)

/** \brief 177E, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006277Eu)

/** \brief 1780, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062780u)

/** \brief 1782, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062782u)

/** \brief 1784, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062784u)

/** \brief 1786, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062786u)

/** \brief 1788, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062788u)

