Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 178A, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006278Au)

/** \brief 178C, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006278Cu)

/** \brief 178E, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006278Eu)

/** \brief 1790, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062790u)

/** \brief 1792, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062792u)

/** \brief 1794, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062794u)

/** \brief 1796, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062796u)

/** \brief 1798, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062798u)

/** \brief 179A, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006279Au)

/** \brief 179C, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006279Cu)

/** \brief 179E, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006279Eu)

/** \brief 17A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A0u)

/** \brief 17A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A2u)

/** \brief 17A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A4u)

/** \brief 17A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A6u)

/** \brief 17A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A8u)

/** \brief 17AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627AAu)

/** \brief 17AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627ACu)

/** \brief 17AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627AEu)

/** \brief 17B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B0u)

/** \brief 17B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B2u)

/** \brief 17B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B4u)

/** \brief 17B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B6u)

/** \brief 17B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B8u)

/** \brief 17BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627BAu)

/** \brief 17BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627BCu)

/** \brief 17BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627BEu)

/** \brief 17C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C0u)

/** \brief 17C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C2u)

/** \brief 17C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C4u)

/** \brief 17C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C6u)

/** \brief 17C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C8u)

/** \brief 17CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627CAu)

/** \brief 17CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627CCu)

/** \brief 17CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627CEu)

/** \brief 17D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D0u)

/** \brief 17D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D2u)

/** \brief 17D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D4u)

/** \brief 17D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D6u)

/** \brief 17D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D8u)

/** \brief 17DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627DAu)

/** \brief 17DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627DCu)

/** \brief 17DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627DEu)

/** \brief 17E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627E0u)

