Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 17E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627E2u)

/** \brief 17E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC23_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627E4u)

/** \brief 17F2, Error Information Register ${x} */
#define MTU_MC23_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F2u)

/** \brief 17F4, Error Information Register ${x} */
#define MTU_MC23_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F4u)

/** \brief 17F6, Error Information Register ${x} */
#define MTU_MC23_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F6u)

/** \brief 17F8, Error Information Register ${x} */
#define MTU_MC23_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F8u)

/** \brief 17FA, Error Information Register ${x} */
#define MTU_MC23_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627FAu)

/** \brief 1800, Configuration Register 0 */
#define MTU_MC24_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062800u)

/** \brief 1802, Configuration Register 1 */
#define MTU_MC24_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062802u)

/** \brief 1804, MBIST Control Register */
#define MTU_MC24_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062804u)

/** \brief 1806, Status Register */
#define MTU_MC24_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062806u)

/** \brief 1808, Range Register, single address mode */
#define MTU_MC24_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062808u)

/** \brief 180C, Revision ID Register */
#define MTU_MC24_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006280Cu)

/** \brief 180E, ECC Safety Register */
#define MTU_MC24_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006280Eu)

/** \brief 1810, Memory ECC Detection Register */
#define MTU_MC24_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062810u)

/** \brief 1812, Error Tracking Register ${x} */
#define MTU_MC24_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062812u)

/** \brief 1814, Error Tracking Register ${x} */
#define MTU_MC24_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062814u)

/** \brief 1816, Error Tracking Register ${x} */
#define MTU_MC24_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062816u)

/** \brief 1818, Error Tracking Register ${x} */
#define MTU_MC24_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062818u)

/** \brief 181A, Error Tracking Register ${x} */
#define MTU_MC24_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006281Au)

/** \brief 1860, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062860u)

/** \brief 1862, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062862u)

/** \brief 1864, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062864u)

/** \brief 1866, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062866u)

/** \brief 1868, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062868u)

/** \brief 186A, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006286Au)

/** \brief 186C, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006286Cu)

/** \brief 186E, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006286Eu)

/** \brief 1870, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062870u)

/** \brief 1872, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062872u)

/** \brief 1874, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062874u)

/** \brief 1876, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062876u)

/** \brief 1878, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062878u)

/** \brief 187A, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006287Au)

/** \brief 187C, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006287Cu)

/** \brief 187E, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006287Eu)

/** \brief 1880, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062880u)

/** \brief 1882, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062882u)

/** \brief 1884, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062884u)

/** \brief 1886, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062886u)

/** \brief 1888, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062888u)

/** \brief 188A, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006288Au)

/** \brief 188C, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006288Cu)

