Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 188E, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006288Eu)

/** \brief 1890, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062890u)

/** \brief 1892, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062892u)

/** \brief 1894, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062894u)

/** \brief 1896, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062896u)

/** \brief 1898, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062898u)

/** \brief 189A, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006289Au)

/** \brief 189C, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006289Cu)

/** \brief 189E, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006289Eu)

/** \brief 18A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A0u)

/** \brief 18A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A2u)

/** \brief 18A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A4u)

/** \brief 18A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A6u)

/** \brief 18A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628A8u)

/** \brief 18AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628AAu)

/** \brief 18AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628ACu)

/** \brief 18AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628AEu)

/** \brief 18B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B0u)

/** \brief 18B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B2u)

/** \brief 18B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B4u)

/** \brief 18B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B6u)

/** \brief 18B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628B8u)

/** \brief 18BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628BAu)

/** \brief 18BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628BCu)

/** \brief 18BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628BEu)

/** \brief 18C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C0u)

/** \brief 18C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C2u)

/** \brief 18C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C4u)

/** \brief 18C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C6u)

/** \brief 18C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628C8u)

/** \brief 18CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628CAu)

/** \brief 18CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628CCu)

/** \brief 18CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628CEu)

/** \brief 18D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D0u)

/** \brief 18D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D2u)

/** \brief 18D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D4u)

/** \brief 18D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D6u)

/** \brief 18D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628D8u)

/** \brief 18DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628DAu)

/** \brief 18DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628DCu)

/** \brief 18DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628DEu)

/** \brief 18E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628E0u)

/** \brief 18E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628E2u)

/** \brief 18E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC24_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00628E4u)

/** \brief 18F2, Error Information Register ${x} */
#define MTU_MC24_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F2u)

/** \brief 18F4, Error Information Register ${x} */
#define MTU_MC24_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F4u)

/** \brief 18F6, Error Information Register ${x} */
#define MTU_MC24_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F6u)

