Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 18F8, Error Information Register ${x} */
#define MTU_MC24_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628F8u)

/** \brief 18FA, Error Information Register ${x} */
#define MTU_MC24_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00628FAu)

/** \brief 1900, Configuration Register 0 */
#define MTU_MC25_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062900u)

/** \brief 1902, Configuration Register 1 */
#define MTU_MC25_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062902u)

/** \brief 1904, MBIST Control Register */
#define MTU_MC25_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062904u)

/** \brief 1906, Status Register */
#define MTU_MC25_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062906u)

/** \brief 1908, Range Register, single address mode */
#define MTU_MC25_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062908u)

/** \brief 190C, Revision ID Register */
#define MTU_MC25_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006290Cu)

/** \brief 190E, ECC Safety Register */
#define MTU_MC25_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006290Eu)

/** \brief 1910, Memory ECC Detection Register */
#define MTU_MC25_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062910u)

/** \brief 1912, Error Tracking Register ${x} */
#define MTU_MC25_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062912u)

/** \brief 1914, Error Tracking Register ${x} */
#define MTU_MC25_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062914u)

/** \brief 1916, Error Tracking Register ${x} */
#define MTU_MC25_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062916u)

/** \brief 1918, Error Tracking Register ${x} */
#define MTU_MC25_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062918u)

/** \brief 191A, Error Tracking Register ${x} */
#define MTU_MC25_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006291Au)

/** \brief 1960, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062960u)

/** \brief 1962, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062962u)

/** \brief 1964, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062964u)

/** \brief 1966, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062966u)

/** \brief 1968, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062968u)

/** \brief 196A, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006296Au)

/** \brief 196C, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006296Cu)

/** \brief 196E, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006296Eu)

/** \brief 1970, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062970u)

/** \brief 1972, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062972u)

/** \brief 1974, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062974u)

/** \brief 1976, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062976u)

/** \brief 1978, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062978u)

/** \brief 197A, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006297Au)

/** \brief 197C, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006297Cu)

/** \brief 197E, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006297Eu)

/** \brief 1980, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062980u)

/** \brief 1982, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062982u)

/** \brief 1984, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062984u)

/** \brief 1986, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062986u)

/** \brief 1988, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062988u)

/** \brief 198A, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006298Au)

/** \brief 198C, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006298Cu)

/** \brief 198E, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006298Eu)

/** \brief 1990, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062990u)

/** \brief 1992, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062992u)

/** \brief 1994, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062994u)

/** \brief 1996, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062996u)

/** \brief 1998, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062998u)

/** \brief 199A, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006299Au)

/** \brief 199C, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006299Cu)

/** \brief 199E, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006299Eu)

/** \brief 19A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A0u)

