Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 19A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A2u)

/** \brief 19A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A4u)

/** \brief 19A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A6u)

/** \brief 19A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A8u)

/** \brief 19AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629AAu)

/** \brief 19AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629ACu)

/** \brief 19AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629AEu)

/** \brief 19B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B0u)

/** \brief 19B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B2u)

/** \brief 19B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B4u)

/** \brief 19B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B6u)

/** \brief 19B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B8u)

/** \brief 19BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629BAu)

/** \brief 19BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629BCu)

/** \brief 19BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629BEu)

/** \brief 19C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C0u)

/** \brief 19C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C2u)

/** \brief 19C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C4u)

/** \brief 19C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C6u)

/** \brief 19C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C8u)

/** \brief 19CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629CAu)

/** \brief 19CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629CCu)

/** \brief 19CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629CEu)

/** \brief 19D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D0u)

/** \brief 19D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D2u)

/** \brief 19D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D4u)

/** \brief 19D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D6u)

/** \brief 19D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D8u)

/** \brief 19DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629DAu)

/** \brief 19DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629DCu)

/** \brief 19DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629DEu)

/** \brief 19E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629E0u)

/** \brief 19E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629E2u)

/** \brief 19E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC25_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629E4u)

/** \brief 19F2, Error Information Register ${x} */
#define MTU_MC25_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F2u)

/** \brief 19F4, Error Information Register ${x} */
#define MTU_MC25_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F4u)

/** \brief 19F6, Error Information Register ${x} */
#define MTU_MC25_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F6u)

/** \brief 19F8, Error Information Register ${x} */
#define MTU_MC25_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F8u)

/** \brief 19FA, Error Information Register ${x} */
#define MTU_MC25_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629FAu)

/** \brief 1A00, Configuration Register 0 */
#define MTU_MC26_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062A00u)

/** \brief 1A02, Configuration Register 1 */
#define MTU_MC26_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062A02u)

/** \brief 1A04, MBIST Control Register */
#define MTU_MC26_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062A04u)

