Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1A06, Status Register */
#define MTU_MC26_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062A06u)

/** \brief 1A08, Range Register, single address mode */
#define MTU_MC26_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062A08u)

/** \brief 1A0C, Revision ID Register */
#define MTU_MC26_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062A0Cu)

/** \brief 1A0E, ECC Safety Register */
#define MTU_MC26_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062A0Eu)

/** \brief 1A10, Memory ECC Detection Register */
#define MTU_MC26_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062A10u)

/** \brief 1A12, Error Tracking Register ${x} */
#define MTU_MC26_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A12u)

/** \brief 1A14, Error Tracking Register ${x} */
#define MTU_MC26_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A14u)

/** \brief 1A16, Error Tracking Register ${x} */
#define MTU_MC26_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A16u)

/** \brief 1A18, Error Tracking Register ${x} */
#define MTU_MC26_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A18u)

/** \brief 1A1A, Error Tracking Register ${x} */
#define MTU_MC26_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A1Au)

/** \brief 1A60, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A60u)

/** \brief 1A62, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A62u)

/** \brief 1A64, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A64u)

/** \brief 1A66, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A66u)

/** \brief 1A68, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A68u)

/** \brief 1A6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A6Au)

/** \brief 1A6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A6Cu)

/** \brief 1A6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A6Eu)

/** \brief 1A70, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A70u)

/** \brief 1A72, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A72u)

/** \brief 1A74, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A74u)

/** \brief 1A76, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A76u)

/** \brief 1A78, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A78u)

/** \brief 1A7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A7Au)

/** \brief 1A7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A7Cu)

/** \brief 1A7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A7Eu)

/** \brief 1A80, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A80u)

/** \brief 1A82, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A82u)

/** \brief 1A84, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A84u)

/** \brief 1A86, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A86u)

/** \brief 1A88, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A88u)

/** \brief 1A8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A8Au)

/** \brief 1A8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A8Cu)

/** \brief 1A8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A8Eu)

/** \brief 1A90, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A90u)

/** \brief 1A92, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A92u)

/** \brief 1A94, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A94u)

/** \brief 1A96, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A96u)

/** \brief 1A98, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A98u)

/** \brief 1A9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A9Au)

/** \brief 1A9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A9Cu)

/** \brief 1A9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A9Eu)

/** \brief 1AA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA0u)

/** \brief 1AA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA2u)

/** \brief 1AA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA4u)

