Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1AA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA6u)

/** \brief 1AA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA8u)

/** \brief 1AAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AAAu)

/** \brief 1AAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AACu)

/** \brief 1AAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AAEu)

/** \brief 1AB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB0u)

/** \brief 1AB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB2u)

/** \brief 1AB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB4u)

/** \brief 1AB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB6u)

/** \brief 1AB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB8u)

/** \brief 1ABA, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ABAu)

/** \brief 1ABC, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ABCu)

/** \brief 1ABE, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ABEu)

/** \brief 1AC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC0u)

/** \brief 1AC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC2u)

/** \brief 1AC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC4u)

/** \brief 1AC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC6u)

/** \brief 1AC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC8u)

/** \brief 1ACA, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ACAu)

/** \brief 1ACC, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ACCu)

/** \brief 1ACE, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ACEu)

/** \brief 1AD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD0u)

/** \brief 1AD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD2u)

/** \brief 1AD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD4u)

/** \brief 1AD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD6u)

/** \brief 1AD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD8u)

/** \brief 1ADA, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ADAu)

/** \brief 1ADC, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ADCu)

/** \brief 1ADE, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ADEu)

/** \brief 1AE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AE0u)

/** \brief 1AE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AE2u)

/** \brief 1AE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC26_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AE4u)

/** \brief 1AF2, Error Information Register ${x} */
#define MTU_MC26_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF2u)

/** \brief 1AF4, Error Information Register ${x} */
#define MTU_MC26_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF4u)

/** \brief 1AF6, Error Information Register ${x} */
#define MTU_MC26_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF6u)

/** \brief 1AF8, Error Information Register ${x} */
#define MTU_MC26_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF8u)

/** \brief 1AFA, Error Information Register ${x} */
#define MTU_MC26_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AFAu)

/** \brief 1B00, Configuration Register 0 */
#define MTU_MC27_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062B00u)

/** \brief 1B02, Configuration Register 1 */
#define MTU_MC27_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062B02u)

/** \brief 1B04, MBIST Control Register */
#define MTU_MC27_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062B04u)

/** \brief 1B06, Status Register */
#define MTU_MC27_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062B06u)

/** \brief 1B08, Range Register, single address mode */
#define MTU_MC27_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062B08u)

/** \brief 1B0C, Revision ID Register */
#define MTU_MC27_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062B0Cu)

/** \brief 1B0E, ECC Safety Register */
#define MTU_MC27_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062B0Eu)

/** \brief 1B10, Memory ECC Detection Register */
#define MTU_MC27_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062B10u)

