Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1BB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BB2u)

/** \brief 1BB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BB4u)

/** \brief 1BB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BB6u)

/** \brief 1BB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BB8u)

/** \brief 1BBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BBAu)

/** \brief 1BBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BBCu)

/** \brief 1BBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BBEu)

/** \brief 1BC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BC0u)

/** \brief 1BC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BC2u)

/** \brief 1BC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BC4u)

/** \brief 1BC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BC6u)

/** \brief 1BC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BC8u)

/** \brief 1BCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BCAu)

/** \brief 1BCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BCCu)

/** \brief 1BCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BCEu)

/** \brief 1BD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BD0u)

/** \brief 1BD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BD2u)

/** \brief 1BD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BD4u)

/** \brief 1BD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BD6u)

/** \brief 1BD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BD8u)

/** \brief 1BDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BDAu)

/** \brief 1BDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BDCu)

/** \brief 1BDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BDEu)

/** \brief 1BE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BE0u)

/** \brief 1BE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BE2u)

/** \brief 1BE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC27_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BE4u)

/** \brief 1BF2, Error Information Register ${x} */
#define MTU_MC27_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062BF2u)

/** \brief 1BF4, Error Information Register ${x} */
#define MTU_MC27_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062BF4u)

/** \brief 1BF6, Error Information Register ${x} */
#define MTU_MC27_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062BF6u)

/** \brief 1BF8, Error Information Register ${x} */
#define MTU_MC27_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062BF8u)

/** \brief 1BFA, Error Information Register ${x} */
#define MTU_MC27_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062BFAu)

/** \brief 1C00, Configuration Register 0 */
#define MTU_MC28_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062C00u)

/** \brief 1C02, Configuration Register 1 */
#define MTU_MC28_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062C02u)

/** \brief 1C04, MBIST Control Register */
#define MTU_MC28_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062C04u)

/** \brief 1C06, Status Register */
#define MTU_MC28_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062C06u)

/** \brief 1C08, Range Register, single address mode */
#define MTU_MC28_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062C08u)

/** \brief 1C0C, Revision ID Register */
#define MTU_MC28_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062C0Cu)

/** \brief 1C0E, ECC Safety Register */
#define MTU_MC28_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062C0Eu)

/** \brief 1C10, Memory ECC Detection Register */
#define MTU_MC28_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062C10u)

/** \brief 1C12, Error Tracking Register ${x} */
#define MTU_MC28_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062C12u)

/** \brief 1C14, Error Tracking Register ${x} */
#define MTU_MC28_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062C14u)

/** \brief 1C16, Error Tracking Register ${x} */
#define MTU_MC28_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062C16u)

/** \brief 1C18, Error Tracking Register ${x} */
#define MTU_MC28_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062C18u)

/** \brief 1C1A, Error Tracking Register ${x} */
#define MTU_MC28_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062C1Au)

/** \brief 1C60, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C60u)

/** \brief 1C62, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C62u)

/** \brief 1C64, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C64u)

