Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1CBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CBEu)

/** \brief 1CC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CC0u)

/** \brief 1CC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CC2u)

/** \brief 1CC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CC4u)

/** \brief 1CC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CC6u)

/** \brief 1CC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CC8u)

/** \brief 1CCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CCAu)

/** \brief 1CCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CCCu)

/** \brief 1CCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CCEu)

/** \brief 1CD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CD0u)

/** \brief 1CD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CD2u)

/** \brief 1CD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CD4u)

/** \brief 1CD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CD6u)

/** \brief 1CD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CD8u)

/** \brief 1CDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CDAu)

/** \brief 1CDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CDCu)

/** \brief 1CDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CDEu)

/** \brief 1CE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CE0u)

/** \brief 1CE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CE2u)

/** \brief 1CE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC28_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CE4u)

/** \brief 1CF2, Error Information Register ${x} */
#define MTU_MC28_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062CF2u)

/** \brief 1CF4, Error Information Register ${x} */
#define MTU_MC28_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062CF4u)

/** \brief 1CF6, Error Information Register ${x} */
#define MTU_MC28_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062CF6u)

/** \brief 1CF8, Error Information Register ${x} */
#define MTU_MC28_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062CF8u)

/** \brief 1CFA, Error Information Register ${x} */
#define MTU_MC28_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062CFAu)

/** \brief 1D00, Configuration Register 0 */
#define MTU_MC29_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062D00u)

/** \brief 1D02, Configuration Register 1 */
#define MTU_MC29_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062D02u)

/** \brief 1D04, MBIST Control Register */
#define MTU_MC29_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062D04u)

/** \brief 1D06, Status Register */
#define MTU_MC29_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062D06u)

/** \brief 1D08, Range Register, single address mode */
#define MTU_MC29_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062D08u)

/** \brief 1D0C, Revision ID Register */
#define MTU_MC29_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062D0Cu)

/** \brief 1D0E, ECC Safety Register */
#define MTU_MC29_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062D0Eu)

/** \brief 1D10, Memory ECC Detection Register */
#define MTU_MC29_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062D10u)

/** \brief 1D12, Error Tracking Register ${x} */
#define MTU_MC29_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062D12u)

/** \brief 1D14, Error Tracking Register ${x} */
#define MTU_MC29_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062D14u)

/** \brief 1D16, Error Tracking Register ${x} */
#define MTU_MC29_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062D16u)

/** \brief 1D18, Error Tracking Register ${x} */
#define MTU_MC29_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062D18u)

/** \brief 1D1A, Error Tracking Register ${x} */
#define MTU_MC29_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062D1Au)

/** \brief 1D60, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D60u)

/** \brief 1D62, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D62u)

/** \brief 1D64, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D64u)

/** \brief 1D66, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D66u)

/** \brief 1D68, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D68u)

