Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1D6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D6Au)

/** \brief 1D6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D6Cu)

/** \brief 1D6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D6Eu)

/** \brief 1D70, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D70u)

/** \brief 1D72, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D72u)

/** \brief 1D74, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D74u)

/** \brief 1D76, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D76u)

/** \brief 1D78, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D78u)

/** \brief 1D7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D7Au)

/** \brief 1D7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D7Cu)

/** \brief 1D7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D7Eu)

/** \brief 1D80, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D80u)

/** \brief 1D82, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D82u)

/** \brief 1D84, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D84u)

/** \brief 1D86, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D86u)

/** \brief 1D88, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D88u)

/** \brief 1D8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D8Au)

/** \brief 1D8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D8Cu)

/** \brief 1D8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D8Eu)

/** \brief 1D90, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D90u)

/** \brief 1D92, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D92u)

/** \brief 1D94, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D94u)

/** \brief 1D96, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D96u)

/** \brief 1D98, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D98u)

/** \brief 1D9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D9Au)

/** \brief 1D9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D9Cu)

/** \brief 1D9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062D9Eu)

/** \brief 1DA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DA0u)

/** \brief 1DA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DA2u)

/** \brief 1DA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DA4u)

/** \brief 1DA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DA6u)

/** \brief 1DA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DA8u)

/** \brief 1DAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DAAu)

/** \brief 1DAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DACu)

/** \brief 1DAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DAEu)

/** \brief 1DB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB0u)

/** \brief 1DB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB2u)

/** \brief 1DB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB4u)

/** \brief 1DB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB6u)

/** \brief 1DB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB8u)

/** \brief 1DBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DBAu)

/** \brief 1DBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DBCu)

/** \brief 1DBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DBEu)

/** \brief 1DC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC0u)

/** \brief 1DC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC2u)

/** \brief 1DC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC29_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC4u)

