Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1E72, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E72u)

/** \brief 1E74, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E74u)

/** \brief 1E76, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E76u)

/** \brief 1E78, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E78u)

/** \brief 1E7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E7Au)

/** \brief 1E7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E7Cu)

/** \brief 1E7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E7Eu)

/** \brief 1E80, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E80u)

/** \brief 1E82, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E82u)

/** \brief 1E84, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E84u)

/** \brief 1E86, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E86u)

/** \brief 1E88, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E88u)

/** \brief 1E8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E8Au)

/** \brief 1E8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E8Cu)

/** \brief 1E8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E8Eu)

/** \brief 1E90, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E90u)

/** \brief 1E92, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E92u)

/** \brief 1E94, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E94u)

/** \brief 1E96, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E96u)

/** \brief 1E98, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E98u)

/** \brief 1E9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E9Au)

/** \brief 1E9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E9Cu)

/** \brief 1E9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E9Eu)

/** \brief 1EA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA0u)

/** \brief 1EA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA2u)

/** \brief 1EA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA4u)

/** \brief 1EA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA6u)

/** \brief 1EA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA8u)

/** \brief 1EAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EAAu)

/** \brief 1EAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EACu)

/** \brief 1EAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EAEu)

/** \brief 1EB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB0u)

/** \brief 1EB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB2u)

/** \brief 1EB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB4u)

/** \brief 1EB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB6u)

/** \brief 1EB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB8u)

/** \brief 1EBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EBAu)

/** \brief 1EBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EBCu)

/** \brief 1EBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EBEu)

/** \brief 1EC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC0u)

/** \brief 1EC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC2u)

/** \brief 1EC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC4u)

/** \brief 1EC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC6u)

/** \brief 1EC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC8u)

