Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1ECA, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ECAu)

/** \brief 1ECC, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ECCu)

/** \brief 1ECE, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ECEu)

/** \brief 1ED0, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED0u)

/** \brief 1ED2, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED2u)

/** \brief 1ED4, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED4u)

/** \brief 1ED6, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED6u)

/** \brief 1ED8, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED8u)

/** \brief 1EDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EDAu)

/** \brief 1EDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EDCu)

/** \brief 1EDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EDEu)

/** \brief 1EE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EE0u)

/** \brief 1EE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EE2u)

/** \brief 1EE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC30_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EE4u)

/** \brief 1EF2, Error Information Register ${x} */
#define MTU_MC30_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF2u)

/** \brief 1EF4, Error Information Register ${x} */
#define MTU_MC30_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF4u)

/** \brief 1EF6, Error Information Register ${x} */
#define MTU_MC30_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF6u)

/** \brief 1EF8, Error Information Register ${x} */
#define MTU_MC30_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF8u)

/** \brief 1EFA, Error Information Register ${x} */
#define MTU_MC30_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EFAu)

/** \brief 1F00, Configuration Register 0 */
#define MTU_MC31_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062F00u)

/** \brief 1F02, Configuration Register 1 */
#define MTU_MC31_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062F02u)

/** \brief 1F04, MBIST Control Register */
#define MTU_MC31_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062F04u)

/** \brief 1F06, Status Register */
#define MTU_MC31_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062F06u)

/** \brief 1F08, Range Register, single address mode */
#define MTU_MC31_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062F08u)

/** \brief 1F0C, Revision ID Register */
#define MTU_MC31_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062F0Cu)

/** \brief 1F0E, ECC Safety Register */
#define MTU_MC31_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062F0Eu)

/** \brief 1F10, Memory ECC Detection Register */
#define MTU_MC31_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062F10u)

/** \brief 1F12, Error Tracking Register ${x} */
#define MTU_MC31_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F12u)

/** \brief 1F14, Error Tracking Register ${x} */
#define MTU_MC31_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F14u)

/** \brief 1F16, Error Tracking Register ${x} */
#define MTU_MC31_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F16u)

/** \brief 1F18, Error Tracking Register ${x} */
#define MTU_MC31_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F18u)

/** \brief 1F1A, Error Tracking Register ${x} */
#define MTU_MC31_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F1Au)

/** \brief 1F60, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F60u)

/** \brief 1F62, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F62u)

/** \brief 1F64, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F64u)

/** \brief 1F66, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F66u)

/** \brief 1F68, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F68u)

/** \brief 1F6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F6Au)

/** \brief 1F6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F6Cu)

/** \brief 1F6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F6Eu)

/** \brief 1F70, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F70u)

/** \brief 1F72, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F72u)

/** \brief 1F74, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F74u)

/** \brief 1F76, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F76u)

