Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1F78, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F78u)

/** \brief 1F7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F7Au)

/** \brief 1F7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F7Cu)

/** \brief 1F7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F7Eu)

/** \brief 1F80, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F80u)

/** \brief 1F82, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F82u)

/** \brief 1F84, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F84u)

/** \brief 1F86, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F86u)

/** \brief 1F88, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F88u)

/** \brief 1F8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F8Au)

/** \brief 1F8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F8Cu)

/** \brief 1F8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F8Eu)

/** \brief 1F90, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F90u)

/** \brief 1F92, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F92u)

/** \brief 1F94, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F94u)

/** \brief 1F96, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F96u)

/** \brief 1F98, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F98u)

/** \brief 1F9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F9Au)

/** \brief 1F9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F9Cu)

/** \brief 1F9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062F9Eu)

/** \brief 1FA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA0u)

/** \brief 1FA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA2u)

/** \brief 1FA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA4u)

/** \brief 1FA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA6u)

/** \brief 1FA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FA8u)

/** \brief 1FAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FAAu)

/** \brief 1FAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FACu)

/** \brief 1FAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FAEu)

/** \brief 1FB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB0u)

/** \brief 1FB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB2u)

/** \brief 1FB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB4u)

/** \brief 1FB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB6u)

/** \brief 1FB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FB8u)

/** \brief 1FBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FBAu)

/** \brief 1FBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FBCu)

/** \brief 1FBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FBEu)

/** \brief 1FC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC0u)

/** \brief 1FC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC2u)

/** \brief 1FC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC4u)

/** \brief 1FC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC6u)

/** \brief 1FC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FC8u)

/** \brief 1FCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FCAu)

/** \brief 1FCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FCCu)

/** \brief 1FCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FCEu)

/** \brief 1FD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD0u)

/** \brief 1FD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD2u)

/** \brief 1FD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD4u)

