Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 1FD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD6u)

/** \brief 1FD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FD8u)

/** \brief 1FDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FDAu)

/** \brief 1FDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FDCu)

/** \brief 1FDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FDEu)

/** \brief 1FE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FE0u)

/** \brief 1FE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FE2u)

/** \brief 1FE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC31_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062FE4u)

/** \brief 1FF2, Error Information Register ${x} */
#define MTU_MC31_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF2u)

/** \brief 1FF4, Error Information Register ${x} */
#define MTU_MC31_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF4u)

/** \brief 1FF6, Error Information Register ${x} */
#define MTU_MC31_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF6u)

/** \brief 1FF8, Error Information Register ${x} */
#define MTU_MC31_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FF8u)

/** \brief 1FFA, Error Information Register ${x} */
#define MTU_MC31_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062FFAu)

/** \brief 2000, Configuration Register 0 */
#define MTU_MC32_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063000u)

/** \brief 2002, Configuration Register 1 */
#define MTU_MC32_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063002u)

/** \brief 2004, MBIST Control Register */
#define MTU_MC32_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063004u)

/** \brief 2006, Status Register */
#define MTU_MC32_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063006u)

/** \brief 2008, Range Register, single address mode */
#define MTU_MC32_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063008u)

/** \brief 200C, Revision ID Register */
#define MTU_MC32_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006300Cu)

/** \brief 200E, ECC Safety Register */
#define MTU_MC32_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006300Eu)

/** \brief 2010, Memory ECC Detection Register */
#define MTU_MC32_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063010u)

/** \brief 2012, Error Tracking Register ${x} */
#define MTU_MC32_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063012u)

/** \brief 2014, Error Tracking Register ${x} */
#define MTU_MC32_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063014u)

/** \brief 2016, Error Tracking Register ${x} */
#define MTU_MC32_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063016u)

/** \brief 2018, Error Tracking Register ${x} */
#define MTU_MC32_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063018u)

/** \brief 201A, Error Tracking Register ${x} */
#define MTU_MC32_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006301Au)

/** \brief 2060, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063060u)

/** \brief 2062, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063062u)

/** \brief 2064, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063064u)

/** \brief 2066, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063066u)

/** \brief 2068, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063068u)

/** \brief 206A, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006306Au)

/** \brief 206C, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006306Cu)

/** \brief 206E, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006306Eu)

/** \brief 2070, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063070u)

/** \brief 2072, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063072u)

/** \brief 2074, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063074u)

/** \brief 2076, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063076u)

/** \brief 2078, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063078u)

/** \brief 207A, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006307Au)

/** \brief 207C, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006307Cu)

/** \brief 207E, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006307Eu)

/** \brief 2080, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063080u)

/** \brief 2082, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063082u)

