Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2084, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063084u)

/** \brief 2086, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063086u)

/** \brief 2088, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063088u)

/** \brief 208A, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006308Au)

/** \brief 208C, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006308Cu)

/** \brief 208E, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006308Eu)

/** \brief 2090, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063090u)

/** \brief 2092, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063092u)

/** \brief 2094, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063094u)

/** \brief 2096, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063096u)

/** \brief 2098, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063098u)

/** \brief 209A, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006309Au)

/** \brief 209C, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006309Cu)

/** \brief 209E, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006309Eu)

/** \brief 20A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A0u)

/** \brief 20A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A2u)

/** \brief 20A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A4u)

/** \brief 20A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A6u)

/** \brief 20A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A8u)

/** \brief 20AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630AAu)

/** \brief 20AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630ACu)

/** \brief 20AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630AEu)

/** \brief 20B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B0u)

/** \brief 20B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B2u)

/** \brief 20B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B4u)

/** \brief 20B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B6u)

/** \brief 20B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B8u)

/** \brief 20BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630BAu)

/** \brief 20BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630BCu)

/** \brief 20BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630BEu)

/** \brief 20C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C0u)

/** \brief 20C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C2u)

/** \brief 20C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C4u)

/** \brief 20C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C6u)

/** \brief 20C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630C8u)

/** \brief 20CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630CAu)

/** \brief 20CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630CCu)

/** \brief 20CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630CEu)

/** \brief 20D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D0u)

/** \brief 20D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D2u)

/** \brief 20D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D4u)

/** \brief 20D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D6u)

/** \brief 20D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630D8u)

/** \brief 20DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630DAu)

