Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 20DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630DCu)

/** \brief 20DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630DEu)

/** \brief 20E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630E0u)

/** \brief 20E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630E2u)

/** \brief 20E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC32_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630E4u)

/** \brief 20F2, Error Information Register ${x} */
#define MTU_MC32_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F2u)

/** \brief 20F4, Error Information Register ${x} */
#define MTU_MC32_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F4u)

/** \brief 20F6, Error Information Register ${x} */
#define MTU_MC32_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F6u)

/** \brief 20F8, Error Information Register ${x} */
#define MTU_MC32_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630F8u)

/** \brief 20FA, Error Information Register ${x} */
#define MTU_MC32_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00630FAu)

/** \brief 2100, Configuration Register 0 */
#define MTU_MC33_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063100u)

/** \brief 2102, Configuration Register 1 */
#define MTU_MC33_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063102u)

/** \brief 2104, MBIST Control Register */
#define MTU_MC33_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063104u)

/** \brief 2106, Status Register */
#define MTU_MC33_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063106u)

/** \brief 2108, Range Register, single address mode */
#define MTU_MC33_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063108u)

/** \brief 210C, Revision ID Register */
#define MTU_MC33_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006310Cu)

/** \brief 210E, ECC Safety Register */
#define MTU_MC33_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006310Eu)

/** \brief 2110, Memory ECC Detection Register */
#define MTU_MC33_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063110u)

/** \brief 2112, Error Tracking Register ${x} */
#define MTU_MC33_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063112u)

/** \brief 2114, Error Tracking Register ${x} */
#define MTU_MC33_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063114u)

/** \brief 2116, Error Tracking Register ${x} */
#define MTU_MC33_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063116u)

/** \brief 2118, Error Tracking Register ${x} */
#define MTU_MC33_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063118u)

/** \brief 211A, Error Tracking Register ${x} */
#define MTU_MC33_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006311Au)

/** \brief 2160, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063160u)

/** \brief 2162, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063162u)

/** \brief 2164, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063164u)

/** \brief 2166, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063166u)

/** \brief 2168, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063168u)

/** \brief 216A, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006316Au)

/** \brief 216C, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006316Cu)

/** \brief 216E, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006316Eu)

/** \brief 2170, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063170u)

/** \brief 2172, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063172u)

/** \brief 2174, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063174u)

/** \brief 2176, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063176u)

/** \brief 2178, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063178u)

/** \brief 217A, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006317Au)

/** \brief 217C, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006317Cu)

/** \brief 217E, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006317Eu)

/** \brief 2180, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063180u)

/** \brief 2182, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063182u)

/** \brief 2184, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063184u)

/** \brief 2186, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063186u)

/** \brief 2188, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063188u)

/** \brief 218A, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006318Au)

