Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 218C, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006318Cu)

/** \brief 218E, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006318Eu)

/** \brief 2190, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063190u)

/** \brief 2192, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063192u)

/** \brief 2194, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063194u)

/** \brief 2196, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063196u)

/** \brief 2198, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063198u)

/** \brief 219A, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006319Au)

/** \brief 219C, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006319Cu)

/** \brief 219E, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006319Eu)

/** \brief 21A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A0u)

/** \brief 21A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A2u)

/** \brief 21A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A4u)

/** \brief 21A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A6u)

/** \brief 21A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A8u)

/** \brief 21AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631AAu)

/** \brief 21AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631ACu)

/** \brief 21AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631AEu)

/** \brief 21B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B0u)

/** \brief 21B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B2u)

/** \brief 21B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B4u)

/** \brief 21B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B6u)

/** \brief 21B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B8u)

/** \brief 21BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631BAu)

/** \brief 21BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631BCu)

/** \brief 21BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631BEu)

/** \brief 21C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C0u)

/** \brief 21C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C2u)

/** \brief 21C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C4u)

/** \brief 21C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C6u)

/** \brief 21C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C8u)

/** \brief 21CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631CAu)

/** \brief 21CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631CCu)

/** \brief 21CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631CEu)

/** \brief 21D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D0u)

/** \brief 21D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D2u)

/** \brief 21D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D4u)

/** \brief 21D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D6u)

/** \brief 21D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D8u)

/** \brief 21DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631DAu)

/** \brief 21DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631DCu)

/** \brief 21DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631DEu)

