Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 21E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631E0u)

/** \brief 21E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631E2u)

/** \brief 21E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC33_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631E4u)

/** \brief 21F2, Error Information Register ${x} */
#define MTU_MC33_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F2u)

/** \brief 21F4, Error Information Register ${x} */
#define MTU_MC33_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F4u)

/** \brief 21F6, Error Information Register ${x} */
#define MTU_MC33_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F6u)

/** \brief 21F8, Error Information Register ${x} */
#define MTU_MC33_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F8u)

/** \brief 21FA, Error Information Register ${x} */
#define MTU_MC33_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631FAu)

/** \brief 2200, Configuration Register 0 */
#define MTU_MC34_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063200u)

/** \brief 2202, Configuration Register 1 */
#define MTU_MC34_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063202u)

/** \brief 2204, MBIST Control Register */
#define MTU_MC34_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063204u)

/** \brief 2206, Status Register */
#define MTU_MC34_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063206u)

/** \brief 2208, Range Register, single address mode */
#define MTU_MC34_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063208u)

/** \brief 220C, Revision ID Register */
#define MTU_MC34_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006320Cu)

/** \brief 220E, ECC Safety Register */
#define MTU_MC34_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006320Eu)

/** \brief 2210, Memory ECC Detection Register */
#define MTU_MC34_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063210u)

/** \brief 2212, Error Tracking Register ${x} */
#define MTU_MC34_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063212u)

/** \brief 2214, Error Tracking Register ${x} */
#define MTU_MC34_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063214u)

/** \brief 2216, Error Tracking Register ${x} */
#define MTU_MC34_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063216u)

/** \brief 2218, Error Tracking Register ${x} */
#define MTU_MC34_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063218u)

/** \brief 221A, Error Tracking Register ${x} */
#define MTU_MC34_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006321Au)

/** \brief 2260, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063260u)

/** \brief 2262, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063262u)

/** \brief 2264, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063264u)

/** \brief 2266, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063266u)

/** \brief 2268, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063268u)

/** \brief 226A, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006326Au)

/** \brief 226C, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006326Cu)

/** \brief 226E, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006326Eu)

/** \brief 2270, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063270u)

/** \brief 2272, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063272u)

/** \brief 2274, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063274u)

/** \brief 2276, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063276u)

/** \brief 2278, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063278u)

/** \brief 227A, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006327Au)

/** \brief 227C, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006327Cu)

/** \brief 227E, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006327Eu)

/** \brief 2280, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063280u)

/** \brief 2282, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063282u)

/** \brief 2284, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063284u)

/** \brief 2286, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063286u)

/** \brief 2288, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063288u)

/** \brief 228A, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006328Au)

/** \brief 228C, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006328Cu)

