Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 228E, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006328Eu)

/** \brief 2290, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063290u)

/** \brief 2292, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063292u)

/** \brief 2294, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063294u)

/** \brief 2296, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063296u)

/** \brief 2298, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063298u)

/** \brief 229A, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006329Au)

/** \brief 229C, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006329Cu)

/** \brief 229E, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006329Eu)

/** \brief 22A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A0u)

/** \brief 22A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A2u)

/** \brief 22A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A4u)

/** \brief 22A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A6u)

/** \brief 22A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A8u)

/** \brief 22AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632AAu)

/** \brief 22AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632ACu)

/** \brief 22AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632AEu)

/** \brief 22B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B0u)

/** \brief 22B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B2u)

/** \brief 22B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B4u)

/** \brief 22B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B6u)

/** \brief 22B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632B8u)

/** \brief 22BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632BAu)

/** \brief 22BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632BCu)

/** \brief 22BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632BEu)

/** \brief 22C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C0u)

/** \brief 22C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C2u)

/** \brief 22C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C4u)

/** \brief 22C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C6u)

/** \brief 22C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632C8u)

/** \brief 22CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632CAu)

/** \brief 22CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632CCu)

/** \brief 22CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632CEu)

/** \brief 22D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D0u)

/** \brief 22D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D2u)

/** \brief 22D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D4u)

/** \brief 22D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D6u)

/** \brief 22D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632D8u)

/** \brief 22DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632DAu)

/** \brief 22DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632DCu)

/** \brief 22DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632DEu)

/** \brief 22E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632E0u)

/** \brief 22E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632E2u)

/** \brief 22E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC34_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632E4u)

