Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 22F2, Error Information Register ${x} */
#define MTU_MC34_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F2u)

/** \brief 22F4, Error Information Register ${x} */
#define MTU_MC34_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F4u)

/** \brief 22F6, Error Information Register ${x} */
#define MTU_MC34_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F6u)

/** \brief 22F8, Error Information Register ${x} */
#define MTU_MC34_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632F8u)

/** \brief 22FA, Error Information Register ${x} */
#define MTU_MC34_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00632FAu)

/** \brief 2300, Configuration Register 0 */
#define MTU_MC35_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063300u)

/** \brief 2302, Configuration Register 1 */
#define MTU_MC35_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063302u)

/** \brief 2304, MBIST Control Register */
#define MTU_MC35_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063304u)

/** \brief 2306, Status Register */
#define MTU_MC35_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063306u)

/** \brief 2308, Range Register, single address mode */
#define MTU_MC35_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063308u)

/** \brief 230C, Revision ID Register */
#define MTU_MC35_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006330Cu)

/** \brief 230E, ECC Safety Register */
#define MTU_MC35_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006330Eu)

/** \brief 2310, Memory ECC Detection Register */
#define MTU_MC35_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063310u)

/** \brief 2312, Error Tracking Register ${x} */
#define MTU_MC35_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063312u)

/** \brief 2314, Error Tracking Register ${x} */
#define MTU_MC35_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063314u)

/** \brief 2316, Error Tracking Register ${x} */
#define MTU_MC35_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063316u)

/** \brief 2318, Error Tracking Register ${x} */
#define MTU_MC35_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063318u)

/** \brief 231A, Error Tracking Register ${x} */
#define MTU_MC35_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006331Au)

/** \brief 2360, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063360u)

/** \brief 2362, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063362u)

/** \brief 2364, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063364u)

/** \brief 2366, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063366u)

/** \brief 2368, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063368u)

/** \brief 236A, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006336Au)

/** \brief 236C, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006336Cu)

/** \brief 236E, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006336Eu)

/** \brief 2370, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063370u)

/** \brief 2372, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063372u)

/** \brief 2374, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063374u)

/** \brief 2376, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063376u)

/** \brief 2378, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063378u)

/** \brief 237A, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006337Au)

/** \brief 237C, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006337Cu)

/** \brief 237E, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006337Eu)

/** \brief 2380, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063380u)

/** \brief 2382, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063382u)

/** \brief 2384, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063384u)

/** \brief 2386, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063386u)

/** \brief 2388, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063388u)

/** \brief 238A, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006338Au)

/** \brief 238C, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006338Cu)

/** \brief 238E, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006338Eu)

/** \brief 2390, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063390u)

/** \brief 2392, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063392u)

/** \brief 2394, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063394u)

