Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2396, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063396u)

/** \brief 2398, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063398u)

/** \brief 239A, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006339Au)

/** \brief 239C, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006339Cu)

/** \brief 239E, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006339Eu)

/** \brief 23A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A0u)

/** \brief 23A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A2u)

/** \brief 23A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A4u)

/** \brief 23A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A6u)

/** \brief 23A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A8u)

/** \brief 23AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633AAu)

/** \brief 23AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633ACu)

/** \brief 23AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633AEu)

/** \brief 23B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B0u)

/** \brief 23B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B2u)

/** \brief 23B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B4u)

/** \brief 23B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B6u)

/** \brief 23B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B8u)

/** \brief 23BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633BAu)

/** \brief 23BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633BCu)

/** \brief 23BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633BEu)

/** \brief 23C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C0u)

/** \brief 23C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C2u)

/** \brief 23C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C4u)

/** \brief 23C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C6u)

/** \brief 23C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C8u)

/** \brief 23CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633CAu)

/** \brief 23CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633CCu)

/** \brief 23CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633CEu)

/** \brief 23D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D0u)

/** \brief 23D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D2u)

/** \brief 23D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D4u)

/** \brief 23D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D6u)

/** \brief 23D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D8u)

/** \brief 23DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633DAu)

/** \brief 23DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633DCu)

/** \brief 23DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633DEu)

/** \brief 23E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633E0u)

/** \brief 23E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633E2u)

/** \brief 23E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC35_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633E4u)

/** \brief 23F2, Error Information Register ${x} */
#define MTU_MC35_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F2u)

/** \brief 23F4, Error Information Register ${x} */
#define MTU_MC35_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F4u)

/** \brief 23F6, Error Information Register ${x} */
#define MTU_MC35_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F6u)

