Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 23F8, Error Information Register ${x} */
#define MTU_MC35_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F8u)

/** \brief 23FA, Error Information Register ${x} */
#define MTU_MC35_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633FAu)

/** \brief 2400, Configuration Register 0 */
#define MTU_MC36_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063400u)

/** \brief 2402, Configuration Register 1 */
#define MTU_MC36_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063402u)

/** \brief 2404, MBIST Control Register */
#define MTU_MC36_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063404u)

/** \brief 2406, Status Register */
#define MTU_MC36_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063406u)

/** \brief 2408, Range Register, single address mode */
#define MTU_MC36_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063408u)

/** \brief 240C, Revision ID Register */
#define MTU_MC36_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006340Cu)

/** \brief 240E, ECC Safety Register */
#define MTU_MC36_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006340Eu)

/** \brief 2410, Memory ECC Detection Register */
#define MTU_MC36_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063410u)

/** \brief 2412, Error Tracking Register ${x} */
#define MTU_MC36_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063412u)

/** \brief 2414, Error Tracking Register ${x} */
#define MTU_MC36_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063414u)

/** \brief 2416, Error Tracking Register ${x} */
#define MTU_MC36_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063416u)

/** \brief 2418, Error Tracking Register ${x} */
#define MTU_MC36_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063418u)

/** \brief 241A, Error Tracking Register ${x} */
#define MTU_MC36_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006341Au)

/** \brief 2460, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063460u)

/** \brief 2462, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063462u)

/** \brief 2464, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063464u)

/** \brief 2466, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063466u)

/** \brief 2468, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063468u)

/** \brief 246A, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006346Au)

/** \brief 246C, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006346Cu)

/** \brief 246E, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006346Eu)

/** \brief 2470, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063470u)

/** \brief 2472, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063472u)

/** \brief 2474, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063474u)

/** \brief 2476, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063476u)

/** \brief 2478, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063478u)

/** \brief 247A, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006347Au)

/** \brief 247C, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006347Cu)

/** \brief 247E, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006347Eu)

/** \brief 2480, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063480u)

/** \brief 2482, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063482u)

/** \brief 2484, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063484u)

/** \brief 2486, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063486u)

/** \brief 2488, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063488u)

/** \brief 248A, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006348Au)

/** \brief 248C, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006348Cu)

/** \brief 248E, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006348Eu)

/** \brief 2490, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063490u)

/** \brief 2492, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063492u)

/** \brief 2494, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063494u)

/** \brief 2496, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063496u)

/** \brief 2498, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063498u)

