Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 249A, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006349Au)

/** \brief 249C, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006349Cu)

/** \brief 249E, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006349Eu)

/** \brief 24A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A0u)

/** \brief 24A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A2u)

/** \brief 24A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A4u)

/** \brief 24A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A6u)

/** \brief 24A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A8u)

/** \brief 24AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634AAu)

/** \brief 24AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634ACu)

/** \brief 24AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634AEu)

/** \brief 24B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B0u)

/** \brief 24B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B2u)

/** \brief 24B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B4u)

/** \brief 24B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B6u)

/** \brief 24B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B8u)

/** \brief 24BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634BAu)

/** \brief 24BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634BCu)

/** \brief 24BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634BEu)

/** \brief 24C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C0u)

/** \brief 24C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C2u)

/** \brief 24C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C4u)

/** \brief 24C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C6u)

/** \brief 24C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C8u)

/** \brief 24CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634CAu)

/** \brief 24CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634CCu)

/** \brief 24CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634CEu)

/** \brief 24D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D0u)

/** \brief 24D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D2u)

/** \brief 24D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D4u)

/** \brief 24D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D6u)

/** \brief 24D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D8u)

/** \brief 24DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634DAu)

/** \brief 24DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634DCu)

/** \brief 24DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634DEu)

/** \brief 24E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634E0u)

/** \brief 24E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634E2u)

/** \brief 24E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC36_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634E4u)

/** \brief 24F2, Error Information Register ${x} */
#define MTU_MC36_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F2u)

/** \brief 24F4, Error Information Register ${x} */
#define MTU_MC36_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F4u)

/** \brief 24F6, Error Information Register ${x} */
#define MTU_MC36_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F6u)

/** \brief 24F8, Error Information Register ${x} */
#define MTU_MC36_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F8u)

/** \brief 24FA, Error Information Register ${x} */
#define MTU_MC36_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634FAu)

