Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2500, Configuration Register 0 */
#define MTU_MC37_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063500u)

/** \brief 2502, Configuration Register 1 */
#define MTU_MC37_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063502u)

/** \brief 2504, MBIST Control Register */
#define MTU_MC37_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063504u)

/** \brief 2506, Status Register */
#define MTU_MC37_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063506u)

/** \brief 2508, Range Register, single address mode */
#define MTU_MC37_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063508u)

/** \brief 250C, Revision ID Register */
#define MTU_MC37_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006350Cu)

/** \brief 250E, ECC Safety Register */
#define MTU_MC37_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006350Eu)

/** \brief 2510, Memory ECC Detection Register */
#define MTU_MC37_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063510u)

/** \brief 2512, Error Tracking Register ${x} */
#define MTU_MC37_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063512u)

/** \brief 2514, Error Tracking Register ${x} */
#define MTU_MC37_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063514u)

/** \brief 2516, Error Tracking Register ${x} */
#define MTU_MC37_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063516u)

/** \brief 2518, Error Tracking Register ${x} */
#define MTU_MC37_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063518u)

/** \brief 251A, Error Tracking Register ${x} */
#define MTU_MC37_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006351Au)

/** \brief 2560, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063560u)

/** \brief 2562, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063562u)

/** \brief 2564, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063564u)

/** \brief 2566, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063566u)

/** \brief 2568, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063568u)

/** \brief 256A, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006356Au)

/** \brief 256C, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006356Cu)

/** \brief 256E, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006356Eu)

/** \brief 2570, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063570u)

/** \brief 2572, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063572u)

/** \brief 2574, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063574u)

/** \brief 2576, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063576u)

/** \brief 2578, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063578u)

/** \brief 257A, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006357Au)

/** \brief 257C, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006357Cu)

/** \brief 257E, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006357Eu)

/** \brief 2580, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063580u)

/** \brief 2582, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063582u)

/** \brief 2584, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063584u)

/** \brief 2586, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063586u)

/** \brief 2588, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063588u)

/** \brief 258A, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006358Au)

/** \brief 258C, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006358Cu)

/** \brief 258E, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006358Eu)

/** \brief 2590, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063590u)

/** \brief 2592, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063592u)

/** \brief 2594, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063594u)

/** \brief 2596, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063596u)

/** \brief 2598, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063598u)

/** \brief 259A, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006359Au)

/** \brief 259C, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006359Cu)

/** \brief 259E, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006359Eu)

/** \brief 25A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A0u)

