Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 25A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A2u)

/** \brief 25A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A4u)

/** \brief 25A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A6u)

/** \brief 25A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A8u)

/** \brief 25AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635AAu)

/** \brief 25AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635ACu)

/** \brief 25AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635AEu)

/** \brief 25B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B0u)

/** \brief 25B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B2u)

/** \brief 25B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B4u)

/** \brief 25B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B6u)

/** \brief 25B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B8u)

/** \brief 25BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635BAu)

/** \brief 25BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635BCu)

/** \brief 25BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635BEu)

/** \brief 25C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C0u)

/** \brief 25C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C2u)

/** \brief 25C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C4u)

/** \brief 25C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C6u)

/** \brief 25C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C8u)

/** \brief 25CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635CAu)

/** \brief 25CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635CCu)

/** \brief 25CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635CEu)

/** \brief 25D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D0u)

/** \brief 25D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D2u)

/** \brief 25D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D4u)

/** \brief 25D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D6u)

/** \brief 25D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D8u)

/** \brief 25DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635DAu)

/** \brief 25DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635DCu)

/** \brief 25DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635DEu)

/** \brief 25E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635E0u)

/** \brief 25E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635E2u)

/** \brief 25E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC37_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635E4u)

/** \brief 25F2, Error Information Register ${x} */
#define MTU_MC37_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F2u)

/** \brief 25F4, Error Information Register ${x} */
#define MTU_MC37_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F4u)

/** \brief 25F6, Error Information Register ${x} */
#define MTU_MC37_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F6u)

/** \brief 25F8, Error Information Register ${x} */
#define MTU_MC37_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F8u)

/** \brief 25FA, Error Information Register ${x} */
#define MTU_MC37_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635FAu)

/** \brief 2600, Configuration Register 0 */
#define MTU_MC38_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063600u)

/** \brief 2602, Configuration Register 1 */
#define MTU_MC38_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063602u)

/** \brief 2604, MBIST Control Register */
#define MTU_MC38_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063604u)

/** \brief 2606, Status Register */
#define MTU_MC38_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063606u)

