Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2608, Range Register, single address mode */
#define MTU_MC38_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063608u)

/** \brief 260C, Revision ID Register */
#define MTU_MC38_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006360Cu)

/** \brief 260E, ECC Safety Register */
#define MTU_MC38_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006360Eu)

/** \brief 2610, Memory ECC Detection Register */
#define MTU_MC38_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063610u)

/** \brief 2612, Error Tracking Register ${x} */
#define MTU_MC38_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063612u)

/** \brief 2614, Error Tracking Register ${x} */
#define MTU_MC38_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063614u)

/** \brief 2616, Error Tracking Register ${x} */
#define MTU_MC38_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063616u)

/** \brief 2618, Error Tracking Register ${x} */
#define MTU_MC38_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063618u)

/** \brief 261A, Error Tracking Register ${x} */
#define MTU_MC38_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006361Au)

/** \brief 2660, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063660u)

/** \brief 2662, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063662u)

/** \brief 2664, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063664u)

/** \brief 2666, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063666u)

/** \brief 2668, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063668u)

/** \brief 266A, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006366Au)

/** \brief 266C, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006366Cu)

/** \brief 266E, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006366Eu)

/** \brief 2670, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063670u)

/** \brief 2672, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063672u)

/** \brief 2674, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063674u)

/** \brief 2676, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063676u)

/** \brief 2678, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063678u)

/** \brief 267A, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006367Au)

/** \brief 267C, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006367Cu)

/** \brief 267E, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006367Eu)

/** \brief 2680, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063680u)

/** \brief 2682, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063682u)

/** \brief 2684, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063684u)

/** \brief 2686, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063686u)

/** \brief 2688, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063688u)

/** \brief 268A, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006368Au)

/** \brief 268C, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006368Cu)

/** \brief 268E, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006368Eu)

/** \brief 2690, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063690u)

/** \brief 2692, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063692u)

/** \brief 2694, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063694u)

/** \brief 2696, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063696u)

/** \brief 2698, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063698u)

/** \brief 269A, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006369Au)

/** \brief 269C, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006369Cu)

/** \brief 269E, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006369Eu)

/** \brief 26A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A0u)

/** \brief 26A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A2u)

