Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 26A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A4u)

/** \brief 26A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A6u)

/** \brief 26A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A8u)

/** \brief 26AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636AAu)

/** \brief 26AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636ACu)

/** \brief 26AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636AEu)

/** \brief 26B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B0u)

/** \brief 26B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B2u)

/** \brief 26B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B4u)

/** \brief 26B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B6u)

/** \brief 26B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B8u)

/** \brief 26BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636BAu)

/** \brief 26BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636BCu)

/** \brief 26BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636BEu)

/** \brief 26C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C0u)

/** \brief 26C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C2u)

/** \brief 26C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C4u)

/** \brief 26C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C6u)

/** \brief 26C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C8u)

/** \brief 26CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636CAu)

/** \brief 26CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636CCu)

/** \brief 26CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636CEu)

/** \brief 26D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D0u)

/** \brief 26D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D2u)

/** \brief 26D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D4u)

/** \brief 26D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D6u)

/** \brief 26D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D8u)

/** \brief 26DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636DAu)

/** \brief 26DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636DCu)

/** \brief 26DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636DEu)

/** \brief 26E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636E0u)

/** \brief 26E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636E2u)

/** \brief 26E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC38_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636E4u)

/** \brief 26F2, Error Information Register ${x} */
#define MTU_MC38_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F2u)

/** \brief 26F4, Error Information Register ${x} */
#define MTU_MC38_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F4u)

/** \brief 26F6, Error Information Register ${x} */
#define MTU_MC38_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F6u)

/** \brief 26F8, Error Information Register ${x} */
#define MTU_MC38_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F8u)

/** \brief 26FA, Error Information Register ${x} */
#define MTU_MC38_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636FAu)

/** \brief 2700, Configuration Register 0 */
#define MTU_MC39_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063700u)

/** \brief 2702, Configuration Register 1 */
#define MTU_MC39_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063702u)

/** \brief 2704, MBIST Control Register */
#define MTU_MC39_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063704u)

/** \brief 2706, Status Register */
#define MTU_MC39_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063706u)

/** \brief 2708, Range Register, single address mode */
#define MTU_MC39_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063708u)

