Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 270C, Revision ID Register */
#define MTU_MC39_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006370Cu)

/** \brief 270E, ECC Safety Register */
#define MTU_MC39_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006370Eu)

/** \brief 2710, Memory ECC Detection Register */
#define MTU_MC39_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063710u)

/** \brief 2712, Error Tracking Register ${x} */
#define MTU_MC39_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063712u)

/** \brief 2714, Error Tracking Register ${x} */
#define MTU_MC39_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063714u)

/** \brief 2716, Error Tracking Register ${x} */
#define MTU_MC39_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063716u)

/** \brief 2718, Error Tracking Register ${x} */
#define MTU_MC39_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063718u)

/** \brief 271A, Error Tracking Register ${x} */
#define MTU_MC39_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006371Au)

/** \brief 2760, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063760u)

/** \brief 2762, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063762u)

/** \brief 2764, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063764u)

/** \brief 2766, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063766u)

/** \brief 2768, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063768u)

/** \brief 276A, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006376Au)

/** \brief 276C, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006376Cu)

/** \brief 276E, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006376Eu)

/** \brief 2770, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063770u)

/** \brief 2772, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063772u)

/** \brief 2774, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063774u)

/** \brief 2776, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063776u)

/** \brief 2778, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063778u)

/** \brief 277A, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006377Au)

/** \brief 277C, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006377Cu)

/** \brief 277E, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006377Eu)

/** \brief 2780, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063780u)

/** \brief 2782, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063782u)

/** \brief 2784, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063784u)

/** \brief 2786, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063786u)

/** \brief 2788, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063788u)

/** \brief 278A, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006378Au)

/** \brief 278C, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006378Cu)

/** \brief 278E, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006378Eu)

/** \brief 2790, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063790u)

/** \brief 2792, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063792u)

/** \brief 2794, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063794u)

/** \brief 2796, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063796u)

/** \brief 2798, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063798u)

/** \brief 279A, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006379Au)

/** \brief 279C, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006379Cu)

/** \brief 279E, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006379Eu)

/** \brief 27A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A0u)

/** \brief 27A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A2u)

/** \brief 27A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A4u)

/** \brief 27A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A6u)

/** \brief 27A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A8u)

/** \brief 27AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637AAu)

