Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 27AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637ACu)

/** \brief 27AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637AEu)

/** \brief 27B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B0u)

/** \brief 27B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B2u)

/** \brief 27B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B4u)

/** \brief 27B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B6u)

/** \brief 27B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B8u)

/** \brief 27BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637BAu)

/** \brief 27BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637BCu)

/** \brief 27BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637BEu)

/** \brief 27C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C0u)

/** \brief 27C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C2u)

/** \brief 27C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C4u)

/** \brief 27C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C6u)

/** \brief 27C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C8u)

/** \brief 27CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637CAu)

/** \brief 27CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637CCu)

/** \brief 27CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637CEu)

/** \brief 27D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D0u)

/** \brief 27D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D2u)

/** \brief 27D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D4u)

/** \brief 27D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D6u)

/** \brief 27D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D8u)

/** \brief 27DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637DAu)

/** \brief 27DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637DCu)

/** \brief 27DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637DEu)

/** \brief 27E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637E0u)

/** \brief 27E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637E2u)

/** \brief 27E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC39_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637E4u)

/** \brief 27F2, Error Information Register ${x} */
#define MTU_MC39_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F2u)

/** \brief 27F4, Error Information Register ${x} */
#define MTU_MC39_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F4u)

/** \brief 27F6, Error Information Register ${x} */
#define MTU_MC39_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F6u)

/** \brief 27F8, Error Information Register ${x} */
#define MTU_MC39_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F8u)

/** \brief 27FA, Error Information Register ${x} */
#define MTU_MC39_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637FAu)

/** \brief 2800, Configuration Register 0 */
#define MTU_MC40_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063800u)

/** \brief 2802, Configuration Register 1 */
#define MTU_MC40_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063802u)

/** \brief 2804, MBIST Control Register */
#define MTU_MC40_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063804u)

/** \brief 2806, Status Register */
#define MTU_MC40_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063806u)

/** \brief 2808, Range Register, single address mode */
#define MTU_MC40_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063808u)

/** \brief 280C, Revision ID Register */
#define MTU_MC40_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006380Cu)

/** \brief 280E, ECC Safety Register */
#define MTU_MC40_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006380Eu)

/** \brief 2810, Memory ECC Detection Register */
#define MTU_MC40_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063810u)

/** \brief 2812, Error Tracking Register ${x} */
#define MTU_MC40_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063812u)

/** \brief 2814, Error Tracking Register ${x} */
#define MTU_MC40_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063814u)

/** \brief 2816, Error Tracking Register ${x} */
#define MTU_MC40_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063816u)

/** \brief 2818, Error Tracking Register ${x} */
#define MTU_MC40_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063818u)

/** \brief 281A, Error Tracking Register ${x} */
#define MTU_MC40_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006381Au)


/** \brief 2860, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063860u)

/** \brief 2862, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063862u)

/** \brief 2864, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063864u)

