Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2866, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063866u)

/** \brief 2868, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063868u)

/** \brief 286A, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006386Au)

/** \brief 286C, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006386Cu)

/** \brief 286E, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006386Eu)

/** \brief 2870, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063870u)

/** \brief 2872, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063872u)

/** \brief 2874, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063874u)

/** \brief 2876, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063876u)

/** \brief 2878, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063878u)

/** \brief 287A, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006387Au)

/** \brief 287C, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006387Cu)

/** \brief 287E, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006387Eu)

/** \brief 2880, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063880u)

/** \brief 2882, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063882u)

/** \brief 2884, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063884u)

/** \brief 2886, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063886u)

/** \brief 2888, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063888u)

/** \brief 288A, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006388Au)

/** \brief 288C, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006388Cu)

/** \brief 288E, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006388Eu)

/** \brief 2890, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063890u)

/** \brief 2892, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063892u)

/** \brief 2894, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063894u)

/** \brief 2896, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063896u)

/** \brief 2898, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063898u)

/** \brief 289A, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006389Au)

/** \brief 289C, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006389Cu)

/** \brief 289E, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006389Eu)

/** \brief 28A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A0u)

/** \brief 28A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A2u)

/** \brief 28A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A4u)

/** \brief 28A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A6u)

/** \brief 28A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A8u)

/** \brief 28AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638AAu)

/** \brief 28AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638ACu)

/** \brief 28AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638AEu)

/** \brief 28B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B0u)

/** \brief 28B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B2u)

/** \brief 28B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B4u)

/** \brief 28B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B6u)

/** \brief 28B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B8u)

/** \brief 28BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638BAu)

/** \brief 28BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638BCu)

