Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 28BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638BEu)

/** \brief 28C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C0u)

/** \brief 28C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C2u)

/** \brief 28C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C4u)

/** \brief 28C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C6u)

/** \brief 28C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C8u)

/** \brief 28CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638CAu)

/** \brief 28CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638CCu)

/** \brief 28CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638CEu)

/** \brief 28D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D0u)

/** \brief 28D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D2u)

/** \brief 28D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D4u)

/** \brief 28D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D6u)

/** \brief 28D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D8u)

/** \brief 28DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638DAu)

/** \brief 28DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638DCu)

/** \brief 28DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638DEu)

/** \brief 28E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638E0u)

/** \brief 28E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638E2u)

/** \brief 28E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC40_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638E4u)

/** \brief 28F2, Error Information Register ${x} */
#define MTU_MC40_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F2u)

/** \brief 28F4, Error Information Register ${x} */
#define MTU_MC40_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F4u)

/** \brief 28F6, Error Information Register ${x} */
#define MTU_MC40_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F6u)

/** \brief 28F8, Error Information Register ${x} */
#define MTU_MC40_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F8u)

/** \brief 28FA, Error Information Register ${x} */
#define MTU_MC40_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638FAu)

/** \brief 2900, Configuration Register 0 */
#define MTU_MC41_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063900u)

/** \brief 2902, Configuration Register 1 */
#define MTU_MC41_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063902u)

/** \brief 2904, MBIST Control Register */
#define MTU_MC41_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063904u)

/** \brief 2906, Status Register */
#define MTU_MC41_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063906u)

/** \brief 2908, Range Register, single address mode */
#define MTU_MC41_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063908u)

/** \brief 290C, Revision ID Register */
#define MTU_MC41_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006390Cu)

/** \brief 290E, ECC Safety Register */
#define MTU_MC41_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006390Eu)

/** \brief 2910, Memory ECC Detection Register */
#define MTU_MC41_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063910u)

/** \brief 2912, Error Tracking Register ${x} */
#define MTU_MC41_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063912u)

/** \brief 2914, Error Tracking Register ${x} */
#define MTU_MC41_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063914u)

/** \brief 2916, Error Tracking Register ${x} */
#define MTU_MC41_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063916u)

/** \brief 2918, Error Tracking Register ${x} */
#define MTU_MC41_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063918u)

/** \brief 291A, Error Tracking Register ${x} */
#define MTU_MC41_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006391Au)

/** \brief 2960, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063960u)

/** \brief 2962, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063962u)

/** \brief 2964, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063964u)

/** \brief 2966, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063966u)

/** \brief 2968, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063968u)

