Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 296A, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006396Au)

/** \brief 296C, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006396Cu)

/** \brief 296E, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006396Eu)

/** \brief 2970, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063970u)

/** \brief 2972, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063972u)

/** \brief 2974, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063974u)

/** \brief 2976, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063976u)

/** \brief 2978, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063978u)

/** \brief 297A, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006397Au)

/** \brief 297C, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006397Cu)

/** \brief 297E, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006397Eu)

/** \brief 2980, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063980u)

/** \brief 2982, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063982u)

/** \brief 2984, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063984u)

/** \brief 2986, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063986u)

/** \brief 2988, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063988u)

/** \brief 298A, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006398Au)

/** \brief 298C, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006398Cu)

/** \brief 298E, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006398Eu)

/** \brief 2990, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063990u)

/** \brief 2992, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063992u)

/** \brief 2994, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063994u)

/** \brief 2996, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063996u)

/** \brief 2998, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063998u)

/** \brief 299A, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006399Au)

/** \brief 299C, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006399Cu)

/** \brief 299E, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006399Eu)

/** \brief 29A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A0u)

/** \brief 29A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A2u)

/** \brief 29A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A4u)

/** \brief 29A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A6u)

/** \brief 29A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A8u)

/** \brief 29AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639AAu)

/** \brief 29AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639ACu)

/** \brief 29AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639AEu)

/** \brief 29B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B0u)

/** \brief 29B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B2u)

/** \brief 29B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B4u)

/** \brief 29B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B6u)

/** \brief 29B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B8u)

/** \brief 29BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639BAu)

/** \brief 29BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639BCu)

/** \brief 29BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639BEu)

/** \brief 29C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C0u)

/** \brief 29C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C2u)

/** \brief 29C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C4u)

