Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 29C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C6u)

/** \brief 29C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C8u)

/** \brief 29CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639CAu)

/** \brief 29CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639CCu)

/** \brief 29CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639CEu)

/** \brief 29D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D0u)

/** \brief 29D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D2u)

/** \brief 29D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D4u)

/** \brief 29D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D6u)

/** \brief 29D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D8u)

/** \brief 29DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639DAu)

/** \brief 29DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639DCu)

/** \brief 29DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639DEu)

/** \brief 29E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639E0u)

/** \brief 29E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639E2u)

/** \brief 29E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC41_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639E4u)

/** \brief 29F2, Error Information Register ${x} */
#define MTU_MC41_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F2u)

/** \brief 29F4, Error Information Register ${x} */
#define MTU_MC41_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F4u)

/** \brief 29F6, Error Information Register ${x} */
#define MTU_MC41_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F6u)

/** \brief 29F8, Error Information Register ${x} */
#define MTU_MC41_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F8u)

/** \brief 29FA, Error Information Register ${x} */
#define MTU_MC41_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639FAu)

/** \brief 2A00, Configuration Register 0 */
#define MTU_MC42_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063A00u)

/** \brief 2A02, Configuration Register 1 */
#define MTU_MC42_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063A02u)

/** \brief 2A04, MBIST Control Register */
#define MTU_MC42_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063A04u)

/** \brief 2A06, Status Register */
#define MTU_MC42_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063A06u)

/** \brief 2A08, Range Register, single address mode */
#define MTU_MC42_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063A08u)

/** \brief 2A0C, Revision ID Register */
#define MTU_MC42_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063A0Cu)

/** \brief 2A0E, ECC Safety Register */
#define MTU_MC42_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063A0Eu)

/** \brief 2A10, Memory ECC Detection Register */
#define MTU_MC42_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063A10u)

/** \brief 2A12, Error Tracking Register ${x} */
#define MTU_MC42_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A12u)

/** \brief 2A14, Error Tracking Register ${x} */
#define MTU_MC42_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A14u)

/** \brief 2A16, Error Tracking Register ${x} */
#define MTU_MC42_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A16u)

/** \brief 2A18, Error Tracking Register ${x} */
#define MTU_MC42_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A18u)

/** \brief 2A1A, Error Tracking Register ${x} */
#define MTU_MC42_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A1Au)

/** \brief 2A60, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A60u)

/** \brief 2A62, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A62u)

/** \brief 2A64, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A64u)

/** \brief 2A66, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A66u)

/** \brief 2A68, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A68u)

/** \brief 2A6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A6Au)

/** \brief 2A6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A6Cu)

/** \brief 2A6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A6Eu)

/** \brief 2A70, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A70u)

/** \brief 2A72, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A72u)

/** \brief 2A74, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A74u)

/** \brief 2A76, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A76u)

/** \brief 2A78, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A78u)

