Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2A7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A7Au)

/** \brief 2A7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A7Cu)

/** \brief 2A7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A7Eu)

/** \brief 2A80, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A80u)

/** \brief 2A82, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A82u)

/** \brief 2A84, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A84u)

/** \brief 2A86, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A86u)

/** \brief 2A88, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A88u)

/** \brief 2A8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A8Au)

/** \brief 2A8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A8Cu)

/** \brief 2A8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A8Eu)

/** \brief 2A90, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A90u)

/** \brief 2A92, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A92u)

/** \brief 2A94, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A94u)

/** \brief 2A96, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A96u)

/** \brief 2A98, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A98u)

/** \brief 2A9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A9Au)

/** \brief 2A9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A9Cu)

/** \brief 2A9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A9Eu)

/** \brief 2AA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA0u)

/** \brief 2AA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA2u)

/** \brief 2AA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA4u)

/** \brief 2AA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA6u)

/** \brief 2AA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA8u)

/** \brief 2AAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AAAu)

/** \brief 2AAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AACu)

/** \brief 2AAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AAEu)

/** \brief 2AB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB0u)

/** \brief 2AB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB2u)

/** \brief 2AB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB4u)

/** \brief 2AB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB6u)

/** \brief 2AB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB8u)

/** \brief 2ABA, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ABAu)

/** \brief 2ABC, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ABCu)

/** \brief 2ABE, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ABEu)

/** \brief 2AC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC0u)

/** \brief 2AC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC2u)

/** \brief 2AC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC4u)

/** \brief 2AC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC6u)

/** \brief 2AC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC8u)

/** \brief 2ACA, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ACAu)

/** \brief 2ACC, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ACCu)

/** \brief 2ACE, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ACEu)

/** \brief 2AD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD0u)

