Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2AD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD2u)

/** \brief 2AD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD4u)

/** \brief 2AD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD6u)

/** \brief 2AD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD8u)

/** \brief 2ADA, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ADAu)

/** \brief 2ADC, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ADCu)

/** \brief 2ADE, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ADEu)

/** \brief 2AE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AE0u)

/** \brief 2AE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AE2u)

/** \brief 2AE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC42_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AE4u)

/** \brief 2AF2, Error Information Register ${x} */
#define MTU_MC42_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF2u)

/** \brief 2AF4, Error Information Register ${x} */
#define MTU_MC42_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF4u)

/** \brief 2AF6, Error Information Register ${x} */
#define MTU_MC42_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF6u)

/** \brief 2AF8, Error Information Register ${x} */
#define MTU_MC42_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF8u)

/** \brief 2AFA, Error Information Register ${x} */
#define MTU_MC42_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AFAu)

/** \brief 2B00, Configuration Register 0 */
#define MTU_MC43_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063B00u)

/** \brief 2B02, Configuration Register 1 */
#define MTU_MC43_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063B02u)

/** \brief 2B04, MBIST Control Register */
#define MTU_MC43_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063B04u)

/** \brief 2B06, Status Register */
#define MTU_MC43_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063B06u)

/** \brief 2B08, Range Register, single address mode */
#define MTU_MC43_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063B08u)

/** \brief 2B0C, Revision ID Register */
#define MTU_MC43_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063B0Cu)

/** \brief 2B0E, ECC Safety Register */
#define MTU_MC43_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063B0Eu)

/** \brief 2B10, Memory ECC Detection Register */
#define MTU_MC43_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063B10u)

/** \brief 2B12, Error Tracking Register ${x} */
#define MTU_MC43_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B12u)

/** \brief 2B14, Error Tracking Register ${x} */
#define MTU_MC43_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B14u)

/** \brief 2B16, Error Tracking Register ${x} */
#define MTU_MC43_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B16u)

/** \brief 2B18, Error Tracking Register ${x} */
#define MTU_MC43_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B18u)

/** \brief 2B1A, Error Tracking Register ${x} */
#define MTU_MC43_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B1Au)


/** \brief 2B60, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B60u)

/** \brief 2B62, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B62u)

/** \brief 2B64, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B64u)

/** \brief 2B66, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B66u)

/** \brief 2B68, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B68u)

/** \brief 2B6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B6Au)

/** \brief 2B6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B6Cu)

/** \brief 2B6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B6Eu)

/** \brief 2B70, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B70u)

/** \brief 2B72, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B72u)

/** \brief 2B74, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B74u)

/** \brief 2B76, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B76u)

/** \brief 2B78, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B78u)

/** \brief 2B7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B7Au)

/** \brief 2B7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B7Cu)

/** \brief 2B7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B7Eu)

/** \brief 2B80, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B80u)

