Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2B82, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B82u)

/** \brief 2B84, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B84u)

/** \brief 2B86, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B86u)

/** \brief 2B88, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B88u)

/** \brief 2B8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B8Au)

/** \brief 2B8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B8Cu)

/** \brief 2B8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B8Eu)

/** \brief 2B90, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B90u)

/** \brief 2B92, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B92u)

/** \brief 2B94, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B94u)

/** \brief 2B96, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B96u)

/** \brief 2B98, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B98u)

/** \brief 2B9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B9Au)

/** \brief 2B9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B9Cu)

/** \brief 2B9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B9Eu)

/** \brief 2BA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA0u)

/** \brief 2BA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA2u)

/** \brief 2BA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA4u)

/** \brief 2BA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA6u)

/** \brief 2BA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BA8u)

/** \brief 2BAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BAAu)

/** \brief 2BAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BACu)

/** \brief 2BAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BAEu)

/** \brief 2BB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB0u)

/** \brief 2BB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB2u)

/** \brief 2BB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB4u)

/** \brief 2BB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB6u)

/** \brief 2BB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BB8u)

/** \brief 2BBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BBAu)

/** \brief 2BBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BBCu)

/** \brief 2BBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BBEu)

/** \brief 2BC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC0u)

/** \brief 2BC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC2u)

/** \brief 2BC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC4u)

/** \brief 2BC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC6u)

/** \brief 2BC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BC8u)

/** \brief 2BCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BCAu)

/** \brief 2BCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BCCu)

/** \brief 2BCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BCEu)

/** \brief 2BD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD0u)

/** \brief 2BD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD2u)

/** \brief 2BD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD4u)

/** \brief 2BD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD6u)

