Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2BD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD8u)

/** \brief 2BDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BDAu)

/** \brief 2BDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BDCu)

/** \brief 2BDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BDEu)

/** \brief 2BE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BE0u)

/** \brief 2BE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BE2u)

/** \brief 2BE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC43_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BE4u)

/** \brief 2BF2, Error Information Register ${x} */
#define MTU_MC43_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF2u)

/** \brief 2BF4, Error Information Register ${x} */
#define MTU_MC43_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF4u)

/** \brief 2BF6, Error Information Register ${x} */
#define MTU_MC43_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF6u)

/** \brief 2BF8, Error Information Register ${x} */
#define MTU_MC43_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF8u)

/** \brief 2BFA, Error Information Register ${x} */
#define MTU_MC43_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BFAu)

/** \brief 2C00, Configuration Register 0 */
#define MTU_MC44_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063C00u)

/** \brief 2C02, Configuration Register 1 */
#define MTU_MC44_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063C02u)

/** \brief 2C04, MBIST Control Register */
#define MTU_MC44_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063C04u)

/** \brief 2C06, Status Register */
#define MTU_MC44_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063C06u)

/** \brief 2C08, Range Register, single address mode */
#define MTU_MC44_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063C08u)

/** \brief 2C0C, Revision ID Register */
#define MTU_MC44_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063C0Cu)

/** \brief 2C0E, ECC Safety Register */
#define MTU_MC44_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063C0Eu)

/** \brief 2C10, Memory ECC Detection Register */
#define MTU_MC44_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063C10u)

/** \brief 2C12, Error Tracking Register ${x} */
#define MTU_MC44_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C12u)

/** \brief 2C14, Error Tracking Register ${x} */
#define MTU_MC44_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C14u)

/** \brief 2C16, Error Tracking Register ${x} */
#define MTU_MC44_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C16u)

/** \brief 2C18, Error Tracking Register ${x} */
#define MTU_MC44_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C18u)

/** \brief 2C1A, Error Tracking Register ${x} */
#define MTU_MC44_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C1Au)


/** \brief 2C60, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C60u)

/** \brief 2C62, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C62u)

/** \brief 2C64, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C64u)

/** \brief 2C66, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C66u)

/** \brief 2C68, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C68u)

/** \brief 2C6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C6Au)

/** \brief 2C6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C6Cu)

/** \brief 2C6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C6Eu)

/** \brief 2C70, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C70u)

/** \brief 2C72, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C72u)

/** \brief 2C74, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C74u)

/** \brief 2C76, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C76u)

/** \brief 2C78, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C78u)

/** \brief 2C7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C7Au)

/** \brief 2C7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C7Cu)

/** \brief 2C7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C7Eu)

/** \brief 2C80, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C80u)

/** \brief 2C82, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C82u)

