Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2C84, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C84u)

/** \brief 2C86, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C86u)

/** \brief 2C88, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C88u)

/** \brief 2C8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C8Au)

/** \brief 2C8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C8Cu)

/** \brief 2C8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C8Eu)

/** \brief 2C90, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C90u)

/** \brief 2C92, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C92u)

/** \brief 2C94, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C94u)

/** \brief 2C96, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C96u)

/** \brief 2C98, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C98u)

/** \brief 2C9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C9Au)

/** \brief 2C9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C9Cu)

/** \brief 2C9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C9Eu)

/** \brief 2CA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA0u)

/** \brief 2CA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA2u)

/** \brief 2CA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA4u)

/** \brief 2CA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA6u)

/** \brief 2CA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA8u)

/** \brief 2CAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CAAu)

/** \brief 2CAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CACu)

/** \brief 2CAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CAEu)

/** \brief 2CB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB0u)

/** \brief 2CB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB2u)

/** \brief 2CB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB4u)

/** \brief 2CB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB6u)

/** \brief 2CB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB8u)

/** \brief 2CBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CBAu)

/** \brief 2CBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CBCu)

/** \brief 2CBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CBEu)

/** \brief 2CC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC0u)

/** \brief 2CC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC2u)

/** \brief 2CC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC4u)

/** \brief 2CC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC6u)

/** \brief 2CC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC8u)

/** \brief 2CCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CCAu)

/** \brief 2CCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CCCu)

/** \brief 2CCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CCEu)

/** \brief 2CD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD0u)

/** \brief 2CD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD2u)

/** \brief 2CD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD4u)

/** \brief 2CD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD6u)

/** \brief 2CD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD8u)

/** \brief 2CDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CDAu)

