Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2CDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CDCu)

/** \brief 2CDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CDEu)

/** \brief 2CE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CE0u)

/** \brief 2CE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CE2u)

/** \brief 2CE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC44_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CE4u)

/** \brief 2CF2, Error Information Register ${x} */
#define MTU_MC44_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF2u)

/** \brief 2CF4, Error Information Register ${x} */
#define MTU_MC44_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF4u)

/** \brief 2CF6, Error Information Register ${x} */
#define MTU_MC44_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF6u)

/** \brief 2CF8, Error Information Register ${x} */
#define MTU_MC44_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF8u)

/** \brief 2CFA, Error Information Register ${x} */
#define MTU_MC44_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CFAu)

/** \brief 2D00, Configuration Register 0 */
#define MTU_MC45_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063D00u)

/** \brief 2D02, Configuration Register 1 */
#define MTU_MC45_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063D02u)

/** \brief 2D04, MBIST Control Register */
#define MTU_MC45_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063D04u)

/** \brief 2D06, Status Register */
#define MTU_MC45_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063D06u)

/** \brief 2D08, Range Register, single address mode */
#define MTU_MC45_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063D08u)

/** \brief 2D0C, Revision ID Register */
#define MTU_MC45_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063D0Cu)

/** \brief 2D0E, ECC Safety Register */
#define MTU_MC45_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063D0Eu)

/** \brief 2D10, Memory ECC Detection Register */
#define MTU_MC45_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063D10u)

/** \brief 2D12, Error Tracking Register ${x} */
#define MTU_MC45_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D12u)

/** \brief 2D14, Error Tracking Register ${x} */
#define MTU_MC45_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D14u)

/** \brief 2D16, Error Tracking Register ${x} */
#define MTU_MC45_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D16u)

/** \brief 2D18, Error Tracking Register ${x} */
#define MTU_MC45_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D18u)

/** \brief 2D1A, Error Tracking Register ${x} */
#define MTU_MC45_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D1Au)


/** \brief 2D60, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D60u)

/** \brief 2D62, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D62u)

/** \brief 2D64, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D64u)

/** \brief 2D66, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D66u)

/** \brief 2D68, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D68u)

/** \brief 2D6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D6Au)

/** \brief 2D6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D6Cu)

/** \brief 2D6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D6Eu)

/** \brief 2D70, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D70u)

/** \brief 2D72, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D72u)

/** \brief 2D74, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D74u)

/** \brief 2D76, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D76u)

/** \brief 2D78, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D78u)

/** \brief 2D7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D7Au)

/** \brief 2D7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D7Cu)

/** \brief 2D7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D7Eu)

/** \brief 2D80, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D80u)

/** \brief 2D82, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D82u)

/** \brief 2D84, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D84u)

/** \brief 2D86, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D86u)

/** \brief 2D88, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D88u)

/** \brief 2D8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D8Au)

