Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2D8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D8Cu)

/** \brief 2D8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D8Eu)

/** \brief 2D90, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D90u)

/** \brief 2D92, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D92u)

/** \brief 2D94, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D94u)

/** \brief 2D96, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D96u)

/** \brief 2D98, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D98u)

/** \brief 2D9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D9Au)

/** \brief 2D9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D9Cu)

/** \brief 2D9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D9Eu)

/** \brief 2DA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA0u)

/** \brief 2DA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA2u)

/** \brief 2DA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA4u)

/** \brief 2DA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA6u)

/** \brief 2DA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA8u)

/** \brief 2DAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DAAu)

/** \brief 2DAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DACu)

/** \brief 2DAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DAEu)

/** \brief 2DB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB0u)

/** \brief 2DB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB2u)

/** \brief 2DB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB4u)

/** \brief 2DB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB6u)

/** \brief 2DB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB8u)

/** \brief 2DBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DBAu)

/** \brief 2DBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DBCu)

/** \brief 2DBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DBEu)

/** \brief 2DC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC0u)

/** \brief 2DC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC2u)

/** \brief 2DC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC4u)

/** \brief 2DC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC6u)

/** \brief 2DC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC8u)

/** \brief 2DCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DCAu)

/** \brief 2DCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DCCu)

/** \brief 2DCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DCEu)

/** \brief 2DD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD0u)

/** \brief 2DD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD2u)

/** \brief 2DD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD4u)

/** \brief 2DD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD6u)

/** \brief 2DD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD8u)

/** \brief 2DDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DDAu)

/** \brief 2DDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DDCu)

/** \brief 2DDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DDEu)

