Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2DE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DE0u)

/** \brief 2DE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DE2u)

/** \brief 2DE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC45_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DE4u)

/** \brief 2DF2, Error Information Register ${x} */
#define MTU_MC45_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF2u)

/** \brief 2DF4, Error Information Register ${x} */
#define MTU_MC45_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF4u)

/** \brief 2DF6, Error Information Register ${x} */
#define MTU_MC45_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF6u)

/** \brief 2DF8, Error Information Register ${x} */
#define MTU_MC45_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF8u)

/** \brief 2DFA, Error Information Register ${x} */
#define MTU_MC45_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DFAu)

/** \brief 2E00, Configuration Register 0 */
#define MTU_MC46_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063E00u)

/** \brief 2E02, Configuration Register 1 */
#define MTU_MC46_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063E02u)

/** \brief 2E04, MBIST Control Register */
#define MTU_MC46_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063E04u)

/** \brief 2E06, Status Register */
#define MTU_MC46_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063E06u)

/** \brief 2E08, Range Register, single address mode */
#define MTU_MC46_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063E08u)

/** \brief 2E0C, Revision ID Register */
#define MTU_MC46_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063E0Cu)

/** \brief 2E0E, ECC Safety Register */
#define MTU_MC46_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063E0Eu)

/** \brief 2E10, Memory ECC Detection Register */
#define MTU_MC46_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063E10u)

/** \brief 2E12, Error Tracking Register ${x} */
#define MTU_MC46_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E12u)

/** \brief 2E14, Error Tracking Register ${x} */
#define MTU_MC46_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E14u)

/** \brief 2E16, Error Tracking Register ${x} */
#define MTU_MC46_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E16u)

/** \brief 2E18, Error Tracking Register ${x} */
#define MTU_MC46_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E18u)

/** \brief 2E1A, Error Tracking Register ${x} */
#define MTU_MC46_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E1Au)


/** \brief 2E60, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E60u)

/** \brief 2E62, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E62u)

/** \brief 2E64, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E64u)

/** \brief 2E66, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E66u)

/** \brief 2E68, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E68u)

/** \brief 2E6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E6Au)

/** \brief 2E6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E6Cu)

/** \brief 2E6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E6Eu)

/** \brief 2E70, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E70u)

/** \brief 2E72, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E72u)

/** \brief 2E74, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E74u)

/** \brief 2E76, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E76u)

/** \brief 2E78, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E78u)

/** \brief 2E7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E7Au)

/** \brief 2E7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E7Cu)

/** \brief 2E7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E7Eu)

/** \brief 2E80, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E80u)

/** \brief 2E82, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E82u)

/** \brief 2E84, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E84u)

/** \brief 2E86, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E86u)

/** \brief 2E88, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E88u)

/** \brief 2E8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E8Au)

/** \brief 2E8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E8Cu)

