Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2E8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E8Eu)

/** \brief 2E90, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E90u)

/** \brief 2E92, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E92u)

/** \brief 2E94, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E94u)

/** \brief 2E96, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E96u)

/** \brief 2E98, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E98u)

/** \brief 2E9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E9Au)

/** \brief 2E9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E9Cu)

/** \brief 2E9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E9Eu)

/** \brief 2EA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA0u)

/** \brief 2EA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA2u)

/** \brief 2EA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA4u)

/** \brief 2EA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA6u)

/** \brief 2EA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA8u)

/** \brief 2EAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EAAu)

/** \brief 2EAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EACu)

/** \brief 2EAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EAEu)

/** \brief 2EB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB0u)

/** \brief 2EB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB2u)

/** \brief 2EB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB4u)

/** \brief 2EB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB6u)

/** \brief 2EB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB8u)

/** \brief 2EBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EBAu)

/** \brief 2EBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EBCu)

/** \brief 2EBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EBEu)

/** \brief 2EC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC0u)

/** \brief 2EC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC2u)

/** \brief 2EC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC4u)

/** \brief 2EC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC6u)

/** \brief 2EC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC8u)

/** \brief 2ECA, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ECAu)

/** \brief 2ECC, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ECCu)

/** \brief 2ECE, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ECEu)

/** \brief 2ED0, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED0u)

/** \brief 2ED2, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED2u)

/** \brief 2ED4, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED4u)

/** \brief 2ED6, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED6u)

/** \brief 2ED8, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED8u)

/** \brief 2EDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EDAu)

/** \brief 2EDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EDCu)

/** \brief 2EDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EDEu)

/** \brief 2EE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EE0u)

/** \brief 2EE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EE2u)

/** \brief 2EE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC46_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EE4u)

