Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2EF2, Error Information Register ${x} */
#define MTU_MC46_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF2u)

/** \brief 2EF4, Error Information Register ${x} */
#define MTU_MC46_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF4u)

/** \brief 2EF6, Error Information Register ${x} */
#define MTU_MC46_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF6u)

/** \brief 2EF8, Error Information Register ${x} */
#define MTU_MC46_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF8u)

/** \brief 2EFA, Error Information Register ${x} */
#define MTU_MC46_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EFAu)

/** \brief 2F00, Configuration Register 0 */
#define MTU_MC47_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063F00u)

/** \brief 2F02, Configuration Register 1 */
#define MTU_MC47_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063F02u)

/** \brief 2F04, MBIST Control Register */
#define MTU_MC47_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063F04u)

/** \brief 2F06, Status Register */
#define MTU_MC47_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063F06u)

/** \brief 2F08, Range Register, single address mode */
#define MTU_MC47_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063F08u)

/** \brief 2F0C, Revision ID Register */
#define MTU_MC47_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063F0Cu)

/** \brief 2F0E, ECC Safety Register */
#define MTU_MC47_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063F0Eu)

/** \brief 2F10, Memory ECC Detection Register */
#define MTU_MC47_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063F10u)

/** \brief 2F12, Error Tracking Register ${x} */
#define MTU_MC47_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F12u)

/** \brief 2F14, Error Tracking Register ${x} */
#define MTU_MC47_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F14u)

/** \brief 2F16, Error Tracking Register ${x} */
#define MTU_MC47_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F16u)

/** \brief 2F18, Error Tracking Register ${x} */
#define MTU_MC47_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F18u)

/** \brief 2F1A, Error Tracking Register ${x} */
#define MTU_MC47_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F1Au)


/** \brief 2F60, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F60u)

/** \brief 2F62, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F62u)

/** \brief 2F64, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F64u)

/** \brief 2F66, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F66u)

/** \brief 2F68, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F68u)

/** \brief 2F6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F6Au)

/** \brief 2F6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F6Cu)

/** \brief 2F6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F6Eu)

/** \brief 2F70, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F70u)

/** \brief 2F72, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F72u)

/** \brief 2F74, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F74u)

/** \brief 2F76, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F76u)

/** \brief 2F78, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F78u)

/** \brief 2F7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F7Au)

/** \brief 2F7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F7Cu)

/** \brief 2F7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F7Eu)

/** \brief 2F80, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F80u)

/** \brief 2F82, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F82u)

/** \brief 2F84, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F84u)

/** \brief 2F86, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F86u)

/** \brief 2F88, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F88u)

/** \brief 2F8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F8Au)

/** \brief 2F8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F8Cu)

/** \brief 2F8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F8Eu)

/** \brief 2F90, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F90u)

/** \brief 2F92, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F92u)

/** \brief 2F94, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F94u)

