Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2F96, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F96u)

/** \brief 2F98, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F98u)

/** \brief 2F9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F9Au)

/** \brief 2F9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F9Cu)

/** \brief 2F9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F9Eu)

/** \brief 2FA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA0u)

/** \brief 2FA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA2u)

/** \brief 2FA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA4u)

/** \brief 2FA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA6u)

/** \brief 2FA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA8u)

/** \brief 2FAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FAAu)

/** \brief 2FAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FACu)

/** \brief 2FAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FAEu)

/** \brief 2FB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB0u)

/** \brief 2FB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB2u)

/** \brief 2FB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB4u)

/** \brief 2FB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB6u)

/** \brief 2FB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB8u)

/** \brief 2FBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FBAu)

/** \brief 2FBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FBCu)

/** \brief 2FBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FBEu)

/** \brief 2FC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC0u)

/** \brief 2FC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC2u)

/** \brief 2FC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC4u)

/** \brief 2FC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC6u)

/** \brief 2FC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC8u)

/** \brief 2FCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FCAu)

/** \brief 2FCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FCCu)

/** \brief 2FCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FCEu)

/** \brief 2FD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD0u)

/** \brief 2FD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD2u)

/** \brief 2FD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD4u)

/** \brief 2FD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD6u)

/** \brief 2FD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FD8u)

/** \brief 2FDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FDAu)

/** \brief 2FDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FDCu)

/** \brief 2FDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FDEu)

/** \brief 2FE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FE0u)

/** \brief 2FE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FE2u)

/** \brief 2FE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC47_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FE4u)

/** \brief 2FF2, Error Information Register ${x} */
#define MTU_MC47_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF2u)

/** \brief 2FF4, Error Information Register ${x} */
#define MTU_MC47_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF4u)

