Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 2FF6, Error Information Register ${x} */
#define MTU_MC47_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF6u)

/** \brief 2FF8, Error Information Register ${x} */
#define MTU_MC47_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FF8u)

/** \brief 2FFA, Error Information Register ${x} */
#define MTU_MC47_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063FFAu)

/** \brief 3000, Configuration Register 0 */
#define MTU_MC48_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064000u)

/** \brief 3002, Configuration Register 1 */
#define MTU_MC48_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064002u)

/** \brief 3004, MBIST Control Register */
#define MTU_MC48_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064004u)

/** \brief 3006, Status Register */
#define MTU_MC48_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064006u)

/** \brief 3008, Range Register, single address mode */
#define MTU_MC48_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064008u)

/** \brief 300C, Revision ID Register */
#define MTU_MC48_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006400Cu)

/** \brief 300E, ECC Safety Register */
#define MTU_MC48_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006400Eu)

/** \brief 3010, Memory ECC Detection Register */
#define MTU_MC48_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064010u)

/** \brief 3012, Error Tracking Register ${x} */
#define MTU_MC48_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064012u)

/** \brief 3014, Error Tracking Register ${x} */
#define MTU_MC48_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064014u)

/** \brief 3016, Error Tracking Register ${x} */
#define MTU_MC48_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064016u)

/** \brief 3018, Error Tracking Register ${x} */
#define MTU_MC48_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064018u)

/** \brief 301A, Error Tracking Register ${x} */
#define MTU_MC48_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006401Au)

/** \brief 3060, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064060u)

/** \brief 3062, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064062u)

/** \brief 3064, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064064u)

/** \brief 3066, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064066u)

/** \brief 3068, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064068u)

/** \brief 306A, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006406Au)

/** \brief 306C, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006406Cu)

/** \brief 306E, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006406Eu)

/** \brief 3070, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064070u)

/** \brief 3072, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064072u)

/** \brief 3074, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064074u)

/** \brief 3076, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064076u)

/** \brief 3078, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064078u)

/** \brief 307A, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006407Au)

/** \brief 307C, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006407Cu)

/** \brief 307E, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006407Eu)

/** \brief 3080, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064080u)

/** \brief 3082, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064082u)

/** \brief 3084, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064084u)

/** \brief 3086, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064086u)

/** \brief 3088, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064088u)

/** \brief 308A, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006408Au)

/** \brief 308C, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006408Cu)

/** \brief 308E, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006408Eu)

/** \brief 3090, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064090u)

/** \brief 3092, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064092u)

/** \brief 3094, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064094u)

/** \brief 3096, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064096u)

/** \brief 3098, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064098u)

