Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 309A, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006409Au)

/** \brief 309C, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006409Cu)

/** \brief 309E, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006409Eu)

/** \brief 30A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A0u)

/** \brief 30A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A2u)

/** \brief 30A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A4u)

/** \brief 30A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A6u)

/** \brief 30A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A8u)

/** \brief 30AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640AAu)

/** \brief 30AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640ACu)

/** \brief 30AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640AEu)

/** \brief 30B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B0u)

/** \brief 30B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B2u)

/** \brief 30B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B4u)

/** \brief 30B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B6u)

/** \brief 30B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B8u)

/** \brief 30BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640BAu)

/** \brief 30BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640BCu)

/** \brief 30BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640BEu)

/** \brief 30C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C0u)

/** \brief 30C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C2u)

/** \brief 30C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C4u)

/** \brief 30C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C6u)

/** \brief 30C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C8u)

/** \brief 30CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640CAu)

/** \brief 30CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640CCu)

/** \brief 30CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640CEu)

/** \brief 30D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D0u)

/** \brief 30D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D2u)

/** \brief 30D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D4u)

/** \brief 30D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D6u)

/** \brief 30D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D8u)

/** \brief 30DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640DAu)

/** \brief 30DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640DCu)

/** \brief 30DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640DEu)

/** \brief 30E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640E0u)

/** \brief 30E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640E2u)

/** \brief 30E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC48_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640E4u)

/** \brief 30F2, Error Information Register ${x} */
#define MTU_MC48_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F2u)

/** \brief 30F4, Error Information Register ${x} */
#define MTU_MC48_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F4u)

/** \brief 30F6, Error Information Register ${x} */
#define MTU_MC48_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F6u)

/** \brief 30F8, Error Information Register ${x} */
#define MTU_MC48_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F8u)

/** \brief 30FA, Error Information Register ${x} */
#define MTU_MC48_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640FAu)

/** \brief 3100, Configuration Register 0 */
#define MTU_MC49_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064100u)

