Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3102, Configuration Register 1 */
#define MTU_MC49_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064102u)

/** \brief 3104, MBIST Control Register */
#define MTU_MC49_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064104u)

/** \brief 3106, Status Register */
#define MTU_MC49_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064106u)

/** \brief 3108, Range Register, single address mode */
#define MTU_MC49_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064108u)

/** \brief 310C, Revision ID Register */
#define MTU_MC49_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006410Cu)

/** \brief 310E, ECC Safety Register */
#define MTU_MC49_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006410Eu)

/** \brief 3110, Memory ECC Detection Register */
#define MTU_MC49_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064110u)

/** \brief 3112, Error Tracking Register ${x} */
#define MTU_MC49_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064112u)

/** \brief 3114, Error Tracking Register ${x} */
#define MTU_MC49_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064114u)

/** \brief 3116, Error Tracking Register ${x} */
#define MTU_MC49_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064116u)

/** \brief 3118, Error Tracking Register ${x} */
#define MTU_MC49_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064118u)

/** \brief 311A, Error Tracking Register ${x} */
#define MTU_MC49_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006411Au)

/** \brief 3160, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064160u)

/** \brief 3162, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064162u)

/** \brief 3164, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064164u)

/** \brief 3166, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064166u)

/** \brief 3168, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064168u)

/** \brief 316A, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006416Au)

/** \brief 316C, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006416Cu)

/** \brief 316E, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006416Eu)

/** \brief 3170, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064170u)

/** \brief 3172, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064172u)

/** \brief 3174, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064174u)

/** \brief 3176, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064176u)

/** \brief 3178, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064178u)

/** \brief 317A, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006417Au)

/** \brief 317C, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006417Cu)

/** \brief 317E, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006417Eu)

/** \brief 3180, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064180u)

/** \brief 3182, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064182u)

/** \brief 3184, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064184u)

/** \brief 3186, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064186u)

/** \brief 3188, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064188u)

/** \brief 318A, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006418Au)

/** \brief 318C, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006418Cu)

/** \brief 318E, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006418Eu)

/** \brief 3190, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064190u)

/** \brief 3192, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064192u)

/** \brief 3194, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064194u)

/** \brief 3196, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064196u)

/** \brief 3198, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064198u)

/** \brief 319A, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006419Au)

/** \brief 319C, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006419Cu)

/** \brief 319E, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006419Eu)

/** \brief 31A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A0u)

