Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 31A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A2u)

/** \brief 31A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A4u)

/** \brief 31A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A6u)

/** \brief 31A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A8u)

/** \brief 31AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641AAu)

/** \brief 31AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641ACu)

/** \brief 31AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641AEu)

/** \brief 31B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B0u)

/** \brief 31B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B2u)

/** \brief 31B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B4u)

/** \brief 31B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B6u)

/** \brief 31B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B8u)

/** \brief 31BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641BAu)

/** \brief 31BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641BCu)

/** \brief 31BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641BEu)

/** \brief 31C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C0u)

/** \brief 31C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C2u)

/** \brief 31C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C4u)

/** \brief 31C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C6u)

/** \brief 31C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C8u)

/** \brief 31CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641CAu)

/** \brief 31CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641CCu)

/** \brief 31CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641CEu)

/** \brief 31D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D0u)

/** \brief 31D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D2u)

/** \brief 31D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D4u)

/** \brief 31D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D6u)

/** \brief 31D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D8u)

/** \brief 31DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641DAu)

/** \brief 31DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641DCu)

/** \brief 31DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641DEu)

/** \brief 31E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641E0u)

/** \brief 31E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641E2u)

/** \brief 31E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC49_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641E4u)

/** \brief 31F2, Error Information Register ${x} */
#define MTU_MC49_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F2u)

/** \brief 31F4, Error Information Register ${x} */
#define MTU_MC49_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F4u)

/** \brief 31F6, Error Information Register ${x} */
#define MTU_MC49_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F6u)

/** \brief 31F8, Error Information Register ${x} */
#define MTU_MC49_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F8u)

/** \brief 31FA, Error Information Register ${x} */
#define MTU_MC49_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641FAu)

/** \brief 3200, Configuration Register 0 */
#define MTU_MC50_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064200u)

/** \brief 3202, Configuration Register 1 */
#define MTU_MC50_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064202u)

/** \brief 3204, MBIST Control Register */
#define MTU_MC50_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064204u)

/** \brief 3206, Status Register */
#define MTU_MC50_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064206u)

/** \brief 3208, Range Register, single address mode */
#define MTU_MC50_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064208u)

/** \brief 320C, Revision ID Register */
#define MTU_MC50_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006420Cu)

/** \brief 320E, ECC Safety Register */
#define MTU_MC50_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006420Eu)

/** \brief 3210, Memory ECC Detection Register */
#define MTU_MC50_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064210u)

