Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3212, Error Tracking Register ${x} */
#define MTU_MC50_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064212u)

/** \brief 3214, Error Tracking Register ${x} */
#define MTU_MC50_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064214u)

/** \brief 3216, Error Tracking Register ${x} */
#define MTU_MC50_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064216u)

/** \brief 3218, Error Tracking Register ${x} */
#define MTU_MC50_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064218u)

/** \brief 321A, Error Tracking Register ${x} */
#define MTU_MC50_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006421Au)

/** \brief 3260, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064260u)

/** \brief 3262, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064262u)

/** \brief 3264, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064264u)

/** \brief 3266, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064266u)

/** \brief 3268, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064268u)

/** \brief 326A, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006426Au)

/** \brief 326C, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006426Cu)

/** \brief 326E, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006426Eu)

/** \brief 3270, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064270u)

/** \brief 3272, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064272u)

/** \brief 3274, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064274u)

/** \brief 3276, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064276u)

/** \brief 3278, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064278u)

/** \brief 327A, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006427Au)

/** \brief 327C, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006427Cu)

/** \brief 327E, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006427Eu)

/** \brief 3280, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064280u)

/** \brief 3282, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064282u)

/** \brief 3284, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064284u)

/** \brief 3286, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064286u)

/** \brief 3288, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064288u)

/** \brief 328A, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006428Au)

/** \brief 328C, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006428Cu)

/** \brief 328E, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006428Eu)

/** \brief 3290, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064290u)

/** \brief 3292, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064292u)

/** \brief 3294, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064294u)

/** \brief 3296, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064296u)

/** \brief 3298, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064298u)

/** \brief 329A, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006429Au)

/** \brief 329C, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006429Cu)

/** \brief 329E, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006429Eu)

/** \brief 32A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A0u)

/** \brief 32A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A2u)

/** \brief 32A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A4u)

/** \brief 32A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A6u)

/** \brief 32A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A8u)

/** \brief 32AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642AAu)

/** \brief 32AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642ACu)

