Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 32AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642AEu)

/** \brief 32B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B0u)

/** \brief 32B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B2u)

/** \brief 32B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B4u)

/** \brief 32B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B6u)

/** \brief 32B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B8u)

/** \brief 32BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642BAu)

/** \brief 32BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642BCu)

/** \brief 32BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642BEu)

/** \brief 32C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C0u)

/** \brief 32C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C2u)

/** \brief 32C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C4u)

/** \brief 32C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C6u)

/** \brief 32C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C8u)

/** \brief 32CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642CAu)

/** \brief 32CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642CCu)

/** \brief 32CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642CEu)

/** \brief 32D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D0u)

/** \brief 32D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D2u)

/** \brief 32D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D4u)

/** \brief 32D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D6u)

/** \brief 32D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D8u)

/** \brief 32DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642DAu)

/** \brief 32DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642DCu)

/** \brief 32DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642DEu)

/** \brief 32E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642E0u)

/** \brief 32E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642E2u)

/** \brief 32E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC50_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642E4u)

/** \brief 32F2, Error Information Register ${x} */
#define MTU_MC50_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F2u)

/** \brief 32F4, Error Information Register ${x} */
#define MTU_MC50_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F4u)

/** \brief 32F6, Error Information Register ${x} */
#define MTU_MC50_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F6u)

/** \brief 32F8, Error Information Register ${x} */
#define MTU_MC50_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F8u)

/** \brief 32FA, Error Information Register ${x} */
#define MTU_MC50_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642FAu)

/** \brief 3300, Configuration Register 0 */
#define MTU_MC51_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064300u)

/** \brief 3302, Configuration Register 1 */
#define MTU_MC51_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064302u)

/** \brief 3304, MBIST Control Register */
#define MTU_MC51_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064304u)

/** \brief 3306, Status Register */
#define MTU_MC51_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064306u)

/** \brief 3308, Range Register, single address mode */
#define MTU_MC51_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064308u)

/** \brief 330C, Revision ID Register */
#define MTU_MC51_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006430Cu)

/** \brief 330E, ECC Safety Register */
#define MTU_MC51_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006430Eu)

/** \brief 3310, Memory ECC Detection Register */
#define MTU_MC51_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064310u)

/** \brief 3312, Error Tracking Register ${x} */
#define MTU_MC51_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064312u)

/** \brief 3314, Error Tracking Register ${x} */
#define MTU_MC51_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064314u)

/** \brief 3316, Error Tracking Register ${x} */
#define MTU_MC51_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064316u)

