Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3318, Error Tracking Register ${x} */
#define MTU_MC51_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064318u)

/** \brief 331A, Error Tracking Register ${x} */
#define MTU_MC51_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006431Au)


/** \brief 3360, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064360u)

/** \brief 3362, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064362u)

/** \brief 3364, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064364u)

/** \brief 3366, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064366u)

/** \brief 3368, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064368u)

/** \brief 336A, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006436Au)

/** \brief 336C, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006436Cu)

/** \brief 336E, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006436Eu)

/** \brief 3370, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064370u)

/** \brief 3372, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064372u)

/** \brief 3374, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064374u)

/** \brief 3376, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064376u)

/** \brief 3378, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064378u)

/** \brief 337A, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006437Au)

/** \brief 337C, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006437Cu)

/** \brief 337E, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006437Eu)

/** \brief 3380, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064380u)

/** \brief 3382, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064382u)

/** \brief 3384, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064384u)

/** \brief 3386, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064386u)

/** \brief 3388, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064388u)

/** \brief 338A, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006438Au)

/** \brief 338C, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006438Cu)

/** \brief 338E, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006438Eu)

/** \brief 3390, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064390u)

/** \brief 3392, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064392u)

/** \brief 3394, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064394u)

/** \brief 3396, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064396u)

/** \brief 3398, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064398u)

/** \brief 339A, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006439Au)

/** \brief 339C, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006439Cu)

/** \brief 339E, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006439Eu)

/** \brief 33A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A0u)

/** \brief 33A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A2u)

/** \brief 33A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A4u)

/** \brief 33A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A6u)

/** \brief 33A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A8u)

/** \brief 33AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643AAu)

/** \brief 33AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643ACu)

/** \brief 33AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643AEu)

