Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 33B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B0u)

/** \brief 33B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B2u)

/** \brief 33B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B4u)

/** \brief 33B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B6u)

/** \brief 33B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B8u)

/** \brief 33BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643BAu)

/** \brief 33BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643BCu)

/** \brief 33BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643BEu)

/** \brief 33C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C0u)

/** \brief 33C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C2u)

/** \brief 33C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C4u)

/** \brief 33C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C6u)

/** \brief 33C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C8u)

/** \brief 33CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643CAu)

/** \brief 33CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643CCu)

/** \brief 33CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643CEu)

/** \brief 33D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D0u)

/** \brief 33D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D2u)

/** \brief 33D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D4u)

/** \brief 33D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D6u)

/** \brief 33D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D8u)

/** \brief 33DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643DAu)

/** \brief 33DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643DCu)

/** \brief 33DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643DEu)

/** \brief 33E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643E0u)

/** \brief 33E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643E2u)

/** \brief 33E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC51_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643E4u)

/** \brief 33F2, Error Information Register ${x} */
#define MTU_MC51_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F2u)

/** \brief 33F4, Error Information Register ${x} */
#define MTU_MC51_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F4u)

/** \brief 33F6, Error Information Register ${x} */
#define MTU_MC51_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F6u)

/** \brief 33F8, Error Information Register ${x} */
#define MTU_MC51_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F8u)

/** \brief 33FA, Error Information Register ${x} */
#define MTU_MC51_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643FAu)

/** \brief 3400, Configuration Register 0 */
#define MTU_MC52_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064400u)

/** \brief 3402, Configuration Register 1 */
#define MTU_MC52_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064402u)

/** \brief 3404, MBIST Control Register */
#define MTU_MC52_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064404u)

/** \brief 3406, Status Register */
#define MTU_MC52_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064406u)

/** \brief 3408, Range Register, single address mode */
#define MTU_MC52_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064408u)

/** \brief 340C, Revision ID Register */
#define MTU_MC52_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006440Cu)

/** \brief 340E, ECC Safety Register */
#define MTU_MC52_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006440Eu)

/** \brief 3410, Memory ECC Detection Register */
#define MTU_MC52_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064410u)

/** \brief 3412, Error Tracking Register ${x} */
#define MTU_MC52_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064412u)

/** \brief 3414, Error Tracking Register ${x} */
#define MTU_MC52_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064414u)

/** \brief 3416, Error Tracking Register ${x} */
#define MTU_MC52_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064416u)

/** \brief 3418, Error Tracking Register ${x} */
#define MTU_MC52_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064418u)

/** \brief 341A, Error Tracking Register ${x} */
#define MTU_MC52_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006441Au)


/** \brief 3460, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064460u)

/** \brief 3462, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064462u)

