Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3464, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064464u)

/** \brief 3466, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064466u)

/** \brief 3468, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064468u)

/** \brief 346A, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006446Au)

/** \brief 346C, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006446Cu)

/** \brief 346E, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006446Eu)

/** \brief 3470, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064470u)

/** \brief 3472, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064472u)

/** \brief 3474, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064474u)

/** \brief 3476, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064476u)

/** \brief 3478, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064478u)

/** \brief 347A, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006447Au)

/** \brief 347C, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006447Cu)

/** \brief 347E, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006447Eu)

/** \brief 3480, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064480u)

/** \brief 3482, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064482u)

/** \brief 3484, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064484u)

/** \brief 3486, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064486u)

/** \brief 3488, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064488u)

/** \brief 348A, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006448Au)

/** \brief 348C, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006448Cu)

/** \brief 348E, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006448Eu)

/** \brief 3490, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064490u)

/** \brief 3492, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064492u)

/** \brief 3494, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064494u)

/** \brief 3496, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064496u)

/** \brief 3498, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064498u)

/** \brief 349A, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006449Au)

/** \brief 349C, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006449Cu)

/** \brief 349E, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006449Eu)

/** \brief 34A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A0u)

/** \brief 34A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A2u)

/** \brief 34A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A4u)

/** \brief 34A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A6u)

/** \brief 34A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A8u)

/** \brief 34AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644AAu)

/** \brief 34AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644ACu)

/** \brief 34AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644AEu)

/** \brief 34B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B0u)

/** \brief 34B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B2u)

/** \brief 34B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B4u)

/** \brief 34B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B6u)

/** \brief 34B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B8u)

/** \brief 34BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644BAu)

/** \brief 34BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644BCu)

/** \brief 34BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644BEu)

/** \brief 34C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C0u)

