Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 34C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C2u)

/** \brief 34C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C4u)

/** \brief 34C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C6u)

/** \brief 34C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C8u)

/** \brief 34CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644CAu)

/** \brief 34CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644CCu)

/** \brief 34CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644CEu)

/** \brief 34D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D0u)

/** \brief 34D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D2u)

/** \brief 34D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D4u)

/** \brief 34D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D6u)

/** \brief 34D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D8u)

/** \brief 34DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644DAu)

/** \brief 34DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644DCu)

/** \brief 34DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644DEu)

/** \brief 34E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644E0u)

/** \brief 34E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644E2u)

/** \brief 34E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC52_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644E4u)

/** \brief 34F2, Error Information Register ${x} */
#define MTU_MC52_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F2u)

/** \brief 34F4, Error Information Register ${x} */
#define MTU_MC52_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F4u)

/** \brief 34F6, Error Information Register ${x} */
#define MTU_MC52_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F6u)

/** \brief 34F8, Error Information Register ${x} */
#define MTU_MC52_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F8u)

/** \brief 34FA, Error Information Register ${x} */
#define MTU_MC52_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644FAu)

/** \brief 3500, Configuration Register 0 */
#define MTU_MC53_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064500u)

/** \brief 3502, Configuration Register 1 */
#define MTU_MC53_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064502u)

/** \brief 3504, MBIST Control Register */
#define MTU_MC53_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064504u)

/** \brief 3506, Status Register */
#define MTU_MC53_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064506u)

/** \brief 3508, Range Register, single address mode */
#define MTU_MC53_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064508u)

/** \brief 350C, Revision ID Register */
#define MTU_MC53_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006450Cu)

/** \brief 350E, ECC Safety Register */
#define MTU_MC53_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006450Eu)

/** \brief 3510, Memory ECC Detection Register */
#define MTU_MC53_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064510u)

/** \brief 3512, Error Tracking Register ${x} */
#define MTU_MC53_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064512u)

/** \brief 3514, Error Tracking Register ${x} */
#define MTU_MC53_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064514u)

/** \brief 3516, Error Tracking Register ${x} */
#define MTU_MC53_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064516u)

/** \brief 3518, Error Tracking Register ${x} */
#define MTU_MC53_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064518u)

/** \brief 351A, Error Tracking Register ${x} */
#define MTU_MC53_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006451Au)


/** \brief 3560, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064560u)

/** \brief 3562, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064562u)

/** \brief 3564, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064564u)

/** \brief 3566, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064566u)

/** \brief 3568, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064568u)

/** \brief 356A, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006456Au)

/** \brief 356C, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006456Cu)

/** \brief 356E, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006456Eu)

/** \brief 3570, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064570u)

/** \brief 3572, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064572u)

/** \brief 3574, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064574u)

