Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3576, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064576u)

/** \brief 3578, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064578u)

/** \brief 357A, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006457Au)

/** \brief 357C, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006457Cu)

/** \brief 357E, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006457Eu)

/** \brief 3580, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064580u)

/** \brief 3582, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064582u)

/** \brief 3584, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064584u)

/** \brief 3586, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064586u)

/** \brief 3588, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064588u)

/** \brief 358A, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006458Au)

/** \brief 358C, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006458Cu)

/** \brief 358E, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006458Eu)

/** \brief 3590, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064590u)

/** \brief 3592, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064592u)

/** \brief 3594, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064594u)

/** \brief 3596, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064596u)

/** \brief 3598, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064598u)

/** \brief 359A, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006459Au)

/** \brief 359C, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006459Cu)

/** \brief 359E, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006459Eu)

/** \brief 35A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A0u)

/** \brief 35A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A2u)

/** \brief 35A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A4u)

/** \brief 35A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A6u)

/** \brief 35A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A8u)

/** \brief 35AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645AAu)

/** \brief 35AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645ACu)

/** \brief 35AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645AEu)

/** \brief 35B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B0u)

/** \brief 35B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B2u)

/** \brief 35B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B4u)

/** \brief 35B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B6u)

/** \brief 35B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B8u)

/** \brief 35BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645BAu)

/** \brief 35BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645BCu)

/** \brief 35BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645BEu)

/** \brief 35C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C0u)

/** \brief 35C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C2u)

/** \brief 35C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C4u)

/** \brief 35C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C6u)

/** \brief 35C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C8u)

/** \brief 35CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645CAu)

/** \brief 35CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645CCu)

