Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 35CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645CEu)

/** \brief 35D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D0u)

/** \brief 35D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D2u)

/** \brief 35D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D4u)

/** \brief 35D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D6u)

/** \brief 35D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D8u)

/** \brief 35DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645DAu)

/** \brief 35DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645DCu)

/** \brief 35DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645DEu)

/** \brief 35E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645E0u)

/** \brief 35E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645E2u)

/** \brief 35E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC53_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645E4u)

/** \brief 35F2, Error Information Register ${x} */
#define MTU_MC53_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F2u)

/** \brief 35F4, Error Information Register ${x} */
#define MTU_MC53_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F4u)

/** \brief 35F6, Error Information Register ${x} */
#define MTU_MC53_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F6u)

/** \brief 35F8, Error Information Register ${x} */
#define MTU_MC53_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F8u)

/** \brief 35FA, Error Information Register ${x} */
#define MTU_MC53_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645FAu)

/** \brief 3600, Configuration Register 0 */
#define MTU_MC54_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064600u)

/** \brief 3602, Configuration Register 1 */
#define MTU_MC54_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064602u)

/** \brief 3604, MBIST Control Register */
#define MTU_MC54_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064604u)

/** \brief 3606, Status Register */
#define MTU_MC54_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064606u)

/** \brief 3608, Range Register, single address mode */
#define MTU_MC54_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064608u)

/** \brief 360C, Revision ID Register */
#define MTU_MC54_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006460Cu)

/** \brief 360E, ECC Safety Register */
#define MTU_MC54_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006460Eu)

/** \brief 3610, Memory ECC Detection Register */
#define MTU_MC54_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064610u)

/** \brief 3612, Error Tracking Register ${x} */
#define MTU_MC54_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064612u)

/** \brief 3614, Error Tracking Register ${x} */
#define MTU_MC54_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064614u)

/** \brief 3616, Error Tracking Register ${x} */
#define MTU_MC54_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064616u)

/** \brief 3618, Error Tracking Register ${x} */
#define MTU_MC54_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064618u)

/** \brief 361A, Error Tracking Register ${x} */
#define MTU_MC54_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006461Au)


/** \brief 3660, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064660u)

/** \brief 3662, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064662u)

/** \brief 3664, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064664u)

/** \brief 3666, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064666u)

/** \brief 3668, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064668u)

/** \brief 366A, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006466Au)

/** \brief 366C, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006466Cu)

/** \brief 366E, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006466Eu)

/** \brief 3670, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064670u)

/** \brief 3672, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064672u)

/** \brief 3674, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064674u)

/** \brief 3676, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064676u)

/** \brief 3678, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064678u)

