Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 367A, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006467Au)

/** \brief 367C, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006467Cu)

/** \brief 367E, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006467Eu)

/** \brief 3680, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064680u)

/** \brief 3682, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064682u)

/** \brief 3684, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064684u)

/** \brief 3686, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064686u)

/** \brief 3688, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064688u)

/** \brief 368A, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006468Au)

/** \brief 368C, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006468Cu)

/** \brief 368E, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006468Eu)

/** \brief 3690, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064690u)

/** \brief 3692, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064692u)

/** \brief 3694, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064694u)

/** \brief 3696, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064696u)

/** \brief 3698, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064698u)

/** \brief 369A, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006469Au)

/** \brief 369C, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006469Cu)

/** \brief 369E, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006469Eu)

/** \brief 36A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A0u)

/** \brief 36A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A2u)

/** \brief 36A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A4u)

/** \brief 36A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A6u)

/** \brief 36A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646A8u)

/** \brief 36AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646AAu)

/** \brief 36AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646ACu)

/** \brief 36AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646AEu)

/** \brief 36B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B0u)

/** \brief 36B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B2u)

/** \brief 36B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B4u)

/** \brief 36B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B6u)

/** \brief 36B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646B8u)

/** \brief 36BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646BAu)

/** \brief 36BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646BCu)

/** \brief 36BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646BEu)

/** \brief 36C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C0u)

/** \brief 36C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C2u)

/** \brief 36C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C4u)

/** \brief 36C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C6u)

/** \brief 36C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646C8u)

/** \brief 36CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646CAu)

/** \brief 36CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646CCu)

/** \brief 36CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646CEu)

/** \brief 36D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D0u)

