Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 36D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D2u)

/** \brief 36D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D4u)

/** \brief 36D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D6u)

/** \brief 36D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646D8u)

/** \brief 36DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646DAu)

/** \brief 36DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646DCu)

/** \brief 36DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646DEu)

/** \brief 36E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646E0u)

/** \brief 36E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646E2u)

/** \brief 36E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC54_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00646E4u)

/** \brief 36F2, Error Information Register ${x} */
#define MTU_MC54_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F2u)

/** \brief 36F4, Error Information Register ${x} */
#define MTU_MC54_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F4u)

/** \brief 36F6, Error Information Register ${x} */
#define MTU_MC54_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F6u)

/** \brief 36F8, Error Information Register ${x} */
#define MTU_MC54_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646F8u)

/** \brief 36FA, Error Information Register ${x} */
#define MTU_MC54_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00646FAu)

/** \brief 3700, Configuration Register 0 */
#define MTU_MC55_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064700u)

/** \brief 3702, Configuration Register 1 */
#define MTU_MC55_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064702u)

/** \brief 3704, MBIST Control Register */
#define MTU_MC55_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064704u)

/** \brief 3706, Status Register */
#define MTU_MC55_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064706u)

/** \brief 3708, Range Register, single address mode */
#define MTU_MC55_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064708u)

/** \brief 370C, Revision ID Register */
#define MTU_MC55_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006470Cu)

/** \brief 370E, ECC Safety Register */
#define MTU_MC55_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006470Eu)

/** \brief 3710, Memory ECC Detection Register */
#define MTU_MC55_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064710u)

/** \brief 3712, Error Tracking Register ${x} */
#define MTU_MC55_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064712u)

/** \brief 3714, Error Tracking Register ${x} */
#define MTU_MC55_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064714u)

/** \brief 3716, Error Tracking Register ${x} */
#define MTU_MC55_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064716u)

/** \brief 3718, Error Tracking Register ${x} */
#define MTU_MC55_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064718u)

/** \brief 371A, Error Tracking Register ${x} */
#define MTU_MC55_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006471Au)

/** \brief 3760, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064760u)

/** \brief 3762, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064762u)

/** \brief 3764, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064764u)

/** \brief 3766, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064766u)

/** \brief 3768, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064768u)

/** \brief 376A, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006476Au)

/** \brief 376C, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006476Cu)

/** \brief 376E, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006476Eu)

/** \brief 3770, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064770u)

/** \brief 3772, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064772u)

/** \brief 3774, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064774u)

/** \brief 3776, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064776u)

/** \brief 3778, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064778u)

/** \brief 377A, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006477Au)

/** \brief 377C, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006477Cu)

/** \brief 377E, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006477Eu)

/** \brief 3780, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064780u)

