Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3782, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064782u)

/** \brief 3784, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064784u)

/** \brief 3786, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064786u)

/** \brief 3788, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064788u)

/** \brief 378A, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006478Au)

/** \brief 378C, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006478Cu)

/** \brief 378E, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006478Eu)

/** \brief 3790, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064790u)

/** \brief 3792, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064792u)

/** \brief 3794, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064794u)

/** \brief 3796, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064796u)

/** \brief 3798, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064798u)

/** \brief 379A, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006479Au)

/** \brief 379C, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006479Cu)

/** \brief 379E, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006479Eu)

/** \brief 37A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A0u)

/** \brief 37A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A2u)

/** \brief 37A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A4u)

/** \brief 37A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A6u)

/** \brief 37A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A8u)

/** \brief 37AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647AAu)

/** \brief 37AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647ACu)

/** \brief 37AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647AEu)

/** \brief 37B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B0u)

/** \brief 37B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B2u)

/** \brief 37B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B4u)

/** \brief 37B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B6u)

/** \brief 37B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B8u)

/** \brief 37BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647BAu)

/** \brief 37BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647BCu)

/** \brief 37BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647BEu)

/** \brief 37C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C0u)

/** \brief 37C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C2u)

/** \brief 37C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C4u)

/** \brief 37C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C6u)

/** \brief 37C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C8u)

/** \brief 37CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647CAu)

/** \brief 37CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647CCu)

/** \brief 37CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647CEu)

/** \brief 37D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D0u)

/** \brief 37D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D2u)

/** \brief 37D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D4u)

/** \brief 37D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D6u)

