Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 37D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D8u)

/** \brief 37DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647DAu)

/** \brief 37DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647DCu)

/** \brief 37DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647DEu)

/** \brief 37E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647E0u)

/** \brief 37E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647E2u)

/** \brief 37E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC55_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647E4u)

/** \brief 37F2, Error Information Register ${x} */
#define MTU_MC55_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F2u)

/** \brief 37F4, Error Information Register ${x} */
#define MTU_MC55_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F4u)

/** \brief 37F6, Error Information Register ${x} */
#define MTU_MC55_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F6u)

/** \brief 37F8, Error Information Register ${x} */
#define MTU_MC55_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F8u)

/** \brief 37FA, Error Information Register ${x} */
#define MTU_MC55_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647FAu)

/** \brief 3800, Configuration Register 0 */
#define MTU_MC56_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064800u)

/** \brief 3802, Configuration Register 1 */
#define MTU_MC56_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064802u)

/** \brief 3804, MBIST Control Register */
#define MTU_MC56_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064804u)

/** \brief 3806, Status Register */
#define MTU_MC56_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064806u)

/** \brief 3808, Range Register, single address mode */
#define MTU_MC56_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064808u)

/** \brief 380C, Revision ID Register */
#define MTU_MC56_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006480Cu)

/** \brief 380E, ECC Safety Register */
#define MTU_MC56_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006480Eu)

/** \brief 3810, Memory ECC Detection Register */
#define MTU_MC56_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064810u)

/** \brief 3812, Error Tracking Register ${x} */
#define MTU_MC56_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064812u)

/** \brief 3814, Error Tracking Register ${x} */
#define MTU_MC56_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064814u)

/** \brief 3816, Error Tracking Register ${x} */
#define MTU_MC56_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064816u)

/** \brief 3818, Error Tracking Register ${x} */
#define MTU_MC56_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064818u)

/** \brief 381A, Error Tracking Register ${x} */
#define MTU_MC56_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006481Au)

/** \brief 3860, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064860u)

/** \brief 3862, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064862u)

/** \brief 3864, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064864u)

/** \brief 3866, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064866u)

/** \brief 3868, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064868u)

/** \brief 386A, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006486Au)

/** \brief 386C, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006486Cu)

/** \brief 386E, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006486Eu)

/** \brief 3870, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064870u)

/** \brief 3872, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064872u)

/** \brief 3874, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064874u)

/** \brief 3876, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064876u)

/** \brief 3878, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064878u)

/** \brief 387A, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006487Au)

/** \brief 387C, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006487Cu)

/** \brief 387E, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006487Eu)

/** \brief 3880, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064880u)

/** \brief 3882, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064882u)

/** \brief 3884, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064884u)

