Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3886, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064886u)

/** \brief 3888, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064888u)

/** \brief 388A, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006488Au)

/** \brief 388C, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006488Cu)

/** \brief 388E, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006488Eu)

/** \brief 3890, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064890u)

/** \brief 3892, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064892u)

/** \brief 3894, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064894u)

/** \brief 3896, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064896u)

/** \brief 3898, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064898u)

/** \brief 389A, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006489Au)

/** \brief 389C, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006489Cu)

/** \brief 389E, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006489Eu)

/** \brief 38A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A0u)

/** \brief 38A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A2u)

/** \brief 38A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A4u)

/** \brief 38A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A6u)

/** \brief 38A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A8u)

/** \brief 38AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648AAu)

/** \brief 38AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648ACu)

/** \brief 38AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648AEu)

/** \brief 38B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B0u)

/** \brief 38B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B2u)

/** \brief 38B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B4u)

/** \brief 38B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B6u)

/** \brief 38B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B8u)

/** \brief 38BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648BAu)

/** \brief 38BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648BCu)

/** \brief 38BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648BEu)

/** \brief 38C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C0u)

/** \brief 38C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C2u)

/** \brief 38C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C4u)

/** \brief 38C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C6u)

/** \brief 38C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C8u)

/** \brief 38CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648CAu)

/** \brief 38CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648CCu)

/** \brief 38CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648CEu)

/** \brief 38D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D0u)

/** \brief 38D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D2u)

/** \brief 38D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D4u)

/** \brief 38D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D6u)

/** \brief 38D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D8u)

