Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 38DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648DAu)

/** \brief 38DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648DCu)

/** \brief 38DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648DEu)

/** \brief 38E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648E0u)

/** \brief 38E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648E2u)

/** \brief 38E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC56_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648E4u)

/** \brief 38F2, Error Information Register ${x} */
#define MTU_MC56_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F2u)

/** \brief 38F4, Error Information Register ${x} */
#define MTU_MC56_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F4u)

/** \brief 38F6, Error Information Register ${x} */
#define MTU_MC56_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F6u)

/** \brief 38F8, Error Information Register ${x} */
#define MTU_MC56_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F8u)

/** \brief 38FA, Error Information Register ${x} */
#define MTU_MC56_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648FAu)

/** \brief 3900, Configuration Register 0 */
#define MTU_MC57_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064900u)

/** \brief 3902, Configuration Register 1 */
#define MTU_MC57_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064902u)

/** \brief 3904, MBIST Control Register */
#define MTU_MC57_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064904u)

/** \brief 3906, Status Register */
#define MTU_MC57_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064906u)

/** \brief 3908, Range Register, single address mode */
#define MTU_MC57_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064908u)

/** \brief 390C, Revision ID Register */
#define MTU_MC57_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006490Cu)

/** \brief 390E, ECC Safety Register */
#define MTU_MC57_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006490Eu)

/** \brief 3910, Memory ECC Detection Register */
#define MTU_MC57_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064910u)

/** \brief 3912, Error Tracking Register ${x} */
#define MTU_MC57_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064912u)

/** \brief 3914, Error Tracking Register ${x} */
#define MTU_MC57_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064914u)

/** \brief 3916, Error Tracking Register ${x} */
#define MTU_MC57_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064916u)

/** \brief 3918, Error Tracking Register ${x} */
#define MTU_MC57_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064918u)

/** \brief 391A, Error Tracking Register ${x} */
#define MTU_MC57_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006491Au)


/** \brief 3960, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064960u)

/** \brief 3962, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064962u)

/** \brief 3964, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064964u)

/** \brief 3966, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064966u)

/** \brief 3968, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064968u)

/** \brief 396A, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006496Au)

/** \brief 396C, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006496Cu)

/** \brief 396E, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006496Eu)

/** \brief 3970, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064970u)

/** \brief 3972, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064972u)

/** \brief 3974, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064974u)

/** \brief 3976, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064976u)

/** \brief 3978, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064978u)

/** \brief 397A, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006497Au)

/** \brief 397C, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006497Cu)

/** \brief 397E, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006497Eu)

/** \brief 3980, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064980u)

/** \brief 3982, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064982u)

/** \brief 3984, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064984u)

/** \brief 3986, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064986u)

/** \brief 3988, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064988u)

