Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 398A, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006498Au)

/** \brief 398C, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006498Cu)

/** \brief 398E, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006498Eu)

/** \brief 3990, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064990u)

/** \brief 3992, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064992u)

/** \brief 3994, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064994u)

/** \brief 3996, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064996u)

/** \brief 3998, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064998u)

/** \brief 399A, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006499Au)

/** \brief 399C, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006499Cu)

/** \brief 399E, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006499Eu)

/** \brief 39A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A0u)

/** \brief 39A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A2u)

/** \brief 39A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A4u)

/** \brief 39A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A6u)

/** \brief 39A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A8u)

/** \brief 39AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649AAu)

/** \brief 39AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649ACu)

/** \brief 39AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649AEu)

/** \brief 39B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B0u)

/** \brief 39B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B2u)

/** \brief 39B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B4u)

/** \brief 39B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B6u)

/** \brief 39B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B8u)

/** \brief 39BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649BAu)

/** \brief 39BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649BCu)

/** \brief 39BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649BEu)

/** \brief 39C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C0u)

/** \brief 39C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C2u)

/** \brief 39C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C4u)

/** \brief 39C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C6u)

/** \brief 39C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C8u)

/** \brief 39CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649CAu)

/** \brief 39CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649CCu)

/** \brief 39CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649CEu)

/** \brief 39D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D0u)

/** \brief 39D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D2u)

/** \brief 39D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D4u)

/** \brief 39D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D6u)

/** \brief 39D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D8u)

/** \brief 39DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649DAu)

/** \brief 39DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649DCu)

/** \brief 39DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649DEu)

/** \brief 39E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649E0u)

