Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 39E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649E2u)

/** \brief 39E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC57_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649E4u)

/** \brief 39F2, Error Information Register ${x} */
#define MTU_MC57_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F2u)

/** \brief 39F4, Error Information Register ${x} */
#define MTU_MC57_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F4u)

/** \brief 39F6, Error Information Register ${x} */
#define MTU_MC57_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F6u)

/** \brief 39F8, Error Information Register ${x} */
#define MTU_MC57_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F8u)

/** \brief 39FA, Error Information Register ${x} */
#define MTU_MC57_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649FAu)

/** \brief 3A00, Configuration Register 0 */
#define MTU_MC58_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064A00u)

/** \brief 3A02, Configuration Register 1 */
#define MTU_MC58_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064A02u)

/** \brief 3A04, MBIST Control Register */
#define MTU_MC58_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064A04u)

/** \brief 3A06, Status Register */
#define MTU_MC58_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064A06u)

/** \brief 3A08, Range Register, single address mode */
#define MTU_MC58_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064A08u)

/** \brief 3A0C, Revision ID Register */
#define MTU_MC58_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064A0Cu)

/** \brief 3A0E, ECC Safety Register */
#define MTU_MC58_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064A0Eu)

/** \brief 3A10, Memory ECC Detection Register */
#define MTU_MC58_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064A10u)

/** \brief 3A12, Error Tracking Register ${x} */
#define MTU_MC58_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A12u)

/** \brief 3A14, Error Tracking Register ${x} */
#define MTU_MC58_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A14u)

/** \brief 3A16, Error Tracking Register ${x} */
#define MTU_MC58_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A16u)

/** \brief 3A18, Error Tracking Register ${x} */
#define MTU_MC58_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A18u)

/** \brief 3A1A, Error Tracking Register ${x} */
#define MTU_MC58_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A1Au)


/** \brief 3A60, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A60u)

/** \brief 3A62, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A62u)

/** \brief 3A64, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A64u)

/** \brief 3A66, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A66u)

/** \brief 3A68, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A68u)

/** \brief 3A6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A6Au)

/** \brief 3A6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A6Cu)

/** \brief 3A6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A6Eu)

/** \brief 3A70, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A70u)

/** \brief 3A72, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A72u)

/** \brief 3A74, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A74u)

/** \brief 3A76, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A76u)

/** \brief 3A78, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A78u)

/** \brief 3A7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A7Au)

/** \brief 3A7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A7Cu)

/** \brief 3A7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A7Eu)

/** \brief 3A80, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A80u)

/** \brief 3A82, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A82u)

/** \brief 3A84, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A84u)

/** \brief 3A86, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A86u)

/** \brief 3A88, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A88u)

/** \brief 3A8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A8Au)

/** \brief 3A8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A8Cu)

