Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3A8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A8Eu)

/** \brief 3A90, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A90u)

/** \brief 3A92, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A92u)

/** \brief 3A94, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A94u)

/** \brief 3A96, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A96u)

/** \brief 3A98, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A98u)

/** \brief 3A9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A9Au)

/** \brief 3A9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A9Cu)

/** \brief 3A9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A9Eu)

/** \brief 3AA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA0u)

/** \brief 3AA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA2u)

/** \brief 3AA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA4u)

/** \brief 3AA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA6u)

/** \brief 3AA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA8u)

/** \brief 3AAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AAAu)

/** \brief 3AAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AACu)

/** \brief 3AAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AAEu)

/** \brief 3AB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB0u)

/** \brief 3AB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB2u)

/** \brief 3AB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB4u)

/** \brief 3AB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB6u)

/** \brief 3AB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB8u)

/** \brief 3ABA, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ABAu)

/** \brief 3ABC, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ABCu)

/** \brief 3ABE, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ABEu)

/** \brief 3AC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC0u)

/** \brief 3AC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC2u)

/** \brief 3AC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC4u)

/** \brief 3AC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC6u)

/** \brief 3AC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC8u)

/** \brief 3ACA, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ACAu)

/** \brief 3ACC, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ACCu)

/** \brief 3ACE, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ACEu)

/** \brief 3AD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD0u)

/** \brief 3AD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD2u)

/** \brief 3AD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD4u)

/** \brief 3AD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD6u)

/** \brief 3AD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD8u)

/** \brief 3ADA, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ADAu)

/** \brief 3ADC, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ADCu)

/** \brief 3ADE, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ADEu)

/** \brief 3AE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AE0u)

/** \brief 3AE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AE2u)

/** \brief 3AE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC58_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AE4u)

/** \brief 3AF2, Error Information Register ${x} */
#define MTU_MC58_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF2u)

/** \brief 3AF4, Error Information Register ${x} */
#define MTU_MC58_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF4u)

/** \brief 3AF6, Error Information Register ${x} */
#define MTU_MC58_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF6u)

/** \brief 3AF8, Error Information Register ${x} */
#define MTU_MC58_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF8u)

