Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3AFA, Error Information Register ${x} */
#define MTU_MC58_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AFAu)

/** \brief 3B00, Configuration Register 0 */
#define MTU_MC59_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064B00u)

/** \brief 3B02, Configuration Register 1 */
#define MTU_MC59_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064B02u)

/** \brief 3B04, MBIST Control Register */
#define MTU_MC59_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064B04u)

/** \brief 3B06, Status Register */
#define MTU_MC59_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064B06u)

/** \brief 3B08, Range Register, single address mode */
#define MTU_MC59_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064B08u)

/** \brief 3B0C, Revision ID Register */
#define MTU_MC59_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064B0Cu)

/** \brief 3B0E, ECC Safety Register */
#define MTU_MC59_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064B0Eu)

/** \brief 3B10, Memory ECC Detection Register */
#define MTU_MC59_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064B10u)

/** \brief 3B12, Error Tracking Register ${x} */
#define MTU_MC59_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B12u)

/** \brief 3B14, Error Tracking Register ${x} */
#define MTU_MC59_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B14u)

/** \brief 3B16, Error Tracking Register ${x} */
#define MTU_MC59_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B16u)

/** \brief 3B18, Error Tracking Register ${x} */
#define MTU_MC59_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B18u)

/** \brief 3B1A, Error Tracking Register ${x} */
#define MTU_MC59_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B1Au)


/** \brief 3B60, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B60u)

/** \brief 3B62, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B62u)

/** \brief 3B64, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B64u)

/** \brief 3B66, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B66u)

/** \brief 3B68, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B68u)

/** \brief 3B6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B6Au)

/** \brief 3B6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B6Cu)

/** \brief 3B6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B6Eu)

/** \brief 3B70, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B70u)

/** \brief 3B72, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B72u)

/** \brief 3B74, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B74u)

/** \brief 3B76, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B76u)

/** \brief 3B78, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B78u)

/** \brief 3B7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B7Au)

/** \brief 3B7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B7Cu)

/** \brief 3B7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B7Eu)

/** \brief 3B80, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B80u)

/** \brief 3B82, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B82u)

/** \brief 3B84, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B84u)

/** \brief 3B86, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B86u)

/** \brief 3B88, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B88u)

/** \brief 3B8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B8Au)

/** \brief 3B8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B8Cu)

/** \brief 3B8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B8Eu)

/** \brief 3B90, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B90u)

/** \brief 3B92, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B92u)

/** \brief 3B94, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B94u)

/** \brief 3B96, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B96u)

/** \brief 3B98, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B98u)

/** \brief 3B9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B9Au)

/** \brief 3B9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B9Cu)

/** \brief 3B9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B9Eu)

/** \brief 3BA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA0u)

