Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3BA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA2u)

/** \brief 3BA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA4u)

/** \brief 3BA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA6u)

/** \brief 3BA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA8u)

/** \brief 3BAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BAAu)

/** \brief 3BAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BACu)

/** \brief 3BAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BAEu)

/** \brief 3BB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB0u)

/** \brief 3BB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB2u)

/** \brief 3BB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB4u)

/** \brief 3BB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB6u)

/** \brief 3BB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB8u)

/** \brief 3BBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BBAu)

/** \brief 3BBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BBCu)

/** \brief 3BBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BBEu)

/** \brief 3BC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC0u)

/** \brief 3BC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC2u)

/** \brief 3BC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC4u)

/** \brief 3BC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC6u)

/** \brief 3BC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC8u)

/** \brief 3BCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BCAu)

/** \brief 3BCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BCCu)

/** \brief 3BCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BCEu)

/** \brief 3BD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD0u)

/** \brief 3BD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD2u)

/** \brief 3BD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD4u)

/** \brief 3BD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD6u)

/** \brief 3BD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD8u)

/** \brief 3BDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BDAu)

/** \brief 3BDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BDCu)

/** \brief 3BDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BDEu)

/** \brief 3BE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BE0u)

/** \brief 3BE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BE2u)

/** \brief 3BE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC59_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BE4u)

/** \brief 3BF2, Error Information Register ${x} */
#define MTU_MC59_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF2u)

/** \brief 3BF4, Error Information Register ${x} */
#define MTU_MC59_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF4u)

/** \brief 3BF6, Error Information Register ${x} */
#define MTU_MC59_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF6u)

/** \brief 3BF8, Error Information Register ${x} */
#define MTU_MC59_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF8u)

/** \brief 3BFA, Error Information Register ${x} */
#define MTU_MC59_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BFAu)

/** \brief 3C00, Configuration Register 0 */
#define MTU_MC60_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064C00u)

/** \brief 3C02, Configuration Register 1 */
#define MTU_MC60_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064C02u)

/** \brief 3C04, MBIST Control Register */
#define MTU_MC60_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064C04u)

/** \brief 3C06, Status Register */
#define MTU_MC60_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064C06u)

