Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3C08, Range Register, single address mode */
#define MTU_MC60_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064C08u)

/** \brief 3C0C, Revision ID Register */
#define MTU_MC60_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064C0Cu)

/** \brief 3C0E, ECC Safety Register */
#define MTU_MC60_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064C0Eu)

/** \brief 3C10, Memory ECC Detection Register */
#define MTU_MC60_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064C10u)

/** \brief 3C12, Error Tracking Register ${x} */
#define MTU_MC60_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C12u)

/** \brief 3C14, Error Tracking Register ${x} */
#define MTU_MC60_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C14u)

/** \brief 3C16, Error Tracking Register ${x} */
#define MTU_MC60_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C16u)

/** \brief 3C18, Error Tracking Register ${x} */
#define MTU_MC60_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C18u)

/** \brief 3C1A, Error Tracking Register ${x} */
#define MTU_MC60_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C1Au)


/** \brief 3C60, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C60u)

/** \brief 3C62, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C62u)

/** \brief 3C64, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C64u)

/** \brief 3C66, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C66u)

/** \brief 3C68, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C68u)

/** \brief 3C6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C6Au)

/** \brief 3C6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C6Cu)

/** \brief 3C6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C6Eu)

/** \brief 3C70, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C70u)

/** \brief 3C72, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C72u)

/** \brief 3C74, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C74u)

/** \brief 3C76, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C76u)

/** \brief 3C78, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C78u)

/** \brief 3C7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C7Au)

/** \brief 3C7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C7Cu)

/** \brief 3C7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C7Eu)

/** \brief 3C80, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C80u)

/** \brief 3C82, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C82u)

/** \brief 3C84, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C84u)

/** \brief 3C86, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C86u)

/** \brief 3C88, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C88u)

/** \brief 3C8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C8Au)

/** \brief 3C8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C8Cu)

/** \brief 3C8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C8Eu)

/** \brief 3C90, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C90u)

/** \brief 3C92, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C92u)

/** \brief 3C94, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C94u)

/** \brief 3C96, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C96u)

/** \brief 3C98, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C98u)

/** \brief 3C9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C9Au)

/** \brief 3C9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C9Cu)

/** \brief 3C9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C9Eu)

/** \brief 3CA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA0u)

/** \brief 3CA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA2u)

