Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3CA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA4u)

/** \brief 3CA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA6u)

/** \brief 3CA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA8u)

/** \brief 3CAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CAAu)

/** \brief 3CAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CACu)

/** \brief 3CAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CAEu)

/** \brief 3CB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB0u)

/** \brief 3CB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB2u)

/** \brief 3CB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB4u)

/** \brief 3CB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB6u)

/** \brief 3CB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB8u)

/** \brief 3CBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CBAu)

/** \brief 3CBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CBCu)

/** \brief 3CBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CBEu)

/** \brief 3CC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC0u)

/** \brief 3CC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC2u)

/** \brief 3CC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC4u)

/** \brief 3CC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC6u)

/** \brief 3CC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC8u)

/** \brief 3CCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CCAu)

/** \brief 3CCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CCCu)

/** \brief 3CCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CCEu)

/** \brief 3CD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD0u)

/** \brief 3CD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD2u)

/** \brief 3CD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD4u)

/** \brief 3CD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD6u)

/** \brief 3CD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD8u)

/** \brief 3CDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CDAu)

/** \brief 3CDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CDCu)

/** \brief 3CDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CDEu)

/** \brief 3CE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CE0u)

/** \brief 3CE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CE2u)

/** \brief 3CE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC60_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CE4u)

/** \brief 3CF2, Error Information Register ${x} */
#define MTU_MC60_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF2u)

/** \brief 3CF4, Error Information Register ${x} */
#define MTU_MC60_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF4u)

/** \brief 3CF6, Error Information Register ${x} */
#define MTU_MC60_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF6u)

/** \brief 3CF8, Error Information Register ${x} */
#define MTU_MC60_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF8u)

/** \brief 3CFA, Error Information Register ${x} */
#define MTU_MC60_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CFAu)

/** \brief 3D00, Configuration Register 0 */
#define MTU_MC61_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064D00u)

/** \brief 3D02, Configuration Register 1 */
#define MTU_MC61_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064D02u)

/** \brief 3D04, MBIST Control Register */
#define MTU_MC61_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064D04u)

/** \brief 3D06, Status Register */
#define MTU_MC61_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064D06u)

/** \brief 3D08, Range Register, single address mode */
#define MTU_MC61_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064D08u)

/** \brief 3D0C, Revision ID Register */
#define MTU_MC61_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064D0Cu)

/** \brief 3D0E, ECC Safety Register */
#define MTU_MC61_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064D0Eu)

