Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3D10, Memory ECC Detection Register */
#define MTU_MC61_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064D10u)

/** \brief 3D12, Error Tracking Register ${x} */
#define MTU_MC61_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D12u)

/** \brief 3D14, Error Tracking Register ${x} */
#define MTU_MC61_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D14u)

/** \brief 3D16, Error Tracking Register ${x} */
#define MTU_MC61_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D16u)

/** \brief 3D18, Error Tracking Register ${x} */
#define MTU_MC61_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D18u)

/** \brief 3D1A, Error Tracking Register ${x} */
#define MTU_MC61_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D1Au)


/** \brief 3D60, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D60u)

/** \brief 3D62, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D62u)

/** \brief 3D64, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D64u)

/** \brief 3D66, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D66u)

/** \brief 3D68, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D68u)

/** \brief 3D6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D6Au)

/** \brief 3D6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D6Cu)

/** \brief 3D6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D6Eu)

/** \brief 3D70, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D70u)

/** \brief 3D72, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D72u)

/** \brief 3D74, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D74u)

/** \brief 3D76, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D76u)

/** \brief 3D78, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D78u)

/** \brief 3D7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D7Au)

/** \brief 3D7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D7Cu)

/** \brief 3D7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D7Eu)

/** \brief 3D80, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D80u)

/** \brief 3D82, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D82u)

/** \brief 3D84, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D84u)

/** \brief 3D86, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D86u)

/** \brief 3D88, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D88u)

/** \brief 3D8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D8Au)

/** \brief 3D8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D8Cu)

/** \brief 3D8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D8Eu)

/** \brief 3D90, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D90u)

/** \brief 3D92, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D92u)

/** \brief 3D94, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D94u)

/** \brief 3D96, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D96u)

/** \brief 3D98, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D98u)

/** \brief 3D9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D9Au)

/** \brief 3D9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D9Cu)

/** \brief 3D9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D9Eu)

/** \brief 3DA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA0u)

/** \brief 3DA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA2u)

/** \brief 3DA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA4u)

/** \brief 3DA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA6u)

/** \brief 3DA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA8u)

/** \brief 3DAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DAAu)

