Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3DAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DACu)

/** \brief 3DAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DAEu)

/** \brief 3DB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB0u)

/** \brief 3DB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB2u)

/** \brief 3DB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB4u)

/** \brief 3DB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB6u)

/** \brief 3DB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB8u)

/** \brief 3DBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DBAu)

/** \brief 3DBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DBCu)

/** \brief 3DBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DBEu)

/** \brief 3DC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC0u)

/** \brief 3DC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC2u)

/** \brief 3DC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC4u)

/** \brief 3DC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC6u)

/** \brief 3DC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC8u)

/** \brief 3DCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DCAu)

/** \brief 3DCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DCCu)

/** \brief 3DCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DCEu)

/** \brief 3DD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD0u)

/** \brief 3DD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD2u)

/** \brief 3DD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD4u)

/** \brief 3DD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD6u)

/** \brief 3DD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DD8u)

/** \brief 3DDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DDAu)

/** \brief 3DDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DDCu)

/** \brief 3DDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DDEu)

/** \brief 3DE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DE0u)

/** \brief 3DE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DE2u)

/** \brief 3DE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC61_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DE4u)

/** \brief 3DF2, Error Information Register ${x} */
#define MTU_MC61_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF2u)

/** \brief 3DF4, Error Information Register ${x} */
#define MTU_MC61_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF4u)

/** \brief 3DF6, Error Information Register ${x} */
#define MTU_MC61_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF6u)

/** \brief 3DF8, Error Information Register ${x} */
#define MTU_MC61_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DF8u)

/** \brief 3DFA, Error Information Register ${x} */
#define MTU_MC61_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064DFAu)

/** \brief 3E00, Configuration Register 0 */
#define MTU_MC62_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064E00u)

/** \brief 3E02, Configuration Register 1 */
#define MTU_MC62_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064E02u)

/** \brief 3E04, MBIST Control Register */
#define MTU_MC62_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064E04u)

/** \brief 3E06, Status Register */
#define MTU_MC62_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064E06u)

/** \brief 3E08, Range Register, single address mode */
#define MTU_MC62_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064E08u)

/** \brief 3E0C, Revision ID Register */
#define MTU_MC62_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064E0Cu)

/** \brief 3E0E, ECC Safety Register */
#define MTU_MC62_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064E0Eu)

/** \brief 3E10, Memory ECC Detection Register */
#define MTU_MC62_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064E10u)

/** \brief 3E12, Error Tracking Register ${x} */
#define MTU_MC62_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E12u)

/** \brief 3E14, Error Tracking Register ${x} */
#define MTU_MC62_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E14u)

/** \brief 3E16, Error Tracking Register ${x} */
#define MTU_MC62_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E16u)

/** \brief 3E18, Error Tracking Register ${x} */
#define MTU_MC62_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E18u)

/** \brief 3E1A, Error Tracking Register ${x} */
#define MTU_MC62_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064E1Au)


/** \brief 3E60, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E60u)

/** \brief 3E62, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E62u)

