Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3E64, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E64u)

/** \brief 3E66, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E66u)

/** \brief 3E68, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E68u)

/** \brief 3E6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E6Au)

/** \brief 3E6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E6Cu)

/** \brief 3E6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E6Eu)

/** \brief 3E70, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E70u)

/** \brief 3E72, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E72u)

/** \brief 3E74, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E74u)

/** \brief 3E76, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E76u)

/** \brief 3E78, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E78u)

/** \brief 3E7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E7Au)

/** \brief 3E7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E7Cu)

/** \brief 3E7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E7Eu)

/** \brief 3E80, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E80u)

/** \brief 3E82, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E82u)

/** \brief 3E84, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E84u)

/** \brief 3E86, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E86u)

/** \brief 3E88, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E88u)

/** \brief 3E8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E8Au)

/** \brief 3E8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E8Cu)

/** \brief 3E8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E8Eu)

/** \brief 3E90, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E90u)

/** \brief 3E92, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E92u)

/** \brief 3E94, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E94u)

/** \brief 3E96, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E96u)

/** \brief 3E98, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E98u)

/** \brief 3E9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E9Au)

/** \brief 3E9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E9Cu)

/** \brief 3E9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E9Eu)

/** \brief 3EA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA0u)

/** \brief 3EA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA2u)

/** \brief 3EA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA4u)

/** \brief 3EA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA6u)

/** \brief 3EA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA8u)

/** \brief 3EAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EAAu)

/** \brief 3EAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EACu)

/** \brief 3EAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EAEu)

/** \brief 3EB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB0u)

/** \brief 3EB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB2u)

/** \brief 3EB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB4u)

/** \brief 3EB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB6u)

/** \brief 3EB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB8u)

/** \brief 3EBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EBAu)

/** \brief 3EBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EBCu)

/** \brief 3EBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EBEu)

/** \brief 3EC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC0u)

