Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3EC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC2u)

/** \brief 3EC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC4u)

/** \brief 3EC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC6u)

/** \brief 3EC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC8u)

/** \brief 3ECA, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ECAu)

/** \brief 3ECC, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ECCu)

/** \brief 3ECE, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ECEu)

/** \brief 3ED0, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED0u)

/** \brief 3ED2, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED2u)

/** \brief 3ED4, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED4u)

/** \brief 3ED6, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED6u)

/** \brief 3ED8, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED8u)

/** \brief 3EDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EDAu)

/** \brief 3EDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EDCu)

/** \brief 3EDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EDEu)

/** \brief 3EE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EE0u)

/** \brief 3EE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EE2u)

/** \brief 3EE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC62_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EE4u)

/** \brief 3EF2, Error Information Register ${x} */
#define MTU_MC62_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF2u)

/** \brief 3EF4, Error Information Register ${x} */
#define MTU_MC62_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF4u)

/** \brief 3EF6, Error Information Register ${x} */
#define MTU_MC62_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF6u)

/** \brief 3EF8, Error Information Register ${x} */
#define MTU_MC62_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF8u)

/** \brief 3EFA, Error Information Register ${x} */
#define MTU_MC62_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EFAu)

/** \brief 3F00, Configuration Register 0 */
#define MTU_MC63_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064F00u)

/** \brief 3F02, Configuration Register 1 */
#define MTU_MC63_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064F02u)

/** \brief 3F04, MBIST Control Register */
#define MTU_MC63_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064F04u)

/** \brief 3F06, Status Register */
#define MTU_MC63_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064F06u)

/** \brief 3F08, Range Register, single address mode */
#define MTU_MC63_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064F08u)

/** \brief 3F0C, Revision ID Register */
#define MTU_MC63_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064F0Cu)

/** \brief 3F0E, ECC Safety Register */
#define MTU_MC63_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064F0Eu)

/** \brief 3F10, Memory ECC Detection Register */
#define MTU_MC63_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064F10u)

/** \brief 3F12, Error Tracking Register ${x} */
#define MTU_MC63_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F12u)

/** \brief 3F14, Error Tracking Register ${x} */
#define MTU_MC63_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F14u)

/** \brief 3F16, Error Tracking Register ${x} */
#define MTU_MC63_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F16u)

/** \brief 3F18, Error Tracking Register ${x} */
#define MTU_MC63_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F18u)

/** \brief 3F1A, Error Tracking Register ${x} */
#define MTU_MC63_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F1Au)


/** \brief 3F60, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F60u)

/** \brief 3F62, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F62u)

/** \brief 3F64, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F64u)

/** \brief 3F66, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F66u)

/** \brief 3F68, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F68u)

/** \brief 3F6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F6Au)

/** \brief 3F6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F6Cu)

/** \brief 3F6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F6Eu)

/** \brief 3F70, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F70u)

/** \brief 3F72, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F72u)

/** \brief 3F74, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F74u)

