Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 3F76, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F76u)

/** \brief 3F78, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F78u)

/** \brief 3F7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F7Au)

/** \brief 3F7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F7Cu)

/** \brief 3F7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F7Eu)

/** \brief 3F80, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F80u)

/** \brief 3F82, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F82u)

/** \brief 3F84, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F84u)

/** \brief 3F86, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F86u)

/** \brief 3F88, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F88u)

/** \brief 3F8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F8Au)

/** \brief 3F8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F8Cu)

/** \brief 3F8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F8Eu)

/** \brief 3F90, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F90u)

/** \brief 3F92, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F92u)

/** \brief 3F94, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F94u)

/** \brief 3F96, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F96u)

/** \brief 3F98, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F98u)

/** \brief 3F9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F9Au)

/** \brief 3F9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F9Cu)

/** \brief 3F9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F9Eu)

/** \brief 3FA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA0u)

/** \brief 3FA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA2u)

/** \brief 3FA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA4u)

/** \brief 3FA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA6u)

/** \brief 3FA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA8u)

/** \brief 3FAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FAAu)

/** \brief 3FAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FACu)

/** \brief 3FAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FAEu)

/** \brief 3FB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB0u)

/** \brief 3FB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB2u)

/** \brief 3FB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB4u)

/** \brief 3FB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB6u)

/** \brief 3FB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB8u)

/** \brief 3FBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FBAu)

/** \brief 3FBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FBCu)

/** \brief 3FBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FBEu)

/** \brief 3FC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC0u)

/** \brief 3FC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC2u)

/** \brief 3FC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC4u)

/** \brief 3FC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC6u)

/** \brief 3FC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC8u)

/** \brief 3FCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FCAu)

/** \brief 3FCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC63_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FCCu)

