Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4082, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065082u)

/** \brief 4084, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065084u)

/** \brief 4086, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065086u)

/** \brief 4088, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065088u)

/** \brief 408A, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006508Au)

/** \brief 408C, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006508Cu)

/** \brief 408E, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006508Eu)

/** \brief 4090, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065090u)

/** \brief 4092, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065092u)

/** \brief 4094, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065094u)

/** \brief 4096, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065096u)

/** \brief 4098, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065098u)

/** \brief 409A, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006509Au)

/** \brief 409C, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006509Cu)

/** \brief 409E, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006509Eu)

/** \brief 40A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A0u)

/** \brief 40A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A2u)

/** \brief 40A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A4u)

/** \brief 40A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A6u)

/** \brief 40A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A8u)

/** \brief 40AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650AAu)

/** \brief 40AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650ACu)

/** \brief 40AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650AEu)

/** \brief 40B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B0u)

/** \brief 40B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B2u)

/** \brief 40B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B4u)

/** \brief 40B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B6u)

/** \brief 40B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B8u)

/** \brief 40BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650BAu)

/** \brief 40BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650BCu)

/** \brief 40BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650BEu)

/** \brief 40C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C0u)

/** \brief 40C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C2u)

/** \brief 40C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C4u)

/** \brief 40C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C6u)

/** \brief 40C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C8u)

/** \brief 40CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650CAu)

/** \brief 40CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650CCu)

/** \brief 40CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650CEu)

/** \brief 40D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D0u)

/** \brief 40D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D2u)

/** \brief 40D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D4u)

/** \brief 40D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D6u)

