Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 40D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D8u)

/** \brief 40DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650DAu)

/** \brief 40DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650DCu)

/** \brief 40DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650DEu)

/** \brief 40E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650E0u)

/** \brief 40E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650E2u)

/** \brief 40E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC64_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650E4u)

/** \brief 40F2, Error Information Register ${x} */
#define MTU_MC64_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F2u)

/** \brief 40F4, Error Information Register ${x} */
#define MTU_MC64_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F4u)

/** \brief 40F6, Error Information Register ${x} */
#define MTU_MC64_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F6u)

/** \brief 40F8, Error Information Register ${x} */
#define MTU_MC64_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F8u)

/** \brief 40FA, Error Information Register ${x} */
#define MTU_MC64_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650FAu)

/** \brief 4100, Configuration Register 0 */
#define MTU_MC65_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065100u)

/** \brief 4102, Configuration Register 1 */
#define MTU_MC65_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065102u)

/** \brief 4104, MBIST Control Register */
#define MTU_MC65_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065104u)

/** \brief 4106, Status Register */
#define MTU_MC65_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065106u)

/** \brief 4108, Range Register, single address mode */
#define MTU_MC65_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065108u)

/** \brief 410C, Revision ID Register */
#define MTU_MC65_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006510Cu)

/** \brief 410E, ECC Safety Register */
#define MTU_MC65_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006510Eu)

/** \brief 4110, Memory ECC Detection Register */
#define MTU_MC65_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065110u)

/** \brief 4112, Error Tracking Register ${x} */
#define MTU_MC65_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065112u)

/** \brief 4114, Error Tracking Register ${x} */
#define MTU_MC65_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065114u)

/** \brief 4116, Error Tracking Register ${x} */
#define MTU_MC65_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065116u)

/** \brief 4118, Error Tracking Register ${x} */
#define MTU_MC65_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065118u)

/** \brief 411A, Error Tracking Register ${x} */
#define MTU_MC65_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006511Au)


/** \brief 4160, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065160u)

/** \brief 4162, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065162u)

/** \brief 4164, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065164u)

/** \brief 4166, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065166u)

/** \brief 4168, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065168u)

/** \brief 416A, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006516Au)

/** \brief 416C, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006516Cu)

/** \brief 416E, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006516Eu)

/** \brief 4170, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065170u)

/** \brief 4172, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065172u)

/** \brief 4174, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065174u)

/** \brief 4176, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065176u)

/** \brief 4178, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065178u)

/** \brief 417A, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006517Au)

/** \brief 417C, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006517Cu)

/** \brief 417E, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006517Eu)

/** \brief 4180, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065180u)

/** \brief 4182, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065182u)

