Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4184, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065184u)

/** \brief 4186, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065186u)

/** \brief 4188, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065188u)

/** \brief 418A, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006518Au)

/** \brief 418C, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006518Cu)

/** \brief 418E, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006518Eu)

/** \brief 4190, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065190u)

/** \brief 4192, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065192u)

/** \brief 4194, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065194u)

/** \brief 4196, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065196u)

/** \brief 4198, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065198u)

/** \brief 419A, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006519Au)

/** \brief 419C, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006519Cu)

/** \brief 419E, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006519Eu)

/** \brief 41A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A0u)

/** \brief 41A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A2u)

/** \brief 41A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A4u)

/** \brief 41A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A6u)

/** \brief 41A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A8u)

/** \brief 41AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651AAu)

/** \brief 41AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651ACu)

/** \brief 41AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651AEu)

/** \brief 41B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B0u)

/** \brief 41B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B2u)

/** \brief 41B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B4u)

/** \brief 41B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B6u)

/** \brief 41B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B8u)

/** \brief 41BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651BAu)

/** \brief 41BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651BCu)

/** \brief 41BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651BEu)

/** \brief 41C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C0u)

/** \brief 41C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C2u)

/** \brief 41C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C4u)

/** \brief 41C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C6u)

/** \brief 41C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C8u)

/** \brief 41CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651CAu)

/** \brief 41CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651CCu)

/** \brief 41CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651CEu)

/** \brief 41D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651D0u)

/** \brief 41D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651D2u)

/** \brief 41D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651D4u)

/** \brief 41D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651D6u)

/** \brief 41D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651D8u)

/** \brief 41DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651DAu)

