Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 41DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651DCu)

/** \brief 41DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651DEu)

/** \brief 41E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651E0u)

/** \brief 41E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651E2u)

/** \brief 41E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC65_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651E4u)

/** \brief 41F2, Error Information Register ${x} */
#define MTU_MC65_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00651F2u)

/** \brief 41F4, Error Information Register ${x} */
#define MTU_MC65_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00651F4u)

/** \brief 41F6, Error Information Register ${x} */
#define MTU_MC65_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00651F6u)

/** \brief 41F8, Error Information Register ${x} */
#define MTU_MC65_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00651F8u)

/** \brief 41FA, Error Information Register ${x} */
#define MTU_MC65_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00651FAu)

/** \brief 4200, Configuration Register 0 */
#define MTU_MC66_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065200u)

/** \brief 4202, Configuration Register 1 */
#define MTU_MC66_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065202u)

/** \brief 4204, MBIST Control Register */
#define MTU_MC66_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065204u)

/** \brief 4206, Status Register */
#define MTU_MC66_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065206u)

/** \brief 4208, Range Register, single address mode */
#define MTU_MC66_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065208u)

/** \brief 420C, Revision ID Register */
#define MTU_MC66_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006520Cu)

/** \brief 420E, ECC Safety Register */
#define MTU_MC66_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006520Eu)

/** \brief 4210, Memory ECC Detection Register */
#define MTU_MC66_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065210u)

/** \brief 4212, Error Tracking Register ${x} */
#define MTU_MC66_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065212u)

/** \brief 4214, Error Tracking Register ${x} */
#define MTU_MC66_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065214u)

/** \brief 4216, Error Tracking Register ${x} */
#define MTU_MC66_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065216u)

/** \brief 4218, Error Tracking Register ${x} */
#define MTU_MC66_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065218u)

/** \brief 421A, Error Tracking Register ${x} */
#define MTU_MC66_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006521Au)


/** \brief 4260, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065260u)

/** \brief 4262, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065262u)

/** \brief 4264, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065264u)

/** \brief 4266, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065266u)

/** \brief 4268, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065268u)

/** \brief 426A, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006526Au)

/** \brief 426C, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006526Cu)

/** \brief 426E, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006526Eu)

/** \brief 4270, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065270u)

/** \brief 4272, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065272u)

/** \brief 4274, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065274u)

/** \brief 4276, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065276u)

/** \brief 4278, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065278u)

/** \brief 427A, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006527Au)

/** \brief 427C, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006527Cu)

/** \brief 427E, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006527Eu)

/** \brief 4280, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065280u)

/** \brief 4282, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065282u)

/** \brief 4284, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065284u)

/** \brief 4286, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065286u)

/** \brief 4288, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065288u)

/** \brief 428A, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006528Au)

