Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 428C, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006528Cu)

/** \brief 428E, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006528Eu)

/** \brief 4290, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065290u)

/** \brief 4292, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065292u)

/** \brief 4294, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065294u)

/** \brief 4296, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065296u)

/** \brief 4298, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065298u)

/** \brief 429A, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006529Au)

/** \brief 429C, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006529Cu)

/** \brief 429E, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006529Eu)

/** \brief 42A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A0u)

/** \brief 42A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A2u)

/** \brief 42A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A4u)

/** \brief 42A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A6u)

/** \brief 42A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A8u)

/** \brief 42AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652AAu)

/** \brief 42AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652ACu)

/** \brief 42AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652AEu)

/** \brief 42B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B0u)

/** \brief 42B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B2u)

/** \brief 42B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B4u)

/** \brief 42B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B6u)

/** \brief 42B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B8u)

/** \brief 42BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652BAu)

/** \brief 42BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652BCu)

/** \brief 42BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652BEu)

/** \brief 42C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C0u)

/** \brief 42C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C2u)

/** \brief 42C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C4u)

/** \brief 42C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C6u)

/** \brief 42C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C8u)

/** \brief 42CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652CAu)

/** \brief 42CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652CCu)

/** \brief 42CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652CEu)

/** \brief 42D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652D0u)

/** \brief 42D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652D2u)

/** \brief 42D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652D4u)

/** \brief 42D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652D6u)

/** \brief 42D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652D8u)

/** \brief 42DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652DAu)

/** \brief 42DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652DCu)

/** \brief 42DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652DEu)

