Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 42E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652E0u)

/** \brief 42E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652E2u)

/** \brief 42E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC66_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652E4u)

/** \brief 42F2, Error Information Register ${x} */
#define MTU_MC66_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00652F2u)

/** \brief 42F4, Error Information Register ${x} */
#define MTU_MC66_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00652F4u)

/** \brief 42F6, Error Information Register ${x} */
#define MTU_MC66_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00652F6u)

/** \brief 42F8, Error Information Register ${x} */
#define MTU_MC66_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00652F8u)

/** \brief 42FA, Error Information Register ${x} */
#define MTU_MC66_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00652FAu)

/** \brief 4300, Configuration Register 0 */
#define MTU_MC67_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065300u)

/** \brief 4302, Configuration Register 1 */
#define MTU_MC67_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065302u)

/** \brief 4304, MBIST Control Register */
#define MTU_MC67_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065304u)

/** \brief 4306, Status Register */
#define MTU_MC67_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065306u)

/** \brief 4308, Range Register, single address mode */
#define MTU_MC67_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065308u)

/** \brief 430C, Revision ID Register */
#define MTU_MC67_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006530Cu)

/** \brief 430E, ECC Safety Register */
#define MTU_MC67_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006530Eu)

/** \brief 4310, Memory ECC Detection Register */
#define MTU_MC67_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065310u)

/** \brief 4312, Error Tracking Register ${x} */
#define MTU_MC67_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065312u)

/** \brief 4314, Error Tracking Register ${x} */
#define MTU_MC67_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065314u)

/** \brief 4316, Error Tracking Register ${x} */
#define MTU_MC67_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065316u)

/** \brief 4318, Error Tracking Register ${x} */
#define MTU_MC67_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065318u)

/** \brief 431A, Error Tracking Register ${x} */
#define MTU_MC67_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006531Au)


/** \brief 4360, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065360u)

/** \brief 4362, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065362u)

/** \brief 4364, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065364u)

/** \brief 4366, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065366u)

/** \brief 4368, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065368u)

/** \brief 436A, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006536Au)

/** \brief 436C, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006536Cu)

/** \brief 436E, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006536Eu)

/** \brief 4370, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065370u)

/** \brief 4372, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065372u)

/** \brief 4374, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065374u)

/** \brief 4376, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065376u)

/** \brief 4378, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065378u)

/** \brief 437A, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006537Au)

/** \brief 437C, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006537Cu)

/** \brief 437E, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006537Eu)

/** \brief 4380, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065380u)

/** \brief 4382, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065382u)

/** \brief 4384, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065384u)

/** \brief 4386, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065386u)

/** \brief 4388, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065388u)

/** \brief 438A, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006538Au)

/** \brief 438C, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006538Cu)

