Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 438E, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006538Eu)

/** \brief 4390, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065390u)

/** \brief 4392, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065392u)

/** \brief 4394, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065394u)

/** \brief 4396, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065396u)

/** \brief 4398, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065398u)

/** \brief 439A, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006539Au)

/** \brief 439C, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006539Cu)

/** \brief 439E, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006539Eu)

/** \brief 43A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A0u)

/** \brief 43A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A2u)

/** \brief 43A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A4u)

/** \brief 43A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A6u)

/** \brief 43A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653A8u)

/** \brief 43AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653AAu)

/** \brief 43AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653ACu)

/** \brief 43AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653AEu)

/** \brief 43B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B0u)

/** \brief 43B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B2u)

/** \brief 43B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B4u)

/** \brief 43B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B6u)

/** \brief 43B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653B8u)

/** \brief 43BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653BAu)

/** \brief 43BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653BCu)

/** \brief 43BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653BEu)

/** \brief 43C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C0u)

/** \brief 43C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C2u)

/** \brief 43C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C4u)

/** \brief 43C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C6u)

/** \brief 43C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653C8u)

/** \brief 43CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653CAu)

/** \brief 43CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653CCu)

/** \brief 43CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653CEu)

/** \brief 43D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D0u)

/** \brief 43D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D2u)

/** \brief 43D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D4u)

/** \brief 43D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D6u)

/** \brief 43D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653D8u)

/** \brief 43DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653DAu)

/** \brief 43DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653DCu)

/** \brief 43DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653DEu)

/** \brief 43E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653E0u)

/** \brief 43E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653E2u)

/** \brief 43E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC67_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00653E4u)

/** \brief 43F2, Error Information Register ${x} */
#define MTU_MC67_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F2u)

/** \brief 43F4, Error Information Register ${x} */
#define MTU_MC67_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F4u)

/** \brief 43F6, Error Information Register ${x} */
#define MTU_MC67_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F6u)

