Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 43F8, Error Information Register ${x} */
#define MTU_MC67_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653F8u)

/** \brief 43FA, Error Information Register ${x} */
#define MTU_MC67_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00653FAu)

/** \brief 4400, Configuration Register 0 */
#define MTU_MC68_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065400u)

/** \brief 4402, Configuration Register 1 */
#define MTU_MC68_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065402u)

/** \brief 4404, MBIST Control Register */
#define MTU_MC68_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065404u)

/** \brief 4406, Status Register */
#define MTU_MC68_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065406u)

/** \brief 4408, Range Register, single address mode */
#define MTU_MC68_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065408u)

/** \brief 440C, Revision ID Register */
#define MTU_MC68_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006540Cu)

/** \brief 440E, ECC Safety Register */
#define MTU_MC68_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006540Eu)

/** \brief 4410, Memory ECC Detection Register */
#define MTU_MC68_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065410u)

/** \brief 4412, Error Tracking Register ${x} */
#define MTU_MC68_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065412u)

/** \brief 4414, Error Tracking Register ${x} */
#define MTU_MC68_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065414u)

/** \brief 4416, Error Tracking Register ${x} */
#define MTU_MC68_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065416u)

/** \brief 4418, Error Tracking Register ${x} */
#define MTU_MC68_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065418u)

/** \brief 441A, Error Tracking Register ${x} */
#define MTU_MC68_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006541Au)


/** \brief 4460, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065460u)

/** \brief 4462, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065462u)

/** \brief 4464, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065464u)

/** \brief 4466, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065466u)

/** \brief 4468, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065468u)

/** \brief 446A, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006546Au)

/** \brief 446C, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006546Cu)

/** \brief 446E, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006546Eu)

/** \brief 4470, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065470u)

/** \brief 4472, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065472u)

/** \brief 4474, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065474u)

/** \brief 4476, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065476u)

/** \brief 4478, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065478u)

/** \brief 447A, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006547Au)

/** \brief 447C, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006547Cu)

/** \brief 447E, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006547Eu)

/** \brief 4480, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065480u)

/** \brief 4482, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065482u)

/** \brief 4484, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065484u)

/** \brief 4486, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065486u)

/** \brief 4488, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065488u)

/** \brief 448A, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006548Au)

/** \brief 448C, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006548Cu)

/** \brief 448E, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006548Eu)

/** \brief 4490, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065490u)

/** \brief 4492, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065492u)

/** \brief 4494, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065494u)

/** \brief 4496, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065496u)

/** \brief 4498, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065498u)

/** \brief 449A, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006549Au)

/** \brief 449C, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006549Cu)

/** \brief 449E, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006549Eu)

/** \brief 44A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A0u)

