Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 44A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A2u)

/** \brief 44A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A4u)

/** \brief 44A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A6u)

/** \brief 44A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A8u)

/** \brief 44AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654AAu)

/** \brief 44AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654ACu)

/** \brief 44AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654AEu)

/** \brief 44B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654B0u)

/** \brief 44B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654B2u)

/** \brief 44B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654B4u)

/** \brief 44B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654B6u)

/** \brief 44B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654B8u)

/** \brief 44BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654BAu)

/** \brief 44BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654BCu)

/** \brief 44BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654BEu)

/** \brief 44C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654C0u)

/** \brief 44C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654C2u)

/** \brief 44C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654C4u)

/** \brief 44C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654C6u)

/** \brief 44C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654C8u)

/** \brief 44CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654CAu)

/** \brief 44CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654CCu)

/** \brief 44CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654CEu)

/** \brief 44D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654D0u)

/** \brief 44D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654D2u)

/** \brief 44D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654D4u)

/** \brief 44D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654D6u)

/** \brief 44D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654D8u)

/** \brief 44DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654DAu)

/** \brief 44DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654DCu)

/** \brief 44DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654DEu)

/** \brief 44E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654E0u)

/** \brief 44E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654E2u)

/** \brief 44E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC68_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654E4u)

/** \brief 44F2, Error Information Register ${x} */
#define MTU_MC68_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00654F2u)

/** \brief 44F4, Error Information Register ${x} */
#define MTU_MC68_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00654F4u)

/** \brief 44F6, Error Information Register ${x} */
#define MTU_MC68_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00654F6u)

/** \brief 44F8, Error Information Register ${x} */
#define MTU_MC68_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00654F8u)

/** \brief 44FA, Error Information Register ${x} */
#define MTU_MC68_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00654FAu)

/** \brief 4500, Configuration Register 0 */
#define MTU_MC69_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065500u)

/** \brief 4502, Configuration Register 1 */
#define MTU_MC69_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065502u)

/** \brief 4504, MBIST Control Register */
#define MTU_MC69_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065504u)

/** \brief 4506, Status Register */
#define MTU_MC69_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065506u)

/** \brief 4508, Range Register, single address mode */
#define MTU_MC69_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065508u)

/** \brief 450C, Revision ID Register */
#define MTU_MC69_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006550Cu)

/** \brief 450E, ECC Safety Register */
#define MTU_MC69_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006550Eu)

/** \brief 4510, Memory ECC Detection Register */
#define MTU_MC69_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065510u)

/** \brief 4512, Error Tracking Register ${x} */
#define MTU_MC69_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065512u)

/** \brief 4514, Error Tracking Register ${x} */
#define MTU_MC69_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065514u)

/** \brief 4516, Error Tracking Register ${x} */
#define MTU_MC69_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065516u)

/** \brief 4518, Error Tracking Register ${x} */
#define MTU_MC69_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065518u)

/** \brief 451A, Error Tracking Register ${x} */
#define MTU_MC69_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006551Au)


/** \brief 4560, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065560u)

/** \brief 4562, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065562u)

