Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4564, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065564u)

/** \brief 4566, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065566u)

/** \brief 4568, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065568u)

/** \brief 456A, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006556Au)

/** \brief 456C, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006556Cu)

/** \brief 456E, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006556Eu)

/** \brief 4570, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065570u)

/** \brief 4572, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065572u)

/** \brief 4574, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065574u)

/** \brief 4576, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065576u)

/** \brief 4578, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065578u)

/** \brief 457A, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006557Au)

/** \brief 457C, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006557Cu)

/** \brief 457E, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006557Eu)

/** \brief 4580, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065580u)

/** \brief 4582, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065582u)

/** \brief 4584, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065584u)

/** \brief 4586, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065586u)

/** \brief 4588, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065588u)

/** \brief 458A, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006558Au)

/** \brief 458C, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006558Cu)

/** \brief 458E, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006558Eu)

/** \brief 4590, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065590u)

/** \brief 4592, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065592u)

/** \brief 4594, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065594u)

/** \brief 4596, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065596u)

/** \brief 4598, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065598u)

/** \brief 459A, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006559Au)

/** \brief 459C, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006559Cu)

/** \brief 459E, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006559Eu)

/** \brief 45A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655A0u)

/** \brief 45A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655A2u)

/** \brief 45A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655A4u)

/** \brief 45A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655A6u)

/** \brief 45A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655A8u)

/** \brief 45AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655AAu)

/** \brief 45AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655ACu)

/** \brief 45AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655AEu)

/** \brief 45B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655B0u)

/** \brief 45B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655B2u)

/** \brief 45B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655B4u)

/** \brief 45B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655B6u)

/** \brief 45B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655B8u)

/** \brief 45BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655BAu)

/** \brief 45BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655BCu)

/** \brief 45BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655BEu)

/** \brief 45C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655C0u)

