Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 45C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655C2u)

/** \brief 45C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655C4u)

/** \brief 45C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655C6u)

/** \brief 45C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655C8u)

/** \brief 45CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655CAu)

/** \brief 45CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655CCu)

/** \brief 45CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655CEu)

/** \brief 45D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655D0u)

/** \brief 45D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655D2u)

/** \brief 45D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655D4u)

/** \brief 45D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655D6u)

/** \brief 45D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655D8u)

/** \brief 45DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655DAu)

/** \brief 45DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655DCu)

/** \brief 45DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655DEu)

/** \brief 45E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655E0u)

/** \brief 45E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655E2u)

/** \brief 45E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC69_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00655E4u)

/** \brief 45F2, Error Information Register ${x} */
#define MTU_MC69_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00655F2u)

/** \brief 45F4, Error Information Register ${x} */
#define MTU_MC69_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00655F4u)

/** \brief 45F6, Error Information Register ${x} */
#define MTU_MC69_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00655F6u)

/** \brief 45F8, Error Information Register ${x} */
#define MTU_MC69_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00655F8u)

/** \brief 45FA, Error Information Register ${x} */
#define MTU_MC69_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00655FAu)

/** \brief 4600, Configuration Register 0 */
#define MTU_MC70_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065600u)

/** \brief 4602, Configuration Register 1 */
#define MTU_MC70_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065602u)

/** \brief 4604, MBIST Control Register */
#define MTU_MC70_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065604u)

/** \brief 4606, Status Register */
#define MTU_MC70_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065606u)

/** \brief 4608, Range Register, single address mode */
#define MTU_MC70_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065608u)

/** \brief 460C, Revision ID Register */
#define MTU_MC70_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006560Cu)

/** \brief 460E, ECC Safety Register */
#define MTU_MC70_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006560Eu)

/** \brief 4610, Memory ECC Detection Register */
#define MTU_MC70_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065610u)

/** \brief 4612, Error Tracking Register ${x} */
#define MTU_MC70_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065612u)

/** \brief 4614, Error Tracking Register ${x} */
#define MTU_MC70_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065614u)

/** \brief 4616, Error Tracking Register ${x} */
#define MTU_MC70_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065616u)

/** \brief 4618, Error Tracking Register ${x} */
#define MTU_MC70_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065618u)

/** \brief 461A, Error Tracking Register ${x} */
#define MTU_MC70_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006561Au)


/** \brief 4660, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065660u)

/** \brief 4662, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065662u)

/** \brief 4664, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065664u)

/** \brief 4666, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065666u)

/** \brief 4668, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065668u)

/** \brief 466A, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006566Au)

/** \brief 466C, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006566Cu)

/** \brief 466E, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006566Eu)

/** \brief 4670, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065670u)

/** \brief 4672, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065672u)

/** \brief 4674, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065674u)

