Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4676, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065676u)

/** \brief 4678, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065678u)

/** \brief 467A, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006567Au)

/** \brief 467C, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006567Cu)

/** \brief 467E, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006567Eu)

/** \brief 4680, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065680u)

/** \brief 4682, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065682u)

/** \brief 4684, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065684u)

/** \brief 4686, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065686u)

/** \brief 4688, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065688u)

/** \brief 468A, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006568Au)

/** \brief 468C, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006568Cu)

/** \brief 468E, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006568Eu)

/** \brief 4690, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065690u)

/** \brief 4692, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065692u)

/** \brief 4694, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065694u)

/** \brief 4696, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065696u)

/** \brief 4698, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065698u)

/** \brief 469A, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006569Au)

/** \brief 469C, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006569Cu)

/** \brief 469E, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006569Eu)

/** \brief 46A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A0u)

/** \brief 46A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A2u)

/** \brief 46A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A4u)

/** \brief 46A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A6u)

/** \brief 46A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A8u)

/** \brief 46AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656AAu)

/** \brief 46AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656ACu)

/** \brief 46AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656AEu)

/** \brief 46B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B0u)

/** \brief 46B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B2u)

/** \brief 46B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B4u)

/** \brief 46B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B6u)

/** \brief 46B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B8u)

/** \brief 46BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656BAu)

/** \brief 46BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656BCu)

/** \brief 46BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656BEu)

/** \brief 46C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C0u)

/** \brief 46C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C2u)

/** \brief 46C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C4u)

/** \brief 46C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C6u)

/** \brief 46C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C8u)

/** \brief 46CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656CAu)

/** \brief 46CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656CCu)

