Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 46CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656CEu)

/** \brief 46D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D0u)

/** \brief 46D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D2u)

/** \brief 46D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D4u)

/** \brief 46D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D6u)

/** \brief 46D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D8u)

/** \brief 46DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656DAu)

/** \brief 46DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656DCu)

/** \brief 46DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656DEu)

/** \brief 46E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656E0u)

/** \brief 46E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656E2u)

/** \brief 46E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC70_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656E4u)

/** \brief 46F2, Error Information Register ${x} */
#define MTU_MC70_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F2u)

/** \brief 46F4, Error Information Register ${x} */
#define MTU_MC70_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F4u)

/** \brief 46F6, Error Information Register ${x} */
#define MTU_MC70_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F6u)

/** \brief 46F8, Error Information Register ${x} */
#define MTU_MC70_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F8u)

/** \brief 46FA, Error Information Register ${x} */
#define MTU_MC70_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656FAu)

/** \brief 4700, Configuration Register 0 */
#define MTU_MC71_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065700u)

/** \brief 4702, Configuration Register 1 */
#define MTU_MC71_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065702u)

/** \brief 4704, MBIST Control Register */
#define MTU_MC71_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065704u)

/** \brief 4706, Status Register */
#define MTU_MC71_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065706u)

/** \brief 4708, Range Register, single address mode */
#define MTU_MC71_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065708u)

/** \brief 470C, Revision ID Register */
#define MTU_MC71_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006570Cu)

/** \brief 470E, ECC Safety Register */
#define MTU_MC71_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006570Eu)

/** \brief 4710, Memory ECC Detection Register */
#define MTU_MC71_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065710u)

/** \brief 4712, Error Tracking Register ${x} */
#define MTU_MC71_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065712u)

/** \brief 4714, Error Tracking Register ${x} */
#define MTU_MC71_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065714u)

/** \brief 4716, Error Tracking Register ${x} */
#define MTU_MC71_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065716u)

/** \brief 4718, Error Tracking Register ${x} */
#define MTU_MC71_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065718u)

/** \brief 471A, Error Tracking Register ${x} */
#define MTU_MC71_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006571Au)


/** \brief 4760, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065760u)

/** \brief 4762, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065762u)

/** \brief 4764, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065764u)

/** \brief 4766, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065766u)

/** \brief 4768, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065768u)

/** \brief 476A, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006576Au)

/** \brief 476C, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006576Cu)

/** \brief 476E, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006576Eu)

/** \brief 4770, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065770u)

/** \brief 4772, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065772u)

/** \brief 4774, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065774u)

/** \brief 4776, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065776u)

/** \brief 4778, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065778u)

