Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 477A, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006577Au)

/** \brief 477C, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006577Cu)

/** \brief 477E, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006577Eu)

/** \brief 4780, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065780u)

/** \brief 4782, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065782u)

/** \brief 4784, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065784u)

/** \brief 4786, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065786u)

/** \brief 4788, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065788u)

/** \brief 478A, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006578Au)

/** \brief 478C, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006578Cu)

/** \brief 478E, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006578Eu)

/** \brief 4790, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065790u)

/** \brief 4792, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065792u)

/** \brief 4794, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065794u)

/** \brief 4796, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065796u)

/** \brief 4798, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065798u)

/** \brief 479A, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006579Au)

/** \brief 479C, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006579Cu)

/** \brief 479E, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006579Eu)

/** \brief 47A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A0u)

/** \brief 47A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A2u)

/** \brief 47A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A4u)

/** \brief 47A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A6u)

/** \brief 47A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A8u)

/** \brief 47AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657AAu)

/** \brief 47AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657ACu)

/** \brief 47AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657AEu)

/** \brief 47B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B0u)

/** \brief 47B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B2u)

/** \brief 47B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B4u)

/** \brief 47B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B6u)

/** \brief 47B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B8u)

/** \brief 47BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657BAu)

/** \brief 47BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657BCu)

/** \brief 47BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657BEu)

/** \brief 47C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C0u)

/** \brief 47C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C2u)

/** \brief 47C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C4u)

/** \brief 47C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C6u)

/** \brief 47C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C8u)

/** \brief 47CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657CAu)

/** \brief 47CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657CCu)

/** \brief 47CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657CEu)

/** \brief 47D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC71_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657D0u)

