Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 487E, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006587Eu)

/** \brief 4880, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065880u)

/** \brief 4882, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065882u)

/** \brief 4884, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065884u)

/** \brief 4886, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065886u)

/** \brief 4888, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065888u)

/** \brief 488A, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006588Au)

/** \brief 488C, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006588Cu)

/** \brief 488E, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006588Eu)

/** \brief 4890, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065890u)

/** \brief 4892, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065892u)

/** \brief 4894, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065894u)

/** \brief 4896, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065896u)

/** \brief 4898, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065898u)

/** \brief 489A, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006589Au)

/** \brief 489C, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006589Cu)

/** \brief 489E, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006589Eu)

/** \brief 48A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658A0u)

/** \brief 48A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658A2u)

/** \brief 48A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658A4u)

/** \brief 48A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658A6u)

/** \brief 48A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658A8u)

/** \brief 48AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658AAu)

/** \brief 48AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658ACu)

/** \brief 48AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658AEu)

/** \brief 48B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658B0u)

/** \brief 48B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658B2u)

/** \brief 48B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658B4u)

/** \brief 48B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658B6u)

/** \brief 48B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658B8u)

/** \brief 48BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658BAu)

/** \brief 48BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658BCu)

/** \brief 48BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658BEu)

/** \brief 48C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658C0u)

/** \brief 48C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658C2u)

/** \brief 48C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658C4u)

/** \brief 48C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658C6u)

/** \brief 48C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658C8u)

/** \brief 48CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658CAu)

/** \brief 48CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658CCu)

/** \brief 48CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658CEu)

/** \brief 48D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658D0u)

/** \brief 48D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658D2u)

/** \brief 48D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658D4u)

