Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 48D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658D6u)

/** \brief 48D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658D8u)

/** \brief 48DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658DAu)

/** \brief 48DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658DCu)

/** \brief 48DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658DEu)

/** \brief 48E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658E0u)

/** \brief 48E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658E2u)

/** \brief 48E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC72_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00658E4u)

/** \brief 48F2, Error Information Register ${x} */
#define MTU_MC72_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F2u)

/** \brief 48F4, Error Information Register ${x} */
#define MTU_MC72_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F4u)

/** \brief 48F6, Error Information Register ${x} */
#define MTU_MC72_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F6u)

/** \brief 48F8, Error Information Register ${x} */
#define MTU_MC72_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658F8u)

/** \brief 48FA, Error Information Register ${x} */
#define MTU_MC72_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00658FAu)

/** \brief 4900, Configuration Register 0 */
#define MTU_MC73_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065900u)

/** \brief 4902, Configuration Register 1 */
#define MTU_MC73_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065902u)

/** \brief 4904, MBIST Control Register */
#define MTU_MC73_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065904u)

/** \brief 4906, Status Register */
#define MTU_MC73_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065906u)

/** \brief 4908, Range Register, single address mode */
#define MTU_MC73_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065908u)

/** \brief 490C, Revision ID Register */
#define MTU_MC73_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006590Cu)

/** \brief 490E, ECC Safety Register */
#define MTU_MC73_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006590Eu)

/** \brief 4910, Memory ECC Detection Register */
#define MTU_MC73_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065910u)

/** \brief 4912, Error Tracking Register ${x} */
#define MTU_MC73_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065912u)

/** \brief 4914, Error Tracking Register ${x} */
#define MTU_MC73_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065914u)

/** \brief 4916, Error Tracking Register ${x} */
#define MTU_MC73_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065916u)

/** \brief 4918, Error Tracking Register ${x} */
#define MTU_MC73_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065918u)

/** \brief 491A, Error Tracking Register ${x} */
#define MTU_MC73_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006591Au)


/** \brief 4960, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065960u)

/** \brief 4962, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065962u)

/** \brief 4964, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065964u)

/** \brief 4966, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065966u)

/** \brief 4968, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065968u)

/** \brief 496A, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006596Au)

/** \brief 496C, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006596Cu)

/** \brief 496E, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006596Eu)

/** \brief 4970, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065970u)

/** \brief 4972, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065972u)

/** \brief 4974, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065974u)

/** \brief 4976, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065976u)

/** \brief 4978, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065978u)

/** \brief 497A, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006597Au)

/** \brief 497C, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006597Cu)

/** \brief 497E, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006597Eu)

/** \brief 4980, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065980u)

/** \brief 4982, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065982u)

/** \brief 4984, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065984u)

