Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4986, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065986u)

/** \brief 4988, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065988u)

/** \brief 498A, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006598Au)

/** \brief 498C, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006598Cu)

/** \brief 498E, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006598Eu)

/** \brief 4990, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065990u)

/** \brief 4992, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065992u)

/** \brief 4994, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065994u)

/** \brief 4996, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065996u)

/** \brief 4998, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065998u)

/** \brief 499A, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006599Au)

/** \brief 499C, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006599Cu)

/** \brief 499E, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006599Eu)

/** \brief 49A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A0u)

/** \brief 49A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A2u)

/** \brief 49A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A4u)

/** \brief 49A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A6u)

/** \brief 49A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A8u)

/** \brief 49AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659AAu)

/** \brief 49AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659ACu)

/** \brief 49AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659AEu)

/** \brief 49B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B0u)

/** \brief 49B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B2u)

/** \brief 49B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B4u)

/** \brief 49B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B6u)

/** \brief 49B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B8u)

/** \brief 49BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659BAu)

/** \brief 49BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659BCu)

/** \brief 49BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659BEu)

/** \brief 49C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C0u)

/** \brief 49C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C2u)

/** \brief 49C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C4u)

/** \brief 49C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C6u)

/** \brief 49C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C8u)

/** \brief 49CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659CAu)

/** \brief 49CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659CCu)

/** \brief 49CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659CEu)

/** \brief 49D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D0u)

/** \brief 49D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D2u)

/** \brief 49D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D4u)

/** \brief 49D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D6u)

/** \brief 49D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D8u)

