Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 49DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659DAu)

/** \brief 49DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659DCu)

/** \brief 49DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659DEu)

/** \brief 49E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659E0u)

/** \brief 49E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659E2u)

/** \brief 49E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC73_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659E4u)

/** \brief 49F2, Error Information Register ${x} */
#define MTU_MC73_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F2u)

/** \brief 49F4, Error Information Register ${x} */
#define MTU_MC73_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F4u)

/** \brief 49F6, Error Information Register ${x} */
#define MTU_MC73_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F6u)

/** \brief 49F8, Error Information Register ${x} */
#define MTU_MC73_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F8u)

/** \brief 49FA, Error Information Register ${x} */
#define MTU_MC73_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659FAu)

/** \brief 4A00, Configuration Register 0 */
#define MTU_MC74_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065A00u)

/** \brief 4A02, Configuration Register 1 */
#define MTU_MC74_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065A02u)

/** \brief 4A04, MBIST Control Register */
#define MTU_MC74_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065A04u)

/** \brief 4A06, Status Register */
#define MTU_MC74_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065A06u)

/** \brief 4A08, Range Register, single address mode */
#define MTU_MC74_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065A08u)

/** \brief 4A0C, Revision ID Register */
#define MTU_MC74_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065A0Cu)

/** \brief 4A0E, ECC Safety Register */
#define MTU_MC74_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065A0Eu)

/** \brief 4A10, Memory ECC Detection Register */
#define MTU_MC74_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065A10u)

/** \brief 4A12, Error Tracking Register ${x} */
#define MTU_MC74_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A12u)

/** \brief 4A14, Error Tracking Register ${x} */
#define MTU_MC74_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A14u)

/** \brief 4A16, Error Tracking Register ${x} */
#define MTU_MC74_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A16u)

/** \brief 4A18, Error Tracking Register ${x} */
#define MTU_MC74_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A18u)

/** \brief 4A1A, Error Tracking Register ${x} */
#define MTU_MC74_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A1Au)


/** \brief 4A60, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A60u)

/** \brief 4A62, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A62u)

/** \brief 4A64, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A64u)

/** \brief 4A66, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A66u)

/** \brief 4A68, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A68u)

/** \brief 4A6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A6Au)

/** \brief 4A6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A6Cu)

/** \brief 4A6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A6Eu)

/** \brief 4A70, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A70u)

/** \brief 4A72, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A72u)

/** \brief 4A74, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A74u)

/** \brief 4A76, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A76u)

/** \brief 4A78, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A78u)

/** \brief 4A7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A7Au)

/** \brief 4A7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A7Cu)

/** \brief 4A7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A7Eu)

/** \brief 4A80, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A80u)

/** \brief 4A82, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A82u)

/** \brief 4A84, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A84u)

/** \brief 4A86, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A86u)

/** \brief 4A88, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A88u)

/** \brief 4A8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A8Au)

