Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4A8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A8Cu)

/** \brief 4A8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A8Eu)

/** \brief 4A90, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A90u)

/** \brief 4A92, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A92u)

/** \brief 4A94, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A94u)

/** \brief 4A96, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A96u)

/** \brief 4A98, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A98u)

/** \brief 4A9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A9Au)

/** \brief 4A9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A9Cu)

/** \brief 4A9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A9Eu)

/** \brief 4AA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA0u)

/** \brief 4AA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA2u)

/** \brief 4AA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA4u)

/** \brief 4AA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA6u)

/** \brief 4AA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA8u)

/** \brief 4AAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AAAu)

/** \brief 4AAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AACu)

/** \brief 4AAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AAEu)

/** \brief 4AB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB0u)

/** \brief 4AB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB2u)

/** \brief 4AB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB4u)

/** \brief 4AB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB6u)

/** \brief 4AB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB8u)

/** \brief 4ABA, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ABAu)

/** \brief 4ABC, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ABCu)

/** \brief 4ABE, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ABEu)

/** \brief 4AC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC0u)

/** \brief 4AC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC2u)

/** \brief 4AC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC4u)

/** \brief 4AC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC6u)

/** \brief 4AC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC8u)

/** \brief 4ACA, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ACAu)

/** \brief 4ACC, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ACCu)

/** \brief 4ACE, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ACEu)

/** \brief 4AD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD0u)

/** \brief 4AD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD2u)

/** \brief 4AD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD4u)

/** \brief 4AD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD6u)

/** \brief 4AD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD8u)

/** \brief 4ADA, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ADAu)

/** \brief 4ADC, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ADCu)

/** \brief 4ADE, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ADEu)

