Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4AE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AE0u)

/** \brief 4AE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AE2u)

/** \brief 4AE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC74_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AE4u)

/** \brief 4AF2, Error Information Register ${x} */
#define MTU_MC74_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF2u)

/** \brief 4AF4, Error Information Register ${x} */
#define MTU_MC74_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF4u)

/** \brief 4AF6, Error Information Register ${x} */
#define MTU_MC74_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF6u)

/** \brief 4AF8, Error Information Register ${x} */
#define MTU_MC74_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF8u)

/** \brief 4AFA, Error Information Register ${x} */
#define MTU_MC74_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AFAu)

/** \brief 4B00, Configuration Register 0 */
#define MTU_MC75_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065B00u)

/** \brief 4B02, Configuration Register 1 */
#define MTU_MC75_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065B02u)

/** \brief 4B04, MBIST Control Register */
#define MTU_MC75_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065B04u)

/** \brief 4B06, Status Register */
#define MTU_MC75_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065B06u)

/** \brief 4B08, Range Register, single address mode */
#define MTU_MC75_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065B08u)

/** \brief 4B0C, Revision ID Register */
#define MTU_MC75_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065B0Cu)

/** \brief 4B0E, ECC Safety Register */
#define MTU_MC75_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065B0Eu)

/** \brief 4B10, Memory ECC Detection Register */
#define MTU_MC75_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065B10u)

/** \brief 4B12, Error Tracking Register ${x} */
#define MTU_MC75_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B12u)

/** \brief 4B14, Error Tracking Register ${x} */
#define MTU_MC75_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B14u)

/** \brief 4B16, Error Tracking Register ${x} */
#define MTU_MC75_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B16u)

/** \brief 4B18, Error Tracking Register ${x} */
#define MTU_MC75_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B18u)

/** \brief 4B1A, Error Tracking Register ${x} */
#define MTU_MC75_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065B1Au)


/** \brief 4B60, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B60u)

/** \brief 4B62, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B62u)

/** \brief 4B64, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B64u)

/** \brief 4B66, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B66u)

/** \brief 4B68, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B68u)

/** \brief 4B6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B6Au)

/** \brief 4B6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B6Cu)

/** \brief 4B6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B6Eu)

/** \brief 4B70, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B70u)

/** \brief 4B72, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B72u)

/** \brief 4B74, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B74u)

/** \brief 4B76, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B76u)

/** \brief 4B78, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B78u)

/** \brief 4B7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B7Au)

/** \brief 4B7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B7Cu)

/** \brief 4B7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B7Eu)

/** \brief 4B80, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B80u)

/** \brief 4B82, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B82u)

/** \brief 4B84, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B84u)

/** \brief 4B86, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B86u)

/** \brief 4B88, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B88u)

/** \brief 4B8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B8Au)

/** \brief 4B8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B8Cu)

