Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4B8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B8Eu)

/** \brief 4B90, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B90u)

/** \brief 4B92, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B92u)

/** \brief 4B94, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B94u)

/** \brief 4B96, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B96u)

/** \brief 4B98, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B98u)

/** \brief 4B9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B9Au)

/** \brief 4B9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B9Cu)

/** \brief 4B9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065B9Eu)

/** \brief 4BA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA0u)

/** \brief 4BA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA2u)

/** \brief 4BA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA4u)

/** \brief 4BA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA6u)

/** \brief 4BA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA8u)

/** \brief 4BAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BAAu)

/** \brief 4BAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BACu)

/** \brief 4BAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BAEu)

/** \brief 4BB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB0u)

/** \brief 4BB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB2u)

/** \brief 4BB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB4u)

/** \brief 4BB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB6u)

/** \brief 4BB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB8u)

/** \brief 4BBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BBAu)

/** \brief 4BBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BBCu)

/** \brief 4BBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BBEu)

/** \brief 4BC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC0u)

/** \brief 4BC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC2u)

/** \brief 4BC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC4u)

/** \brief 4BC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC6u)

/** \brief 4BC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC8u)

/** \brief 4BCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BCAu)

/** \brief 4BCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BCCu)

/** \brief 4BCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BCEu)

/** \brief 4BD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD0u)

/** \brief 4BD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD2u)

/** \brief 4BD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD4u)

/** \brief 4BD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD6u)

/** \brief 4BD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD8u)

/** \brief 4BDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BDAu)

/** \brief 4BDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BDCu)

/** \brief 4BDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BDEu)

/** \brief 4BE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BE0u)

/** \brief 4BE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BE2u)

/** \brief 4BE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC75_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BE4u)

/** \brief 4BF2, Error Information Register ${x} */
#define MTU_MC75_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF2u)

/** \brief 4BF4, Error Information Register ${x} */
#define MTU_MC75_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF4u)

/** \brief 4BF6, Error Information Register ${x} */
#define MTU_MC75_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF6u)

/** \brief 4BF8, Error Information Register ${x} */
#define MTU_MC75_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF8u)

