Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4D0E, ECC Safety Register */
#define MTU_MC77_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065D0Eu)

/** \brief 4D10, Memory ECC Detection Register */
#define MTU_MC77_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065D10u)

/** \brief 4D12, Error Tracking Register ${x} */
#define MTU_MC77_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065D12u)

/** \brief 4D14, Error Tracking Register ${x} */
#define MTU_MC77_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065D14u)

/** \brief 4D16, Error Tracking Register ${x} */
#define MTU_MC77_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065D16u)

/** \brief 4D18, Error Tracking Register ${x} */
#define MTU_MC77_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065D18u)

/** \brief 4D1A, Error Tracking Register ${x} */
#define MTU_MC77_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065D1Au)

/** \brief 4D60, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D60u)

/** \brief 4D62, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D62u)

/** \brief 4D64, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D64u)

/** \brief 4D66, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D66u)

/** \brief 4D68, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D68u)

/** \brief 4D6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D6Au)

/** \brief 4D6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D6Cu)

/** \brief 4D6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D6Eu)

/** \brief 4D70, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D70u)

/** \brief 4D72, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D72u)

/** \brief 4D74, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D74u)

/** \brief 4D76, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D76u)

/** \brief 4D78, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D78u)

/** \brief 4D7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D7Au)

/** \brief 4D7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D7Cu)

/** \brief 4D7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D7Eu)

/** \brief 4D80, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D80u)

/** \brief 4D82, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D82u)

/** \brief 4D84, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D84u)

/** \brief 4D86, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D86u)

/** \brief 4D88, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D88u)

/** \brief 4D8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D8Au)

/** \brief 4D8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D8Cu)

/** \brief 4D8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D8Eu)

/** \brief 4D90, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D90u)

/** \brief 4D92, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D92u)

/** \brief 4D94, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D94u)

/** \brief 4D96, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D96u)

/** \brief 4D98, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D98u)

/** \brief 4D9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D9Au)

/** \brief 4D9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D9Cu)

/** \brief 4D9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065D9Eu)

/** \brief 4DA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DA0u)

/** \brief 4DA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DA2u)

/** \brief 4DA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DA4u)

/** \brief 4DA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DA6u)

