Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4DA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DA8u)

/** \brief 4DAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DAAu)

/** \brief 4DAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DACu)

/** \brief 4DAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DAEu)

/** \brief 4DB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DB0u)

/** \brief 4DB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DB2u)

/** \brief 4DB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DB4u)

/** \brief 4DB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DB6u)

/** \brief 4DB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DB8u)

/** \brief 4DBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DBAu)

/** \brief 4DBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DBCu)

/** \brief 4DBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DBEu)

/** \brief 4DC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DC0u)

/** \brief 4DC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DC2u)

/** \brief 4DC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DC4u)

/** \brief 4DC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DC6u)

/** \brief 4DC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DC8u)

/** \brief 4DCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DCAu)

/** \brief 4DCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DCCu)

/** \brief 4DCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DCEu)

/** \brief 4DD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DD0u)

/** \brief 4DD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DD2u)

/** \brief 4DD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DD4u)

/** \brief 4DD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DD6u)

/** \brief 4DD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DD8u)

/** \brief 4DDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DDAu)

/** \brief 4DDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DDCu)

/** \brief 4DDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DDEu)

/** \brief 4DE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DE0u)

/** \brief 4DE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DE2u)

/** \brief 4DE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC77_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065DE4u)

/** \brief 4DF2, Error Information Register ${x} */
#define MTU_MC77_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065DF2u)

/** \brief 4DF4, Error Information Register ${x} */
#define MTU_MC77_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065DF4u)

/** \brief 4DF6, Error Information Register ${x} */
#define MTU_MC77_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065DF6u)

/** \brief 4DF8, Error Information Register ${x} */
#define MTU_MC77_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065DF8u)

/** \brief 4DFA, Error Information Register ${x} */
#define MTU_MC77_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065DFAu)

/** \brief 4E00, Configuration Register 0 */
#define MTU_MC78_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065E00u)

/** \brief 4E02, Configuration Register 1 */
#define MTU_MC78_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065E02u)

/** \brief 4E04, MBIST Control Register */
#define MTU_MC78_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065E04u)

/** \brief 4E06, Status Register */
#define MTU_MC78_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065E06u)

/** \brief 4E08, Range Register, single address mode */
#define MTU_MC78_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065E08u)

/** \brief 4E0C, Revision ID Register */
#define MTU_MC78_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065E0Cu)

/** \brief 4E0E, ECC Safety Register */
#define MTU_MC78_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065E0Eu)

/** \brief 4E10, Memory ECC Detection Register */
#define MTU_MC78_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065E10u)

/** \brief 4E12, Error Tracking Register ${x} */
#define MTU_MC78_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E12u)

/** \brief 4E14, Error Tracking Register ${x} */
#define MTU_MC78_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E14u)

/** \brief 4E16, Error Tracking Register ${x} */
#define MTU_MC78_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E16u)

