Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4EB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB0u)

/** \brief 4EB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB2u)

/** \brief 4EB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB4u)

/** \brief 4EB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB6u)

/** \brief 4EB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB8u)

/** \brief 4EBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EBAu)

/** \brief 4EBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EBCu)

/** \brief 4EBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EBEu)

/** \brief 4EC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC0u)

/** \brief 4EC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC2u)

/** \brief 4EC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC4u)

/** \brief 4EC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC6u)

/** \brief 4EC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC8u)

/** \brief 4ECA, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ECAu)

/** \brief 4ECC, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ECCu)

/** \brief 4ECE, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ECEu)

/** \brief 4ED0, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED0u)

/** \brief 4ED2, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED2u)

/** \brief 4ED4, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED4u)

/** \brief 4ED6, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED6u)

/** \brief 4ED8, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED8u)

/** \brief 4EDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EDAu)

/** \brief 4EDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EDCu)

/** \brief 4EDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EDEu)

/** \brief 4EE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EE0u)

/** \brief 4EE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EE2u)

/** \brief 4EE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC78_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EE4u)

/** \brief 4EF2, Error Information Register ${x} */
#define MTU_MC78_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF2u)

/** \brief 4EF4, Error Information Register ${x} */
#define MTU_MC78_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF4u)

/** \brief 4EF6, Error Information Register ${x} */
#define MTU_MC78_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF6u)

/** \brief 4EF8, Error Information Register ${x} */
#define MTU_MC78_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF8u)

/** \brief 4EFA, Error Information Register ${x} */
#define MTU_MC78_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EFAu)

/** \brief 4F00, Configuration Register 0 */
#define MTU_MC79_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065F00u)

/** \brief 4F02, Configuration Register 1 */
#define MTU_MC79_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065F02u)

/** \brief 4F04, MBIST Control Register */
#define MTU_MC79_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065F04u)

/** \brief 4F06, Status Register */
#define MTU_MC79_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065F06u)

/** \brief 4F08, Range Register, single address mode */
#define MTU_MC79_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065F08u)

/** \brief 4F0C, Revision ID Register */
#define MTU_MC79_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065F0Cu)

/** \brief 4F0E, ECC Safety Register */
#define MTU_MC79_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065F0Eu)

/** \brief 4F10, Memory ECC Detection Register */
#define MTU_MC79_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065F10u)

/** \brief 4F12, Error Tracking Register ${x} */
#define MTU_MC79_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F12u)

/** \brief 4F14, Error Tracking Register ${x} */
#define MTU_MC79_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F14u)

/** \brief 4F16, Error Tracking Register ${x} */
#define MTU_MC79_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F16u)

/** \brief 4F18, Error Tracking Register ${x} */
#define MTU_MC79_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F18u)

