Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4F1A, Error Tracking Register ${x} */
#define MTU_MC79_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F1Au)


/** \brief 4F60, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F60u)

/** \brief 4F62, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F62u)

/** \brief 4F64, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F64u)

/** \brief 4F66, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F66u)

/** \brief 4F68, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F68u)

/** \brief 4F6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F6Au)

/** \brief 4F6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F6Cu)

/** \brief 4F6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F6Eu)

/** \brief 4F70, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F70u)

/** \brief 4F72, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F72u)

/** \brief 4F74, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F74u)

/** \brief 4F76, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F76u)

/** \brief 4F78, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F78u)

/** \brief 4F7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F7Au)

/** \brief 4F7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F7Cu)

/** \brief 4F7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F7Eu)

/** \brief 4F80, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F80u)

/** \brief 4F82, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F82u)

/** \brief 4F84, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F84u)

/** \brief 4F86, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F86u)

/** \brief 4F88, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F88u)

/** \brief 4F8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F8Au)

/** \brief 4F8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F8Cu)

/** \brief 4F8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F8Eu)

/** \brief 4F90, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F90u)

/** \brief 4F92, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F92u)

/** \brief 4F94, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F94u)

/** \brief 4F96, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F96u)

/** \brief 4F98, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F98u)

/** \brief 4F9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F9Au)

/** \brief 4F9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F9Cu)

/** \brief 4F9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F9Eu)

/** \brief 4FA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA0u)

/** \brief 4FA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA2u)

/** \brief 4FA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA4u)

/** \brief 4FA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA6u)

/** \brief 4FA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA8u)

/** \brief 4FAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FAAu)

/** \brief 4FAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FACu)

/** \brief 4FAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FAEu)

/** \brief 4FB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB0u)

/** \brief 4FB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB2u)

/** \brief 4FB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB4u)

