Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 4FB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB6u)

/** \brief 4FB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB8u)

/** \brief 4FBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FBAu)

/** \brief 4FBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FBCu)

/** \brief 4FBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FBEu)

/** \brief 4FC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC0u)

/** \brief 4FC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC2u)

/** \brief 4FC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC4u)

/** \brief 4FC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC6u)

/** \brief 4FC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC8u)

/** \brief 4FCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FCAu)

/** \brief 4FCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FCCu)

/** \brief 4FCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FCEu)

/** \brief 4FD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD0u)

/** \brief 4FD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD2u)

/** \brief 4FD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD4u)

/** \brief 4FD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD6u)

/** \brief 4FD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD8u)

/** \brief 4FDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FDAu)

/** \brief 4FDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FDCu)

/** \brief 4FDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FDEu)

/** \brief 4FE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FE0u)

/** \brief 4FE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FE2u)

/** \brief 4FE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC79_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FE4u)

/** \brief 4FF2, Error Information Register ${x} */
#define MTU_MC79_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF2u)

/** \brief 4FF4, Error Information Register ${x} */
#define MTU_MC79_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF4u)

/** \brief 4FF6, Error Information Register ${x} */
#define MTU_MC79_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF6u)

/** \brief 4FF8, Error Information Register ${x} */
#define MTU_MC79_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF8u)

/** \brief 4FFA, Error Information Register ${x} */
#define MTU_MC79_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FFAu)

/** \brief 5000, Configuration Register 0 */
#define MTU_MC80_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066000u)

/** \brief 5002, Configuration Register 1 */
#define MTU_MC80_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066002u)

/** \brief 5004, MBIST Control Register */
#define MTU_MC80_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066004u)

/** \brief 5006, Status Register */
#define MTU_MC80_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066006u)

/** \brief 5008, Range Register, single address mode */
#define MTU_MC80_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066008u)

/** \brief 500C, Revision ID Register */
#define MTU_MC80_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006600Cu)

/** \brief 500E, ECC Safety Register */
#define MTU_MC80_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006600Eu)

/** \brief 5010, Memory ECC Detection Register */
#define MTU_MC80_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066010u)

/** \brief 5012, Error Tracking Register ${x} */
#define MTU_MC80_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066012u)

/** \brief 5014, Error Tracking Register ${x} */
#define MTU_MC80_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066014u)

/** \brief 5016, Error Tracking Register ${x} */
#define MTU_MC80_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066016u)

/** \brief 5018, Error Tracking Register ${x} */
#define MTU_MC80_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066018u)

/** \brief 501A, Error Tracking Register ${x} */
#define MTU_MC80_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006601Au)


/** \brief 5060, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066060u)

