Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5062, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066062u)

/** \brief 5064, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066064u)

/** \brief 5066, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066066u)

/** \brief 5068, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066068u)

/** \brief 506A, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006606Au)

/** \brief 506C, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006606Cu)

/** \brief 506E, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006606Eu)

/** \brief 5070, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066070u)

/** \brief 5072, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066072u)

/** \brief 5074, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066074u)

/** \brief 5076, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066076u)

/** \brief 5078, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066078u)

/** \brief 507A, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006607Au)

/** \brief 507C, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006607Cu)

/** \brief 507E, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006607Eu)

/** \brief 5080, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066080u)

/** \brief 5082, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066082u)

/** \brief 5084, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066084u)

/** \brief 5086, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066086u)

/** \brief 5088, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066088u)

/** \brief 508A, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006608Au)

/** \brief 508C, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006608Cu)

/** \brief 508E, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006608Eu)

/** \brief 5090, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066090u)

/** \brief 5092, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066092u)

/** \brief 5094, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066094u)

/** \brief 5096, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066096u)

/** \brief 5098, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066098u)

/** \brief 509A, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006609Au)

/** \brief 509C, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006609Cu)

/** \brief 509E, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006609Eu)

/** \brief 50A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A0u)

/** \brief 50A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A2u)

/** \brief 50A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A4u)

/** \brief 50A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A6u)

/** \brief 50A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A8u)

/** \brief 50AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660AAu)

/** \brief 50AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660ACu)

/** \brief 50AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660AEu)

/** \brief 50B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B0u)

/** \brief 50B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B2u)

/** \brief 50B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B4u)

/** \brief 50B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B6u)

/** \brief 50B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B8u)

