Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 50BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660BAu)

/** \brief 50BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660BCu)

/** \brief 50BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660BEu)

/** \brief 50C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C0u)

/** \brief 50C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C2u)

/** \brief 50C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C4u)

/** \brief 50C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C6u)

/** \brief 50C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C8u)

/** \brief 50CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660CAu)

/** \brief 50CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660CCu)

/** \brief 50CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660CEu)

/** \brief 50D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D0u)

/** \brief 50D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D2u)

/** \brief 50D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D4u)

/** \brief 50D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D6u)

/** \brief 50D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D8u)

/** \brief 50DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660DAu)

/** \brief 50DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660DCu)

/** \brief 50DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660DEu)

/** \brief 50E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660E0u)

/** \brief 50E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660E2u)

/** \brief 50E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC80_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660E4u)

/** \brief 50F2, Error Information Register ${x} */
#define MTU_MC80_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F2u)

/** \brief 50F4, Error Information Register ${x} */
#define MTU_MC80_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F4u)

/** \brief 50F6, Error Information Register ${x} */
#define MTU_MC80_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F6u)

/** \brief 50F8, Error Information Register ${x} */
#define MTU_MC80_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F8u)

/** \brief 50FA, Error Information Register ${x} */
#define MTU_MC80_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660FAu)

/** \brief 5100, Configuration Register 0 */
#define MTU_MC81_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066100u)

/** \brief 5102, Configuration Register 1 */
#define MTU_MC81_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066102u)

/** \brief 5104, MBIST Control Register */
#define MTU_MC81_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066104u)

/** \brief 5106, Status Register */
#define MTU_MC81_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066106u)

/** \brief 5108, Range Register, single address mode */
#define MTU_MC81_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066108u)

/** \brief 510C, Revision ID Register */
#define MTU_MC81_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006610Cu)

/** \brief 510E, ECC Safety Register */
#define MTU_MC81_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006610Eu)

/** \brief 5110, Memory ECC Detection Register */
#define MTU_MC81_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066110u)

/** \brief 5112, Error Tracking Register ${x} */
#define MTU_MC81_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066112u)

/** \brief 5114, Error Tracking Register ${x} */
#define MTU_MC81_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066114u)

/** \brief 5116, Error Tracking Register ${x} */
#define MTU_MC81_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066116u)

/** \brief 5118, Error Tracking Register ${x} */
#define MTU_MC81_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066118u)

/** \brief 511A, Error Tracking Register ${x} */
#define MTU_MC81_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006611Au)


/** \brief 5160, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066160u)

/** \brief 5162, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066162u)

/** \brief 5164, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066164u)

/** \brief 5166, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066166u)

