Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5168, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066168u)

/** \brief 516A, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006616Au)

/** \brief 516C, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006616Cu)

/** \brief 516E, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006616Eu)

/** \brief 5170, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066170u)

/** \brief 5172, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066172u)

/** \brief 5174, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066174u)

/** \brief 5176, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066176u)

/** \brief 5178, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066178u)

/** \brief 517A, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006617Au)

/** \brief 517C, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006617Cu)

/** \brief 517E, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006617Eu)

/** \brief 5180, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066180u)

/** \brief 5182, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066182u)

/** \brief 5184, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066184u)

/** \brief 5186, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066186u)

/** \brief 5188, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066188u)

/** \brief 518A, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006618Au)

/** \brief 518C, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006618Cu)

/** \brief 518E, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006618Eu)

/** \brief 5190, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066190u)

/** \brief 5192, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066192u)

/** \brief 5194, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066194u)

/** \brief 5196, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066196u)

/** \brief 5198, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066198u)

/** \brief 519A, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006619Au)

/** \brief 519C, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006619Cu)

/** \brief 519E, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006619Eu)

/** \brief 51A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A0u)

/** \brief 51A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A2u)

/** \brief 51A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A4u)

/** \brief 51A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A6u)

/** \brief 51A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A8u)

/** \brief 51AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661AAu)

/** \brief 51AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661ACu)

/** \brief 51AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661AEu)

/** \brief 51B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B0u)

/** \brief 51B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B2u)

/** \brief 51B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B4u)

/** \brief 51B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B6u)

/** \brief 51B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B8u)

/** \brief 51BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661BAu)

/** \brief 51BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661BCu)

/** \brief 51BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661BEu)

/** \brief 51C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC81_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661C0u)

