Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5276, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066276u)

/** \brief 5278, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066278u)

/** \brief 527A, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006627Au)

/** \brief 527C, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006627Cu)

/** \brief 527E, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006627Eu)

/** \brief 5280, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066280u)

/** \brief 5282, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066282u)

/** \brief 5284, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066284u)

/** \brief 5286, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066286u)

/** \brief 5288, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066288u)

/** \brief 528A, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006628Au)

/** \brief 528C, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006628Cu)

/** \brief 528E, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006628Eu)

/** \brief 5290, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066290u)

/** \brief 5292, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066292u)

/** \brief 5294, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066294u)

/** \brief 5296, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066296u)

/** \brief 5298, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066298u)

/** \brief 529A, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006629Au)

/** \brief 529C, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006629Cu)

/** \brief 529E, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006629Eu)

/** \brief 52A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A0u)

/** \brief 52A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A2u)

/** \brief 52A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A4u)

/** \brief 52A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A6u)

/** \brief 52A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A8u)

/** \brief 52AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662AAu)

/** \brief 52AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662ACu)

/** \brief 52AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662AEu)

/** \brief 52B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B0u)

/** \brief 52B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B2u)

/** \brief 52B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B4u)

/** \brief 52B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B6u)

/** \brief 52B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B8u)

/** \brief 52BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662BAu)

/** \brief 52BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662BCu)

/** \brief 52BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662BEu)

/** \brief 52C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C0u)

/** \brief 52C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C2u)

/** \brief 52C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C4u)

/** \brief 52C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C6u)

/** \brief 52C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662C8u)

/** \brief 52CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662CAu)

/** \brief 52CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662CCu)

