Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 52CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662CEu)

/** \brief 52D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D0u)

/** \brief 52D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D2u)

/** \brief 52D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D4u)

/** \brief 52D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D6u)

/** \brief 52D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662D8u)

/** \brief 52DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662DAu)

/** \brief 52DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662DCu)

/** \brief 52DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662DEu)

/** \brief 52E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662E0u)

/** \brief 52E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662E2u)

/** \brief 52E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC82_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662E4u)

/** \brief 52F2, Error Information Register ${x} */
#define MTU_MC82_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F2u)

/** \brief 52F4, Error Information Register ${x} */
#define MTU_MC82_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F4u)

/** \brief 52F6, Error Information Register ${x} */
#define MTU_MC82_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F6u)

/** \brief 52F8, Error Information Register ${x} */
#define MTU_MC82_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662F8u)

/** \brief 52FA, Error Information Register ${x} */
#define MTU_MC82_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00662FAu)

/** \brief 5300, Configuration Register 0 */
#define MTU_MC83_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066300u)

/** \brief 5302, Configuration Register 1 */
#define MTU_MC83_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066302u)

/** \brief 5304, MBIST Control Register */
#define MTU_MC83_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066304u)

/** \brief 5306, Status Register */
#define MTU_MC83_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066306u)

/** \brief 5308, Range Register, single address mode */
#define MTU_MC83_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066308u)

/** \brief 530C, Revision ID Register */
#define MTU_MC83_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006630Cu)

/** \brief 530E, ECC Safety Register */
#define MTU_MC83_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006630Eu)

/** \brief 5310, Memory ECC Detection Register */
#define MTU_MC83_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066310u)

/** \brief 5312, Error Tracking Register ${x} */
#define MTU_MC83_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066312u)

/** \brief 5314, Error Tracking Register ${x} */
#define MTU_MC83_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066314u)

/** \brief 5316, Error Tracking Register ${x} */
#define MTU_MC83_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066316u)

/** \brief 5318, Error Tracking Register ${x} */
#define MTU_MC83_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066318u)

/** \brief 531A, Error Tracking Register ${x} */
#define MTU_MC83_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006631Au)


/** \brief 5360, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066360u)

/** \brief 5362, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066362u)

/** \brief 5364, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066364u)

/** \brief 5366, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066366u)

/** \brief 5368, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066368u)

/** \brief 536A, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006636Au)

/** \brief 536C, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006636Cu)

/** \brief 536E, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006636Eu)

/** \brief 5370, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066370u)

/** \brief 5372, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066372u)

/** \brief 5374, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066374u)

/** \brief 5376, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066376u)

/** \brief 5378, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066378u)

