Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 537A, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006637Au)

/** \brief 537C, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006637Cu)

/** \brief 537E, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006637Eu)

/** \brief 5380, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066380u)

/** \brief 5382, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066382u)

/** \brief 5384, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066384u)

/** \brief 5386, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066386u)

/** \brief 5388, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066388u)

/** \brief 538A, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006638Au)

/** \brief 538C, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006638Cu)

/** \brief 538E, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006638Eu)

/** \brief 5390, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066390u)

/** \brief 5392, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066392u)

/** \brief 5394, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066394u)

/** \brief 5396, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066396u)

/** \brief 5398, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066398u)

/** \brief 539A, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006639Au)

/** \brief 539C, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006639Cu)

/** \brief 539E, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006639Eu)

/** \brief 53A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A0u)

/** \brief 53A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A2u)

/** \brief 53A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A4u)

/** \brief 53A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A6u)

/** \brief 53A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A8u)

/** \brief 53AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663AAu)

/** \brief 53AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663ACu)

/** \brief 53AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663AEu)

/** \brief 53B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B0u)

/** \brief 53B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B2u)

/** \brief 53B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B4u)

/** \brief 53B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B6u)

/** \brief 53B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B8u)

/** \brief 53BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663BAu)

/** \brief 53BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663BCu)

/** \brief 53BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663BEu)

/** \brief 53C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C0u)

/** \brief 53C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C2u)

/** \brief 53C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C4u)

/** \brief 53C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C6u)

/** \brief 53C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C8u)

/** \brief 53CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663CAu)

/** \brief 53CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663CCu)

/** \brief 53CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663CEu)

/** \brief 53D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC83_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663D0u)

