Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 54D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC84_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664D8u)

/** \brief 54DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC84_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664DAu)

/** \brief 54DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC84_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664DCu)

/** \brief 54DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC84_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664DEu)

/** \brief 54E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC84_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664E0u)

/** \brief 54E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC84_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664E2u)

/** \brief 54E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC84_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664E4u)

/** \brief 54F2, Error Information Register ${x} */
#define MTU_MC84_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00664F2u)

/** \brief 54F4, Error Information Register ${x} */
#define MTU_MC84_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00664F4u)

/** \brief 54F6, Error Information Register ${x} */
#define MTU_MC84_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00664F6u)

/** \brief 54F8, Error Information Register ${x} */
#define MTU_MC84_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00664F8u)

/** \brief 54FA, Error Information Register ${x} */
#define MTU_MC84_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00664FAu)

/** \brief 5500, Configuration Register 0 */
#define MTU_MC85_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066500u)

/** \brief 5502, Configuration Register 1 */
#define MTU_MC85_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066502u)

/** \brief 5504, MBIST Control Register */
#define MTU_MC85_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066504u)

/** \brief 5506, Status Register */
#define MTU_MC85_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066506u)

/** \brief 5508, Range Register, single address mode */
#define MTU_MC85_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066508u)

/** \brief 550C, Revision ID Register */
#define MTU_MC85_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006650Cu)

/** \brief 550E, ECC Safety Register */
#define MTU_MC85_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006650Eu)

/** \brief 5510, Memory ECC Detection Register */
#define MTU_MC85_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066510u)

/** \brief 5512, Error Tracking Register ${x} */
#define MTU_MC85_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066512u)

/** \brief 5514, Error Tracking Register ${x} */
#define MTU_MC85_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066514u)

/** \brief 5516, Error Tracking Register ${x} */
#define MTU_MC85_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066516u)

/** \brief 5518, Error Tracking Register ${x} */
#define MTU_MC85_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066518u)

/** \brief 551A, Error Tracking Register ${x} */
#define MTU_MC85_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006651Au)


/** \brief 5560, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066560u)

/** \brief 5562, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066562u)

/** \brief 5564, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066564u)

/** \brief 5566, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066566u)

/** \brief 5568, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066568u)

/** \brief 556A, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006656Au)

/** \brief 556C, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006656Cu)

/** \brief 556E, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006656Eu)

/** \brief 5570, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066570u)

/** \brief 5572, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066572u)

/** \brief 5574, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066574u)

/** \brief 5576, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066576u)

/** \brief 5578, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066578u)

/** \brief 557A, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006657Au)

/** \brief 557C, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006657Cu)

/** \brief 557E, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006657Eu)

/** \brief 5580, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066580u)

/** \brief 5582, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066582u)

