Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5584, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066584u)

/** \brief 5586, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066586u)

/** \brief 5588, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066588u)

/** \brief 558A, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006658Au)

/** \brief 558C, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006658Cu)

/** \brief 558E, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006658Eu)

/** \brief 5590, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066590u)

/** \brief 5592, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066592u)

/** \brief 5594, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066594u)

/** \brief 5596, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066596u)

/** \brief 5598, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066598u)

/** \brief 559A, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006659Au)

/** \brief 559C, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006659Cu)

/** \brief 559E, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006659Eu)

/** \brief 55A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A0u)

/** \brief 55A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A2u)

/** \brief 55A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A4u)

/** \brief 55A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A6u)

/** \brief 55A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A8u)

/** \brief 55AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665AAu)

/** \brief 55AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665ACu)

/** \brief 55AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665AEu)

/** \brief 55B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B0u)

/** \brief 55B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B2u)

/** \brief 55B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B4u)

/** \brief 55B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B6u)

/** \brief 55B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B8u)

/** \brief 55BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665BAu)

/** \brief 55BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665BCu)

/** \brief 55BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665BEu)

/** \brief 55C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C0u)

/** \brief 55C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C2u)

/** \brief 55C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C4u)

/** \brief 55C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C6u)

/** \brief 55C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C8u)

/** \brief 55CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665CAu)

/** \brief 55CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665CCu)

/** \brief 55CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665CEu)

/** \brief 55D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D0u)

/** \brief 55D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D2u)

/** \brief 55D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D4u)

/** \brief 55D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D6u)

/** \brief 55D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D8u)

/** \brief 55DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665DAu)

