Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 55DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665DCu)

/** \brief 55DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665DEu)

/** \brief 55E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665E0u)

/** \brief 55E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665E2u)

/** \brief 55E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC85_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665E4u)

/** \brief 55F2, Error Information Register ${x} */
#define MTU_MC85_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F2u)

/** \brief 55F4, Error Information Register ${x} */
#define MTU_MC85_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F4u)

/** \brief 55F6, Error Information Register ${x} */
#define MTU_MC85_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F6u)

/** \brief 55F8, Error Information Register ${x} */
#define MTU_MC85_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F8u)

/** \brief 55FA, Error Information Register ${x} */
#define MTU_MC85_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665FAu)

/** \brief 5600, Configuration Register 0 */
#define MTU_MC86_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066600u)

/** \brief 5602, Configuration Register 1 */
#define MTU_MC86_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066602u)

/** \brief 5604, MBIST Control Register */
#define MTU_MC86_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066604u)

/** \brief 5606, Status Register */
#define MTU_MC86_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066606u)

/** \brief 5608, Range Register, single address mode */
#define MTU_MC86_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066608u)

/** \brief 560C, Revision ID Register */
#define MTU_MC86_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006660Cu)

/** \brief 560E, ECC Safety Register */
#define MTU_MC86_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006660Eu)

/** \brief 5610, Memory ECC Detection Register */
#define MTU_MC86_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066610u)

/** \brief 5612, Error Tracking Register ${x} */
#define MTU_MC86_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066612u)

/** \brief 5614, Error Tracking Register ${x} */
#define MTU_MC86_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066614u)

/** \brief 5616, Error Tracking Register ${x} */
#define MTU_MC86_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066616u)

/** \brief 5618, Error Tracking Register ${x} */
#define MTU_MC86_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066618u)

/** \brief 561A, Error Tracking Register ${x} */
#define MTU_MC86_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006661Au)


/** \brief 5660, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066660u)

/** \brief 5662, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066662u)

/** \brief 5664, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066664u)

/** \brief 5666, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066666u)

/** \brief 5668, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066668u)

/** \brief 566A, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006666Au)

/** \brief 566C, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006666Cu)

/** \brief 566E, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006666Eu)

/** \brief 5670, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066670u)

/** \brief 5672, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066672u)

/** \brief 5674, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066674u)

/** \brief 5676, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066676u)

/** \brief 5678, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066678u)

/** \brief 567A, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006667Au)

/** \brief 567C, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006667Cu)

/** \brief 567E, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006667Eu)

/** \brief 5680, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066680u)

/** \brief 5682, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066682u)

/** \brief 5684, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066684u)

/** \brief 5686, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066686u)

/** \brief 5688, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066688u)

/** \brief 568A, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006668Au)

