Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 568C, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006668Cu)

/** \brief 568E, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006668Eu)

/** \brief 5690, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066690u)

/** \brief 5692, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066692u)

/** \brief 5694, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066694u)

/** \brief 5696, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066696u)

/** \brief 5698, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066698u)

/** \brief 569A, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006669Au)

/** \brief 569C, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006669Cu)

/** \brief 569E, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006669Eu)

/** \brief 56A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A0u)

/** \brief 56A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A2u)

/** \brief 56A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A4u)

/** \brief 56A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A6u)

/** \brief 56A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A8u)

/** \brief 56AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666AAu)

/** \brief 56AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666ACu)

/** \brief 56AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666AEu)

/** \brief 56B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B0u)

/** \brief 56B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B2u)

/** \brief 56B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B4u)

/** \brief 56B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B6u)

/** \brief 56B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B8u)

/** \brief 56BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666BAu)

/** \brief 56BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666BCu)

/** \brief 56BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666BEu)

/** \brief 56C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C0u)

/** \brief 56C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C2u)

/** \brief 56C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C4u)

/** \brief 56C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C6u)

/** \brief 56C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C8u)

/** \brief 56CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666CAu)

/** \brief 56CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666CCu)

/** \brief 56CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666CEu)

/** \brief 56D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D0u)

/** \brief 56D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D2u)

/** \brief 56D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D4u)

/** \brief 56D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D6u)

/** \brief 56D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D8u)

/** \brief 56DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666DAu)

/** \brief 56DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666DCu)

/** \brief 56DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666DEu)

