Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 56E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666E0u)

/** \brief 56E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666E2u)

/** \brief 56E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC86_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666E4u)

/** \brief 56F2, Error Information Register ${x} */
#define MTU_MC86_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F2u)

/** \brief 56F4, Error Information Register ${x} */
#define MTU_MC86_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F4u)

/** \brief 56F6, Error Information Register ${x} */
#define MTU_MC86_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F6u)

/** \brief 56F8, Error Information Register ${x} */
#define MTU_MC86_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F8u)

/** \brief 56FA, Error Information Register ${x} */
#define MTU_MC86_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666FAu)

/** \brief 5700, Configuration Register 0 */
#define MTU_MC87_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066700u)

/** \brief 5702, Configuration Register 1 */
#define MTU_MC87_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066702u)

/** \brief 5704, MBIST Control Register */
#define MTU_MC87_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066704u)

/** \brief 5706, Status Register */
#define MTU_MC87_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066706u)

/** \brief 5708, Range Register, single address mode */
#define MTU_MC87_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066708u)

/** \brief 570C, Revision ID Register */
#define MTU_MC87_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006670Cu)

/** \brief 570E, ECC Safety Register */
#define MTU_MC87_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006670Eu)

/** \brief 5710, Memory ECC Detection Register */
#define MTU_MC87_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066710u)

/** \brief 5712, Error Tracking Register ${x} */
#define MTU_MC87_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066712u)

/** \brief 5714, Error Tracking Register ${x} */
#define MTU_MC87_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066714u)

/** \brief 5716, Error Tracking Register ${x} */
#define MTU_MC87_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066716u)

/** \brief 5718, Error Tracking Register ${x} */
#define MTU_MC87_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066718u)

/** \brief 571A, Error Tracking Register ${x} */
#define MTU_MC87_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006671Au)


/** \brief 5760, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066760u)

/** \brief 5762, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066762u)

/** \brief 5764, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066764u)

/** \brief 5766, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066766u)

/** \brief 5768, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066768u)

/** \brief 576A, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006676Au)

/** \brief 576C, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006676Cu)

/** \brief 576E, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006676Eu)

/** \brief 5770, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066770u)

/** \brief 5772, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066772u)

/** \brief 5774, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066774u)

/** \brief 5776, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066776u)

/** \brief 5778, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066778u)

/** \brief 577A, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006677Au)

/** \brief 577C, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006677Cu)

/** \brief 577E, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006677Eu)

/** \brief 5780, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066780u)

/** \brief 5782, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066782u)

/** \brief 5784, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066784u)

/** \brief 5786, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066786u)

/** \brief 5788, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066788u)

/** \brief 578A, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006678Au)

/** \brief 578C, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006678Cu)

