Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 578E, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006678Eu)

/** \brief 5790, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066790u)

/** \brief 5792, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066792u)

/** \brief 5794, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066794u)

/** \brief 5796, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066796u)

/** \brief 5798, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066798u)

/** \brief 579A, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006679Au)

/** \brief 579C, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006679Cu)

/** \brief 579E, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006679Eu)

/** \brief 57A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A0u)

/** \brief 57A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A2u)

/** \brief 57A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A4u)

/** \brief 57A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A6u)

/** \brief 57A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A8u)

/** \brief 57AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667AAu)

/** \brief 57AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667ACu)

/** \brief 57AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667AEu)

/** \brief 57B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B0u)

/** \brief 57B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B2u)

/** \brief 57B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B4u)

/** \brief 57B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B6u)

/** \brief 57B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B8u)

/** \brief 57BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667BAu)

/** \brief 57BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667BCu)

/** \brief 57BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667BEu)

/** \brief 57C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C0u)

/** \brief 57C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C2u)

/** \brief 57C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C4u)

/** \brief 57C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C6u)

/** \brief 57C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C8u)

/** \brief 57CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667CAu)

/** \brief 57CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667CCu)

/** \brief 57CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667CEu)

/** \brief 57D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D0u)

/** \brief 57D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D2u)

/** \brief 57D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D4u)

/** \brief 57D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D6u)

/** \brief 57D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D8u)

/** \brief 57DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667DAu)

/** \brief 57DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667DCu)

/** \brief 57DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667DEu)

/** \brief 57E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667E0u)

/** \brief 57E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667E2u)

/** \brief 57E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC87_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667E4u)

/** \brief 57F2, Error Information Register ${x} */
#define MTU_MC87_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F2u)

/** \brief 57F4, Error Information Register ${x} */
#define MTU_MC87_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F4u)

