Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 57F6, Error Information Register ${x} */
#define MTU_MC87_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F6u)

/** \brief 57F8, Error Information Register ${x} */
#define MTU_MC87_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F8u)

/** \brief 57FA, Error Information Register ${x} */
#define MTU_MC87_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667FAu)

/** \brief 5800, Configuration Register 0 */
#define MTU_MC88_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066800u)

/** \brief 5802, Configuration Register 1 */
#define MTU_MC88_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066802u)

/** \brief 5804, MBIST Control Register */
#define MTU_MC88_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066804u)

/** \brief 5806, Status Register */
#define MTU_MC88_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066806u)

/** \brief 5808, Range Register, single address mode */
#define MTU_MC88_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066808u)

/** \brief 580C, Revision ID Register */
#define MTU_MC88_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006680Cu)

/** \brief 580E, ECC Safety Register */
#define MTU_MC88_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006680Eu)

/** \brief 5810, Memory ECC Detection Register */
#define MTU_MC88_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066810u)

/** \brief 5812, Error Tracking Register ${x} */
#define MTU_MC88_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066812u)

/** \brief 5814, Error Tracking Register ${x} */
#define MTU_MC88_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066814u)

/** \brief 5816, Error Tracking Register ${x} */
#define MTU_MC88_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066816u)

/** \brief 5818, Error Tracking Register ${x} */
#define MTU_MC88_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066818u)

/** \brief 581A, Error Tracking Register ${x} */
#define MTU_MC88_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006681Au)


/** \brief 5860, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066860u)

/** \brief 5862, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066862u)

/** \brief 5864, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066864u)

/** \brief 5866, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066866u)

/** \brief 5868, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066868u)

/** \brief 586A, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006686Au)

/** \brief 586C, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006686Cu)

/** \brief 586E, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006686Eu)

/** \brief 5870, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066870u)

/** \brief 5872, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066872u)

/** \brief 5874, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066874u)

/** \brief 5876, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066876u)

/** \brief 5878, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066878u)

/** \brief 587A, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006687Au)

/** \brief 587C, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006687Cu)

/** \brief 587E, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006687Eu)

/** \brief 5880, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066880u)

/** \brief 5882, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066882u)

/** \brief 5884, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066884u)

/** \brief 5886, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066886u)

/** \brief 5888, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066888u)

/** \brief 588A, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006688Au)

/** \brief 588C, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006688Cu)

/** \brief 588E, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006688Eu)

/** \brief 5890, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066890u)

/** \brief 5892, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066892u)

/** \brief 5894, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066894u)

/** \brief 5896, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066896u)

