Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5898, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066898u)

/** \brief 589A, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006689Au)

/** \brief 589C, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006689Cu)

/** \brief 589E, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006689Eu)

/** \brief 58A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668A0u)

/** \brief 58A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668A2u)

/** \brief 58A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668A4u)

/** \brief 58A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668A6u)

/** \brief 58A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668A8u)

/** \brief 58AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668AAu)

/** \brief 58AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668ACu)

/** \brief 58AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668AEu)

/** \brief 58B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668B0u)

/** \brief 58B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668B2u)

/** \brief 58B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668B4u)

/** \brief 58B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668B6u)

/** \brief 58B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668B8u)

/** \brief 58BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668BAu)

/** \brief 58BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668BCu)

/** \brief 58BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668BEu)

/** \brief 58C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668C0u)

/** \brief 58C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668C2u)

/** \brief 58C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668C4u)

/** \brief 58C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668C6u)

/** \brief 58C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668C8u)

/** \brief 58CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668CAu)

/** \brief 58CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668CCu)

/** \brief 58CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668CEu)

/** \brief 58D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668D0u)

/** \brief 58D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668D2u)

/** \brief 58D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668D4u)

/** \brief 58D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668D6u)

/** \brief 58D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668D8u)

/** \brief 58DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668DAu)

/** \brief 58DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668DCu)

/** \brief 58DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668DEu)

/** \brief 58E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668E0u)

/** \brief 58E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668E2u)

/** \brief 58E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC88_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00668E4u)

/** \brief 58F2, Error Information Register ${x} */
#define MTU_MC88_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00668F2u)

/** \brief 58F4, Error Information Register ${x} */
#define MTU_MC88_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00668F4u)

/** \brief 58F6, Error Information Register ${x} */
#define MTU_MC88_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00668F6u)

/** \brief 58F8, Error Information Register ${x} */
#define MTU_MC88_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00668F8u)

