Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 599C, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006699Cu)

/** \brief 599E, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006699Eu)

/** \brief 59A0, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A0u)

/** \brief 59A2, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A2u)

/** \brief 59A4, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A4u)

/** \brief 59A6, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A6u)

/** \brief 59A8, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A8u)

/** \brief 59AA, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669AAu)

/** \brief 59AC, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669ACu)

/** \brief 59AE, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669AEu)

/** \brief 59B0, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B0u)

/** \brief 59B2, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B2u)

/** \brief 59B4, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B4u)

/** \brief 59B6, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B6u)

/** \brief 59B8, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B8u)

/** \brief 59BA, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669BAu)

/** \brief 59BC, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669BCu)

/** \brief 59BE, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669BEu)

/** \brief 59C0, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C0u)

/** \brief 59C2, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C2u)

/** \brief 59C4, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C4u)

/** \brief 59C6, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C6u)

/** \brief 59C8, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C8u)

/** \brief 59CA, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669CAu)

/** \brief 59CC, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669CCu)

/** \brief 59CE, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669CEu)

/** \brief 59D0, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D0u)

/** \brief 59D2, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D2u)

/** \brief 59D4, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D4u)

/** \brief 59D6, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D6u)

/** \brief 59D8, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D8u)

/** \brief 59DA, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669DAu)

/** \brief 59DC, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669DCu)

/** \brief 59DE, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669DEu)

/** \brief 59E0, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669E0u)

/** \brief 59E2, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669E2u)

/** \brief 59E4, Read Data and Bit Flip Register ${y} */
#define MTU_MC89_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669E4u)

/** \brief 59F2, Error Information Register ${x} */
#define MTU_MC89_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F2u)

/** \brief 59F4, Error Information Register ${x} */
#define MTU_MC89_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F4u)

/** \brief 59F6, Error Information Register ${x} */
#define MTU_MC89_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F6u)

/** \brief 59F8, Error Information Register ${x} */
#define MTU_MC89_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F8u)

/** \brief 59FA, Error Information Register ${x} */
#define MTU_MC89_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669FAu)

