Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5AA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AA2u)

/** \brief 5AA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AA4u)

/** \brief 5AA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AA6u)

/** \brief 5AA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AA8u)

/** \brief 5AAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AAAu)

/** \brief 5AAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AACu)

/** \brief 5AAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AAEu)

/** \brief 5AB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AB0u)

/** \brief 5AB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AB2u)

/** \brief 5AB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AB4u)

/** \brief 5AB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AB6u)

/** \brief 5AB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AB8u)

/** \brief 5ABA, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ABAu)

/** \brief 5ABC, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ABCu)

/** \brief 5ABE, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ABEu)

/** \brief 5AC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AC0u)

/** \brief 5AC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AC2u)

/** \brief 5AC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AC4u)

/** \brief 5AC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AC6u)

/** \brief 5AC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AC8u)

/** \brief 5ACA, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ACAu)

/** \brief 5ACC, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ACCu)

/** \brief 5ACE, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ACEu)

/** \brief 5AD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AD0u)

/** \brief 5AD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AD2u)

/** \brief 5AD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AD4u)

/** \brief 5AD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AD6u)

/** \brief 5AD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AD8u)

/** \brief 5ADA, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ADAu)

/** \brief 5ADC, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ADCu)

/** \brief 5ADE, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ADEu)

/** \brief 5AE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AE0u)

/** \brief 5AE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AE2u)

/** \brief 5AE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC90_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AE4u)

/** \brief 5AF2, Error Information Register ${x} */
#define MTU_MC90_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066AF2u)

/** \brief 5AF4, Error Information Register ${x} */
#define MTU_MC90_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066AF4u)

/** \brief 5AF6, Error Information Register ${x} */
#define MTU_MC90_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066AF6u)

/** \brief 5AF8, Error Information Register ${x} */
#define MTU_MC90_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066AF8u)

/** \brief 5AFA, Error Information Register ${x} */
#define MTU_MC90_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066AFAu)

/** \brief 5B00, Configuration Register 0 */
#define MTU_MC91_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066B00u)

/** \brief 5B02, Configuration Register 1 */
#define MTU_MC91_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066B02u)

/** \brief 5B04, MBIST Control Register */
#define MTU_MC91_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066B04u)

/** \brief 5B06, Status Register */
#define MTU_MC91_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066B06u)

/** \brief 5B08, Range Register, single address mode */
#define MTU_MC91_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066B08u)

