Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5BA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BA8u)

/** \brief 5BAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BAAu)

/** \brief 5BAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BACu)

/** \brief 5BAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BAEu)

/** \brief 5BB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB0u)

/** \brief 5BB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB2u)

/** \brief 5BB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB4u)

/** \brief 5BB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB6u)

/** \brief 5BB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB8u)

/** \brief 5BBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BBAu)

/** \brief 5BBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BBCu)

/** \brief 5BBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BBEu)

/** \brief 5BC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC0u)

/** \brief 5BC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC2u)

/** \brief 5BC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC4u)

/** \brief 5BC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC6u)

/** \brief 5BC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC8u)

/** \brief 5BCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BCAu)

/** \brief 5BCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BCCu)

/** \brief 5BCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BCEu)

/** \brief 5BD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD0u)

/** \brief 5BD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD2u)

/** \brief 5BD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD4u)

/** \brief 5BD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD6u)

/** \brief 5BD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BD8u)

/** \brief 5BDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BDAu)

/** \brief 5BDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BDCu)

/** \brief 5BDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BDEu)

/** \brief 5BE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BE0u)

/** \brief 5BE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BE2u)

/** \brief 5BE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC91_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BE4u)

/** \brief 5BF2, Error Information Register ${x} */
#define MTU_MC91_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF2u)

/** \brief 5BF4, Error Information Register ${x} */
#define MTU_MC91_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF4u)

/** \brief 5BF6, Error Information Register ${x} */
#define MTU_MC91_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF6u)

/** \brief 5BF8, Error Information Register ${x} */
#define MTU_MC91_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BF8u)

/** \brief 5BFA, Error Information Register ${x} */
#define MTU_MC91_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066BFAu)

/** \brief 5C00, Configuration Register 0 */
#define MTU_MC92_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066C00u)

/** \brief 5C02, Configuration Register 1 */
#define MTU_MC92_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066C02u)

/** \brief 5C04, MBIST Control Register */
#define MTU_MC92_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066C04u)

/** \brief 5C06, Status Register */
#define MTU_MC92_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066C06u)

/** \brief 5C08, Range Register, single address mode */
#define MTU_MC92_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066C08u)

/** \brief 5C0C, Revision ID Register */
#define MTU_MC92_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0066C0Cu)

/** \brief 5C0E, ECC Safety Register */
#define MTU_MC92_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0066C0Eu)

/** \brief 5C10, Memory ECC Detection Register */
#define MTU_MC92_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066C10u)

/** \brief 5C12, Error Tracking Register ${x} */
#define MTU_MC92_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C12u)

/** \brief 5C14, Error Tracking Register ${x} */
#define MTU_MC92_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C14u)

/** \brief 5C16, Error Tracking Register ${x} */
#define MTU_MC92_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C16u)

/** \brief 5C18, Error Tracking Register ${x} */
#define MTU_MC92_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C18u)

/** \brief 5C1A, Error Tracking Register ${x} */
#define MTU_MC92_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066C1Au)


/** \brief 5C60, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C60u)

