Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5C62, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C62u)

/** \brief 5C64, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C64u)

/** \brief 5C66, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C66u)

/** \brief 5C68, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C68u)

/** \brief 5C6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C6Au)

/** \brief 5C6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C6Cu)

/** \brief 5C6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C6Eu)

/** \brief 5C70, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C70u)

/** \brief 5C72, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C72u)

/** \brief 5C74, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C74u)

/** \brief 5C76, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C76u)

/** \brief 5C78, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C78u)

/** \brief 5C7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C7Au)

/** \brief 5C7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C7Cu)

/** \brief 5C7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C7Eu)

/** \brief 5C80, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C80u)

/** \brief 5C82, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C82u)

/** \brief 5C84, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C84u)

/** \brief 5C86, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C86u)

/** \brief 5C88, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C88u)

/** \brief 5C8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C8Au)

/** \brief 5C8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C8Cu)

/** \brief 5C8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C8Eu)

/** \brief 5C90, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C90u)

/** \brief 5C92, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C92u)

/** \brief 5C94, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C94u)

/** \brief 5C96, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C96u)

/** \brief 5C98, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C98u)

/** \brief 5C9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C9Au)

/** \brief 5C9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C9Cu)

/** \brief 5C9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C9Eu)

/** \brief 5CA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA0u)

/** \brief 5CA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA2u)

/** \brief 5CA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA4u)

/** \brief 5CA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA6u)

/** \brief 5CA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA8u)

/** \brief 5CAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CAAu)

/** \brief 5CAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CACu)

/** \brief 5CAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CAEu)

/** \brief 5CB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB0u)

/** \brief 5CB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB2u)

/** \brief 5CB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB4u)

/** \brief 5CB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB6u)

/** \brief 5CB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB8u)

