Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5CBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CBAu)

/** \brief 5CBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CBCu)

/** \brief 5CBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CBEu)

/** \brief 5CC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC0u)

/** \brief 5CC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC2u)

/** \brief 5CC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC4u)

/** \brief 5CC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC6u)

/** \brief 5CC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC8u)

/** \brief 5CCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CCAu)

/** \brief 5CCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CCCu)

/** \brief 5CCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CCEu)

/** \brief 5CD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CD0u)

/** \brief 5CD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CD2u)

/** \brief 5CD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CD4u)

/** \brief 5CD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CD6u)

/** \brief 5CD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CD8u)

/** \brief 5CDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CDAu)

/** \brief 5CDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CDCu)

/** \brief 5CDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CDEu)

/** \brief 5CE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CE0u)

/** \brief 5CE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CE2u)

/** \brief 5CE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC92_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CE4u)

/** \brief 5CF2, Error Information Register ${x} */
#define MTU_MC92_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066CF2u)

/** \brief 5CF4, Error Information Register ${x} */
#define MTU_MC92_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066CF4u)

/** \brief 5CF6, Error Information Register ${x} */
#define MTU_MC92_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066CF6u)

/** \brief 5CF8, Error Information Register ${x} */
#define MTU_MC92_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066CF8u)

/** \brief 5CFA, Error Information Register ${x} */
#define MTU_MC92_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066CFAu)

/** \brief 5D00, Configuration Register 0 */
#define MTU_MC93_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066D00u)

/** \brief 5D02, Configuration Register 1 */
#define MTU_MC93_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066D02u)

/** \brief 5D04, MBIST Control Register */
#define MTU_MC93_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066D04u)

/** \brief 5D06, Status Register */
#define MTU_MC93_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066D06u)

/** \brief 5D08, Range Register, single address mode */
#define MTU_MC93_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066D08u)

/** \brief 5D0C, Revision ID Register */
#define MTU_MC93_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0066D0Cu)

/** \brief 5D0E, ECC Safety Register */
#define MTU_MC93_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0066D0Eu)

/** \brief 5D10, Memory ECC Detection Register */
#define MTU_MC93_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066D10u)

/** \brief 5D12, Error Tracking Register ${x} */
#define MTU_MC93_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066D12u)

/** \brief 5D14, Error Tracking Register ${x} */
#define MTU_MC93_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066D14u)

/** \brief 5D16, Error Tracking Register ${x} */
#define MTU_MC93_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066D16u)

/** \brief 5D18, Error Tracking Register ${x} */
#define MTU_MC93_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066D18u)

/** \brief 5D1A, Error Tracking Register ${x} */
#define MTU_MC93_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066D1Au)


/** \brief 5D60, Read Data and Bit Flip Register ${y} */
#define MTU_MC93_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D60u)

/** \brief 5D62, Read Data and Bit Flip Register ${y} */
#define MTU_MC93_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D62u)

/** \brief 5D64, Read Data and Bit Flip Register ${y} */
#define MTU_MC93_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D64u)

/** \brief 5D66, Read Data and Bit Flip Register ${y} */
#define MTU_MC93_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D66u)

