Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5ECE, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ECEu)

/** \brief 5ED0, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ED0u)

/** \brief 5ED2, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ED2u)

/** \brief 5ED4, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ED4u)

/** \brief 5ED6, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ED6u)

/** \brief 5ED8, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ED8u)

/** \brief 5EDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EDAu)

/** \brief 5EDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EDCu)

/** \brief 5EDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EDEu)

/** \brief 5EE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EE0u)

/** \brief 5EE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EE2u)

/** \brief 5EE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC94_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EE4u)

/** \brief 5EF2, Error Information Register ${x} */
#define MTU_MC94_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066EF2u)

/** \brief 5EF4, Error Information Register ${x} */
#define MTU_MC94_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066EF4u)

/** \brief 5EF6, Error Information Register ${x} */
#define MTU_MC94_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066EF6u)

/** \brief 5EF8, Error Information Register ${x} */
#define MTU_MC94_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066EF8u)

/** \brief 5EFA, Error Information Register ${x} */
#define MTU_MC94_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066EFAu)

/** \brief 5F00, Configuration Register 0 */
#define MTU_MC95_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066F00u)

/** \brief 5F02, Configuration Register 1 */
#define MTU_MC95_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066F02u)

/** \brief 5F04, MBIST Control Register */
#define MTU_MC95_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066F04u)

/** \brief 5F06, Status Register */
#define MTU_MC95_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066F06u)

/** \brief 5F08, Range Register, single address mode */
#define MTU_MC95_RANGE /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066F08u)

/** \brief 5F0C, Revision ID Register */
#define MTU_MC95_REVID /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0066F0Cu)

/** \brief 5F0E, ECC Safety Register */
#define MTU_MC95_ECCS /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0066F0Eu)

/** \brief 5F10, Memory ECC Detection Register */
#define MTU_MC95_ECCD /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066F10u)

/** \brief 5F12, Error Tracking Register ${x} */
#define MTU_MC95_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066F12u)

/** \brief 5F14, Error Tracking Register ${x} */
#define MTU_MC95_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066F14u)

/** \brief 5F16, Error Tracking Register ${x} */
#define MTU_MC95_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066F16u)

/** \brief 5F18, Error Tracking Register ${x} */
#define MTU_MC95_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066F18u)

/** \brief 5F1A, Error Tracking Register ${x} */
#define MTU_MC95_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066F1Au)


/** \brief 5F60, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F60u)

/** \brief 5F62, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F62u)

/** \brief 5F64, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F64u)

/** \brief 5F66, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F66u)

/** \brief 5F68, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F68u)

/** \brief 5F6A, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F6Au)

/** \brief 5F6C, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F6Cu)

/** \brief 5F6E, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F6Eu)

/** \brief 5F70, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F70u)

/** \brief 5F72, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F72u)

/** \brief 5F74, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F74u)

/** \brief 5F76, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F76u)

/** \brief 5F78, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F78u)

