Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5F7A, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F7Au)

/** \brief 5F7C, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F7Cu)

/** \brief 5F7E, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F7Eu)

/** \brief 5F80, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F80u)

/** \brief 5F82, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F82u)

/** \brief 5F84, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F84u)

/** \brief 5F86, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F86u)

/** \brief 5F88, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F88u)

/** \brief 5F8A, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F8Au)

/** \brief 5F8C, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F8Cu)

/** \brief 5F8E, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F8Eu)

/** \brief 5F90, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F90u)

/** \brief 5F92, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F92u)

/** \brief 5F94, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F94u)

/** \brief 5F96, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F96u)

/** \brief 5F98, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F98u)

/** \brief 5F9A, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F9Au)

/** \brief 5F9C, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F9Cu)

/** \brief 5F9E, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F9Eu)

/** \brief 5FA0, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA0u)

/** \brief 5FA2, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA2u)

/** \brief 5FA4, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA4u)

/** \brief 5FA6, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA6u)

/** \brief 5FA8, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA8u)

/** \brief 5FAA, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FAAu)

/** \brief 5FAC, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FACu)

/** \brief 5FAE, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FAEu)

/** \brief 5FB0, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL40 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB0u)

/** \brief 5FB2, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL41 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB2u)

/** \brief 5FB4, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL42 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB4u)

/** \brief 5FB6, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL43 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB6u)

/** \brief 5FB8, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL44 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB8u)

/** \brief 5FBA, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL45 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FBAu)

/** \brief 5FBC, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL46 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FBCu)

/** \brief 5FBE, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL47 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FBEu)

/** \brief 5FC0, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL48 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC0u)

/** \brief 5FC2, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL49 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC2u)

/** \brief 5FC4, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL50 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC4u)

/** \brief 5FC6, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL51 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC6u)

/** \brief 5FC8, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL52 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC8u)

/** \brief 5FCA, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL53 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FCAu)

/** \brief 5FCC, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL54 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FCCu)

/** \brief 5FCE, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL55 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FCEu)

/** \brief 5FD0, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL56 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD0u)

