Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_reg.h
/** \brief 5FD2, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL57 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD2u)

/** \brief 5FD4, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL58 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD4u)

/** \brief 5FD6, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL59 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD6u)

/** \brief 5FD8, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL60 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD8u)

/** \brief 5FDA, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL61 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FDAu)

/** \brief 5FDC, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL62 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FDCu)

/** \brief 5FDE, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL63 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FDEu)

/** \brief 5FE0, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL64 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FE0u)

/** \brief 5FE2, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL65 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FE2u)

/** \brief 5FE4, Read Data and Bit Flip Register ${y} */
#define MTU_MC95_RDBFL66 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FE4u)

/** \brief 5FF2, Error Information Register ${x} */
#define MTU_MC95_ERRINFO0 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF2u)

/** \brief 5FF4, Error Information Register ${x} */
#define MTU_MC95_ERRINFO1 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF4u)

/** \brief 5FF6, Error Information Register ${x} */
#define MTU_MC95_ERRINFO2 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF6u)

/** \brief 5FF8, Error Information Register ${x} */
#define MTU_MC95_ERRINFO3 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF8u)

/** \brief 5FFA, Error Information Register ${x} */
#define MTU_MC95_ERRINFO4 /*lint --e(923)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FFAu)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMTU_REG_H */
